{"additions": 15475, "auther_ref": "prototype-geometricdetextra_backup", "auther_sha": "c05d615ba6b94eda2c67763e53ca98f17c19ecd7", "author": "adewit", "body": "#### PR description:\r\n\r\nThis adds a phase 2 tracker geometry (T27) containing bricked pixels in TEPX&TFPX, as well as the central 1 (3) rod(s) of TBPX L2 (L3 and 4). Because the information about whether a pixel is \"bricked\" or not should be available at the level of the geometry, a new record to store this information has also been added, as discussed in [these slides](https://indico.cern.ch/event/1045483/contributions/4392063/attachments/2258285/3832430/Brickedness_SIM_AdeWit_0406.pdf). Note that wrt that presentation, the record has been renamed `PTrackerAdditionalParametersPerDetRcd`, and it has been made expandable to make it possible to add further bool/int/float per-detID information for the tracker in the future.\r\n For now the record is created from the XML, as no Phase 2 geometries are stored in the DB, but a DB writer is also included for future use. \r\n\r\n**NOTE: the new record `PTrackerAdditionalParametersPerDetRcd` is consumed by the TrackerGeomBuilderFromGeometricDet, which is the same for Runs 2&3 and Phase 2. Therefore this PR also modifies Runs 2&3, by including the new record, which however only contains the default value (False) for the brickedness boolean, as this parameter of course does not exist before Phase 2**\r\n\r\nThe new tracker geometry T27 that uses the bricked pixels is part of detector D85. The workflows for D85 only run up to and including the digitization step to avoid having to include changes in the reconstruction code at this point. **NOTE: the modifications to the digitzer that are needed to handle bricked pixels are NOT included in this PR** ( @franzglessgen will provide that in due course). In the current state the standard digitizer for planar pixels will be used; this is of course not the final configuration but it does not lead to problems.\r\n\r\n@emiglior @mmusich fyi\r\n\r\n#### PR validation:\r\n\r\n- Checked that the addition of the new rcd does not break non-Phase2 workflows (checked for a few workflows)\r\n- Checked that the information on the brickedness of the pixels is passed on as expected\r\n- Verified that the DB writer is working\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nNot a backport\r\n", "branch": "master", "changed_files": 138, "closed_at": "1627468624", "comments": 115, "commits": 6, "created_at": "1623694446", "deletions": 39, "labels": ["alca-approved", "code-checks-approved", "db-approved", "fully-signed", "geometry-approved", "hlt-approved", "operations-approved", "orp-approved", "pdmv-approved", "requires-external", "tests-approved", "upgrade-approved", "urgent"], "merge_commit_sha": "2ae8494196fdd89978ea0795cf0a3f6440c94280", "merged_at": "1627468624", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 34120, "release-notes": [], "review_comments": 21, "state": "closed", "title": "Run 2, Run3, and Phase2 tracker: adding T27 (geometry with bricked pixels) and support for storing bricked pixel information", "updated_at": "1627468624", "user": "adewit"}