{"additions": 431, "auther_ref": "VtxSmeared", "auther_sha": "f719245b0f6537cf9b1de74fd1aa19d7d9a2d43b", "author": "wmtan", "body": "This PR is the chosen implementation for avoiding modifying HepMCProduct in place (aka smearing the vertices in place). The smearers (aka vertex generators) still run as EDProducers, but they copy the HepMCProduct, smear the copy, and put the copy into the event with module label \"VtxSmeared\".\nIn order to make this PR backward compatible (see below) another producer with label \"generatorSmeared\"copies the HepMCProduct, and the HepMCProduct with label \"generatorSmeared\" is the one that is kept on output.\nThe consumers of the smeared HepMCProduct are modified to use the module label \"generatorSmeared\" instead of \"generator\". Also, the generators now create the HepMCProduct with the product instance name \"unsmeared\", so consumers of the unsmeared HepMCProduct must explicitly use \"unsmeared\" as the product instance name, in addition to the \"generator\" module label. This is a defensive measure to ensure that consumers always get the smeared HepMCProduct unless they explicitly specify \"unsmeared\".\nFor backward compatibility, the producer of HepMCProduct with label \"generatorSmeared\" also runs at the beginning of the digitization step. If it finds a HepMCproduct with label \"generator\" or \"VtxSmeared\", it copies it, creating a HepMCProduct with module label \"generatorSmeared\". In this way, files containing GEN-SIM written prior to this PR can still be read.\n", "branch": "CMSSW_7_6_X", "changed_files": 240, "closed_at": "1443173470", "comments": 68, "commits": 1, "created_at": "1439995536", "deletions": 345, "labels": ["alca-approved", "analysis-pending", "comparison-available", "core-approved", "dqm-approved", "fastsim-approved", "generators-pending", "operations-pending", "orp-pending", "pending-signatures", "reconstruction-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "5ecf6815bcdca9fba9211e53533daabede2a7854", "merged_at": "1443173470", "merged_by": "davidlange6", "milestone": "CMSSW_7_6_X", "number": 10858, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Do not update HepMCProduct in place (producer implementation)", "updated_at": "1445611540", "user": "wmtan"}