{"additions": 1057, "auther_ref": "mm_dev_TrackingResolution_14_0_X", "auther_sha": "3da22f135cede8946c5fb127de8f66bbd4905ba0", "author": "mmusich", "body": "#### PR description:\r\n\r\nThis is a follow-up to PR https://github.com/cms-sw/cmssw/pull/43613.\r\nThat PR introduced  a novel data-driven method to artificially shorten muon tracks to assess the tracking pT resolution of short tracks, relying on shortening the muon tracks by creating track candidates with new hit collections that have the outermost hits removed from the original collection.\r\nThis method is potentially very useful to assess the performance of Tracker Alignment in terms of track transverse momentum (e.g. several weak modes can affect the PT resolution with a dependence along the tracker radius or the beamline).\r\nThis PR adapts `SingleLongTrackProducer` to work also in the case of ALCARECO event data format. Additionally it implements the same workflow in a standalone mode (not dependent on DQM) adding in `Alignment/OfflineValidation` the module `ShortenedTrackValidation` which can be used for validation purposes after standalone track refits with target conditions. \r\n\r\n#### PR validation:\r\n\r\n`scram b runtests_testTrackingResolution` runs fine. Also run private validation using the configuration committed in `Alignment/OfflineValidation`. \r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nN/A", "branch": "master", "changed_files": 8, "comments": 18, "commits": 3, "created_at": "1705487052", "deletions": 30, "labels": ["reconstruction-pending", "dqm-pending", "alca-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "tracking", "trk"], "milestone": "CMSSW_14_0_X", "number": 43729, "release-notes": [], "review_comments": 2, "state": "open", "title": "Adapt shortened tracks resolution method to work with AlCaReco event content", "updated_at": "1705567552", "user": "mmusich"}