{"additions": 847, "auther_ref": "ML4DQM_EB_integration_121X", "auther_sha": "13ac29bd091f33bdcacc9d78e0d82dbc1372ecd6", "author": "abhih1", "body": "#### PR description:\r\n\r\nThis PR introduces a machine learning based anomaly detection feature to the online ECAL DQM for the Ecal Barrel through a new DQM Client `MLClient`. An Autoencoder (AE) model with a ResNet architecture is trained on certified good data (EB digi occupancy) from 2018 runs.\r\nOn giving an input occupancy map to the AE, the encoder part of the AE encodes and learns the features and the decoder reconstructs the data from the encoded latent space to match the input as closely as possible. The reconstruction loss is then calculated, which is a mean squared error (MSE) between the input and output images at a tower level. Thus given an anomalous tower, the AE which has learnt the features of the good data will have a hard time reconstructing it and give a higher loss on the anomaly than on the good towers. A quality threshold is then applied on this loss map which marks it as Good or Bad, which is then stored as an ML quality summary plot.\r\n\r\nWe also do some pre processing and post processing steps to have a uniform, robust anomaly detection with fewer false positives over the changing detector conditions. The details of this are included in the comments throughout the code, and also can be found in this talk presented at a central DQM meeting [1]\r\n\r\nPlease note that the ML quality summary plot is a complimentary plot in addition to the existing DQM plots, and will be used for ECAL internal consumption only pending successful commissioning.\r\nAlong with the main ML quality summary plot, we also introduce a few monitoring plots to monitor the trends in Pileup (PU) per lumisection, no.of events processed in a lumisection and no.of events per input image to the ML model. This is in anticipation of the low luminosity expected during the start of Run 3. A few hyper parameters of our pre and post processing steps will also have to be tuned according to these trends, as currently they are derived from the conditions of Run 2.\r\n\r\nPlease also note that this version of the PR is only meant for code integrations tests during the November 2021 MWGR. The plots will only be meaningful when we have real collisions, and modifications are foreseen after gathering data from the beginning of Run 3.\r\n\r\n[1] https://indico.cern.ch/event/1042141/contributions/4377869/attachments/2254007/3824216/ML4DQM_AbhiramiHarilal_May28.pdf\r\n\r\n#### PR validation:\r\n\r\nThe code was validated by running the modified online Ecal DQM configuration with the new client enabled and the resultant plots were examined by uploading the output file to a DQM test gui.\r\nThe new plots are confirmed and look reasonable.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\nThis is a backport of https://github.com/cms-sw/cmssw/pull/35990.\r\nThis is made to ensure that the versions are in sync.", "branch": "CMSSW_12_1_X", "changed_files": 9, "closed_at": "1636712903", "comments": 21, "commits": 5, "created_at": "1636048912", "deletions": 8, "labels": ["dqm-approved", "fully-signed", "tests-approved", "orp-approved", "requires-external"], "merge_commit_sha": "5ae48694a2cd7b5e4e320c2969d2972b7eb77cda", "merged_at": "1636712903", "merged_by": "cmsbuild", "milestone": "CMSSW_12_1_X", "number": 35992, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Integration of the ML based online Ecal DQM using autoencoder network [CMSSW_12_1_X]", "updated_at": "1636712904", "user": "abhih1"}