{"additions": 1070, "auther_ref": "10_6_0_pre3-new-output-module-april2019", "auther_sha": "c08f9483779a30848e95b1e1a1a0f9514ae94c83", "author": "smorovic", "body": "#### PR description:\r\n\r\nThis is DAQ (HLT/Filter Farm) output module implementation based on one::OutputModule watching LuminosityBlockCache. In that case limitation of handling only one LS at the time present in current DAQ module is removed. Based on #25951 which was an attempt to do this using limited output module class, and possible thanks to improvements made in #26196.\r\n\r\nStreamerOutputModuleBase (inheriting one::OutputModule) base is restructured and serializer code (shared with the new EvFOutputModule) extracted to a common class which can be used by both module types (which inherit on different templated class of one::OutputModule). Currently, \"base\" is used by: DQM test module, Streamer writer module and previous DAQ output module which will still be kept for some time in the release.\r\n\r\nNew module is called EvFOutputModule while previous DAQ module remains registered ShmStreamConsumer (this name is currently still used in production configurations).\r\n\r\n\r\n\r\n#### PR validation:\r\n\r\nOutput module was added and tested with configuration EventFilter/Utilities/test/startFU.py and also new configuration configured to work with 2 concurrent LS at the time: start_multiLS_FU.py.\r\n\r\nIt has also been verified to work in test setup emulating the Filter Farm: using both old and new version of the output module (former being tested due to changes made in the base class). Both output modules produced files or comparable size, identical header. Also, dat files from the new module could be normally read by the NewEventStreamFileReader source.", "branch": "master", "changed_files": 16, "comments": 1, "commits": 12, "created_at": "1554894426", "deletions": 316, "labels": ["code-checks-pending", "comparison-pending", "core-pending", "daq-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-pending"], "milestone": "CMSSW_10_6_X", "number": 26425, "release-notes": [], "review_comments": 0, "state": "open", "title": "DAQ multi-LS output module (10_6_X)", "updated_at": "1554894462", "user": "smorovic"}