{"additions": 51, "auther_ref": "dqmJetCorrectorMigration", "auther_sha": "65cd4fdc3295a44f1973cf9d7b1be4aed82e0d78", "author": "wddgit", "body": "#### PR description:\r\n\r\nThis is part of the migration from getting the deprecated ::JetCorrector class from the EventSetup to getting the   new reco::JetCorrector from the Event. This migration has been in progress since 2014 and is nearly complete. There are only a few cases left that need migrating. We want to finish this soon and delete the deprecated header file and related code. This is related to the consumes migration and will improve multi-threading performance.\r\n\r\nThis PR handles the remaining cases in the package DQM/Physics. I need some help with this from DQM if possible.\r\n\r\nFirst question. Is this code still used? If not, I would rather delete it entirely than continue maintaining dead code.\r\n\r\nThe existing code has what appears to be a bug. See for example, https://cmssdt.cern.ch/dxr/CMSSW/source/DQM/Physics/src/SingleTopTChannelLeptonDQM.cc#511\r\n\r\nThe following conditional always evaluates to false.\r\n\r\n```\r\nif (!jetCorrector_.isInitialized() && jetCorrector_.hasValidIndex())\r\n```\r\n\r\nSo the code inside that conditional  that uses the deprecated JetCorrector class is never actually executed. From the history, it appears this is not intentional. If it was intentional, I could just delete the related code fragments, not modify the behavior, and complete the migration. If you want this, please let me know.\r\n\r\nIn the PR, I have migrated the C++ code to use the new interface in reco::JetCorrector. I need help, because I do not know how to test this code. I also do not know how to verify that the configurations are correct and reading the correct JetCorrector objects. Is there a DQM expert who could help with this? Which tests should I run? I am willing to do a little more work on this, but need some help and/or direction.\r\n\r\nThere are no unit tests. I've run the limited runTheMatrix.py tests, but I do not know if they use this code or not. If I know what tests to run, then I will try to run them. There may be implications for changing histograms and needing to update comparison reference histograms and DQM experts would need to handle that.\r\n\r\nI am a Core expert, not a DQM expert so help from DQM on this migration would be appreciated.\r\n\r\nNote the old JetCorrectors for the EventSetup are no longer supported. I'm not sure that they would run without exceptions even if the existing bug was fixed.\r\n\r\n#### PR validation:\r\n\r\nIt compiles and builds. There are no unit tests. Limited runTheMatrix tests pass, but I do not know if those execute this code.\r\n", "branch": "master", "changed_files": 11, "comments": 15, "commits": 1, "created_at": "1666710093", "deletions": 103, "labels": ["dqm-approved", "pending-signatures", "tests-approved", "orp-pending", "hold", "code-checks-approved"], "milestone": "CMSSW_12_6_X", "number": 39847, "release-notes": [], "review_comments": 0, "state": "open", "title": "JetCorrector migration in DQM/Physics", "updated_at": "1668478865", "user": "wddgit"}