{"additions": 2474, "auther_ref": "from-CMSSW_10_6_X_2019-03-25-1100-Tight-Muon-Hit-Matching-I", "auther_sha": "bb668a8c844ce6b075ea2bd3924811cbaef7d4e8", "author": "dildick", "body": "#### PR description:\r\n\r\nWhich hits in the CMS Muon system originate from a particular simulated muon particle? In the development of new trigger algorithms it is often necessary to discriminate true muon simhits from electron/punch-through/pileup simhits, for example to determine the true efficiency and fake rate.\r\n\r\nTao Huang and I have been developing [such validation code](https://github.com/gem-sw/GEMCode/tree/for-CMSSW-105X/GEMValidation/interface) since ~2013 and have been using it in our trigger studies for the GEM TDR, Muon Phase-II TP, Muon Upgrade TDR and the L1 Interim TDR. I would now like to provide these expert tools to the larger muon & trigger community. \r\n\r\n- This PR introduces classes that match simtracks to GEM/ME0/DT/CSC/RPC simhits. The matching is based on the equivalence of `trackId` between simtrack and simhit. \r\n- A matcher class is available for each muon type with many useful functions. Common functions are collected in a base class to avoid code duplication. \r\n- In a follow-up PR I plan to replace the old [GEM SimHitMatcher module](https://github.com/cms-sw/cmssw/blob/master/Validation/MuonGEMHits/interface/SimHitMatcher.h) by the new GEMSimHitMatcher. The internal machinery of the old and new classes are the same however.\r\n- Parameters to instantiate a matcher for use in an (DQM)EDAnalyzer are collected in a handy PSet. \r\n- The MuonSimHitsValidAnalyzer was moved from src/ to plugins/ to adhere to the CMSSW style guidelines.\r\n\r\nFYI @tahuang1991 @civanch @mdhildreth \r\n\r\n#### PR validation:\r\n\r\nThe code compiles. The modules are currently not hooked up to existing validation modules, so they should not break any workflows. I also tested the modules by instantiating them in existing DQMEDanalyzers and running on a set of recent high pileup MC samples from the MTD campaign. That showed no obvious issues.", "branch": "master", "changed_files": 20, "comments": 71, "commits": 10, "created_at": "1553570460", "deletions": 25, "labels": ["code-checks-approved", "comparison-available", "dqm-pending", "orp-pending", "pending-signatures", "tests-approved"], "milestone": "CMSSW_10_6_X", "number": 26249, "release-notes": [], "review_comments": 8, "state": "open", "title": "SimTrack to muon SimHit matching classes in Muon Validation code", "updated_at": "1555072948", "user": "dildick"}