{"additions": 52, "auther_ref": "fix_pfblockfastsim", "auther_sha": "ffb4776b81d116f673f30a9d9a8ebc998a4dc63d", "author": "lgray", "body": "This PR addresses the follow up at the end of the PFBlockAlgo overhaul to see what was going on in the fast sim workflow since there was an event with changed block content.\n\nFurther study showed that there was some strange behavior in the old version of PFBlockAlgo where tracks that were included in multiple conversion vertices would be imported multiple times (bad behavior for linking, PFEGammaAlgo). In the new version of PFBlockAlgo only the ref from the last-encountered conversion was being saved (bad behavior for linking). Furthermore, in the old PFBlockAlgo only the last found element was updated if it overlapped with a muon or nuclear interaction vertex.\n\nNote that this may be an issue rather specific to fastsim.\n\nNow the PFBlockElementTrack can store multiple conversion refs, and the tracks are only imported once. This ensures optimal behavior of the linker as well as content of the blocks. \n\nCompared to CMSSW_7_1_X_2014-04-24-1400 without 3385. The one discrepant event for block.element.size() is still there, but now blocks.size() agrees for all events in wf5.1. There could be possible knock on effects in terms of conversion multiplicity (judging from 3385 validation probably not so much), but this new behavior is known to be more correct.\n\nI saw no effect on the block content in 1k events of wf38 compared to #3385.\n", "branch": "CMSSW_7_1_X", "changed_files": 11, "closed_at": "1398828355", "comments": 6, "commits": 1, "created_at": "1398565918", "deletions": 34, "labels": ["comparison-available", "fully-signed", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "041a37a4363dc2eeca9fc3eafaccaf68a0bfe5b1", "merged_at": "1398828355", "merged_by": "ktf", "milestone": "CMSSW_7_1_0_pre8", "number": 3531, "release-notes": [], "review_comments": 0, "state": "closed", "title": "bugfix from followup of #3385 for fastsim.", "updated_at": "1398828355", "user": "lgray"}