{"additions": 206, "auther_ref": "CMSSW_12_0_X_2021-04-19-2300-remove-clct-centric-matching", "auther_sha": "a4ceb502579dd17fb568d7df928ac2d2d5a4c7cf", "author": "dildick", "body": "#### PR description:\r\n\r\n1) This PR removes the CLCT-centric matching option in the CSC trigger primitive producer. This would allow LCTs to be constructed with the CLCT BX as the reference BX for LCTs. It should be noted that CLCTs have a poorer time resolution than ALCTs, and they are also more sensitive to pileup. \r\n\r\nBetween 2005 and 2010, the CSC TP emulator was developed for Run-1 at UCLA. That version remained unchanged throughout Run-1. CMSSW_4_X_Y and CMSSW_5_X_Y all have the same latest commit. You can see in [CMSSW_4_1_X](https://github.com/cms-sw/cmssw/blob/CMSSW_4_1_X/L1Trigger/CSCTriggerPrimitives/src/CSCMotherboard.cc#L310-L374) that the emulator was written based on CLCT-centric matching. \r\n\r\nBetween 2010 and 2012 Vadim Khotilovich, (TAMU) did CSC trigger primitive studies with PU140 for the \"super-LHC\". He changed the matching to ALCT-centric for the upgrade OTMBs to improve the time resolution and mitigate some of the effects at high pileup. See https://github.com/cms-sw/cmssw/commit/5c65a14256000431d316267648721f0b4368031f.  Since 2014 we have been developing the GEM-CSC integrated local trigger based on the upgrade OTMB with ALCT-centric matching.\r\n\r\nIn February 2018, it was clarified by Andrew Peck (UCLA) to me that the firmware does (and always has done) ALCT-centric matching. The LCT BX is the ALCT BX, and ALCT+CLCT matches are formed by looking at an ALCT in some central time bin, then looking in the surrounding +/- some number of time bins for a CLCT. You can see this in the firmware [here](https://github.com/csc-fw/tmb_fw_code/blob/master/source/tmb/tmb.v#L988-L991). I updated the emulator in February 2018 to reflect this fact (https://github.com/cms-sw/cmssw/pull/22235). \r\n\r\n```verilog\r\n...\r\n// CLCT matched or alct-only\r\nwire alct_pulse  = alct0_pipe_vpf;\t\t\t\t\t\t\t// ALCT vpf\r\nwire alct_noclct = alct_pulse   && !clct_window_haslcts;\t// ALCT arrived, but there was no CLCT window open\r\nwire clct_match  = alct_pulse   &&  clct_window_haslcts;\t// ALCT matches CLCT window, push to mpc on current bx\r\n\r\nwire clct_last_win    = clct_last_vpf && !clct_last_tag;\t// CLCT reached end of window\r\nwire clct_noalct      = clct_last_win && !alct_pulse;\t\t// No ALCT arrived in window, pushed mpc on last bx\r\nwire clct_noalct_lost = clct_last_win &&  alct_pulse && clct_win_best!=winclosing;// No ALCT arrived in window, lost to mpc contention\r\n\r\n// ALCT*CLCT match: alct arrived while there were 1 or more un-tagged clcts in the window\r\nassign clct_tag_me  = clct_match;\t\t// Tag the matching clct\r\nassign clct_tag_win = clct_win_best; \t// But get the one with highest priority\r\n...\r\n```\r\n\r\nAhead of Run-3 it would be good to finally remove the method from the simulation. \r\n\r\n2) This PR also removes all test constructors in the boards. The test constructors in the ALCT, CLCT and TMB were originally designed for beam tests at UCLA (early to mid 2000s). It does not make sense to maintain these constructors. All testing is now done within the CSC trigger primitive builder framework using MC simulation, and collision/cosmic data.\r\n\r\n3) It also consolidates 3 test configurations into a single one. \r\n\r\n#### PR validation:\r\n\r\nTested on WF 11634.0\r\n```\r\n11634.0_TTbar_14TeV+2021+TTbar_14TeV_TuneCP5_GenSim+Digi+Reco+HARVEST+ALCA Step0-PASSED Step1-PASSED Step2-PASSED Step3-PASSED Step4-PASSED  - time date Mon Apr 19 22:43:44 2021-date Mon Apr 19 21:56:54 2021; exit: 0 0 0 0 0\r\n1 1 1 1 1 tests passed, 0 0 0 0 0 failed\r\n```\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nN/A\r\n\r\nBefore submitting your pull requests, make sure you followed this checklist:\r\n- verify that the PR is really intended for the chosen branch\r\n- verify that changes follow [CMS Naming, Coding, And Style Rules](http://cms-sw.github.io/cms_coding_rules.html)\r\n- verify that the PR passes the basic test procedure suggested in the [CMSSW PR instructions](https://cms-sw.github.io/PRWorkflow.html)\r\n", "branch": "master", "changed_files": 24, "closed_at": "1618958755", "comments": 18, "commits": 4, "created_at": "1618883950", "deletions": 625, "labels": ["code-checks-rejected", "l1-pending", "orp-pending", "pending-signatures", "tests-pending"], "milestone": "CMSSW_12_0_X", "number": 33476, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Remove CLCT-centric matching option in CSC trigger primitives", "updated_at": "1618959023", "user": "dildick"}