{"additions": 106, "auther_ref": "geant4_physics_for_10.7", "auther_sha": "80799ec75e1358ead22aa8828a8632703c9b8686", "author": "civanch", "body": "#### PR description:\r\nAfter migration to Geant4 10.7 Physics Lists require modifications. In this PR Physics Lists based on FTF string model are updated:\r\n1) Neutron time cut is removed from Physics List in order to avoid duplication of such cut also implemented in CMS Stepping and Stacking actions. This removes inconsistency not allowing tracking of neutrons to ZDC, in Stepping action a different time cut is applied to the forward neutrons.\r\n2) SteppingAction and StackingAction classes very reviewed and a coherent modification for time window check is added. Also minor clean-up of these classes is done. A minor bug is fixed, which means definite kill of particle which is out of time.\r\n3) CMS hadron inelastic physics constructor allows specific configuration for pions, kaons, protons, and neutrons\r\n4) FTFP_BERT_EMM is CMS default using Geant4 10.7 overlap between the Bertini Cascade and the FTF string model, except more wide overlap for pions\r\n5) FTFP_BERT_EMM_TRK use optimized overlap for kaons on top of FTFP_BERT_EMM \r\n\r\nIt is expected, that regression will be broken due to forward neutrons especially in QCD FWs.\r\n\r\n#### PR validation:\r\nprivate\r\n\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\nno\r\n", "branch": "master", "changed_files": 12, "closed_at": "1620449837", "comments": 12, "commits": 3, "created_at": "1620203799", "deletions": 221, "labels": ["code-checks-approved", "fully-signed", "orp-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "9c955a497467f8cc57a7cc1eefc39d41d2d3d89e", "merged_at": "1620449837", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 33633, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Updated physics configurations for Geant4 ", "updated_at": "1620449837", "user": "civanch"}