{"additions": 52, "auther_ref": "Run3VertexingUpdate_May272022", "auther_sha": "87788437c603484e9689f9b1432266eac9c94fa5", "author": "abaty", "body": "The vertexing used in 2017/2018 heavy ion AA collisions worked well in most collisions (10-90% centralities), but was found to have deficiencies in very-low and very-high occupancy events.  This PR seeks to fix both of these issues before the start of the HI Run3.\r\n\r\nIn low-occupancy events, vertex inefficiency was caused by track filters which could lower the number of accepted tracks in the event to a number <2.  This PR removes the track filter requirement if the event has <10 filtered tracks to increase efficiency.  This change is done at the python configuration level.\r\n\r\nIn high-occupancy events, a fairly large amount of vertex splitting is found and the cpu time consumed is quite large because of the large number of tracks passing the filters.  This PR raises the filter pt threshold if >1000 filtered tracks are found in the event.  This causes the vertexing to run ~40% faster and reduces vertex splitting, while only impacting the vertex resolution minimally.  This change results in small modifications to the C++ code.\r\n\r\nA summary of performance can be seen in these slides shown in the heavy ion tracking group, as well as PAG meeting: [here](https://indico.cern.ch/event/1163063/contributions/4885089/attachments/2446935/4192963/VertexingImprovements_May17.pdf)\r\n\r\n#### PR validation:\r\n\r\nThe PR was validated by rerunning the vertexing for 2018 minimum-bias PbPb MC and data and comparing the output collection to the nominal cases.  One vertex is expected per event in these samples.\r\n\r\n@CesarBernardes  @mandrenguyen \r\n\r\n", "branch": "master", "changed_files": 7, "closed_at": "1661229082", "comments": 29, "commits": 3, "created_at": "1653624155", "deletions": 11, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "8ecb3c346b32f103a81f316dd947a94b20e3218b", "merged_at": "1661229082", "merged_by": "cmsbuild", "milestone": "CMSSW_12_5_X", "number": 38097, "release-notes": [], "review_comments": 10, "state": "closed", "title": "Update of Heavy Ion Vertexing for pp_on_AA and XeXe eras", "updated_at": "1661229082", "user": "abaty"}