{"additions": 4, "auther_ref": "ctpps_pixeLocalTracks_patch1", "auther_sha": "250b40a4db61aaaea023396fb4be64d87cd2c46d", "author": "CTPPS", "body": "we have just discovered a couple of issues in the reco code of the CTPPS pixels that is affecting our track efficiency. We have also found the reasons and prepared fixes.\r\nIt would be important if the fixes could already be put inside 940 and used for the re-reco We know that the deadline is passed but if we could find a way to put these patches it would really be great in terms of our performances.\r\n \r\nMore in details, the modifications proposed are minimal and are shown in this comparison:\r\nhttps://github.com/cms-sw/cmssw/compare/master...CTPPS:ctpps_pixeLocalTracks_patch1\r\n \r\nThe first bug is in RecoCTPPS/PixelLocal/src/RPixRoadFinder.cc : we observed it when reconstructing the tracks that use only 3 planes out of the 6.\r\nThe problem is at line 90 and 113 where the number of points found in the pattern is request to be greater than minRoadSize_ (currently set to 3)\r\ninstead of requesting greater or equal.\r\n \r\nThe second problem is something similar to what already discussed for the central pixel code last week between Danek and Andrea.\r\nWe have some pixels which show very low ADC values due to the non-uniform irradiation we are facing in CT-PPS.\r\nOnce calibrated, these pixels will show a negative charge and would be rejected.\r\nSince the problem appears in the pixels where we have the maximum number of physics hits (and hence are also the most irradiated)\r\nwe would lose a large number of good tracks.\r\nFor this reason we included a small change in RecoCTPPS/PixelLocal/src/RPixDetClusterizer.cc\r\nin order to save a fix charge in case the calibrated charge is below the threshold set from the python (variable already present in the merged version).\r\n \r\nPlease let us know what you think.", "branch": "master", "changed_files": 2, "closed_at": "1509646638", "comments": 14, "commits": 1, "created_at": "1509475396", "deletions": 4, "labels": ["bug-fix", "code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "82753fbb00b01c552c6c0c0d15780eb593e7a252", "merged_at": "1509646638", "merged_by": "cmsbuild", "milestone": "CMSSW_10_0_X", "number": 21107, "release-notes": [], "review_comments": 2, "state": "closed", "title": "CT-PPS Pixel local track reconstruction patch", "updated_at": "1509646638", "user": "fravera"}