{"additions": 116, "auther_ref": "convert-ObjectViewCleaner", "auther_sha": "040d081b61876d1a71be32daeef828509bf7d732", "author": "knoepfel", "body": "Significant changes were implemented during the conversion:\r\n\r\n1. In the legacy version, a C-style array of Booleans was used in the determination of whether to consider a candidate \"clean\".  The array was necessary because of a set of nested loops that were inverted with respect to the natural logic of the module.  I removed the C-style array and placed the \"candidates\" loop on the outside, so that a simple `if (shouldKeep(candidate)...)` statement could be used to determine if a candidate is clean.\r\n\r\n2. In one of the inner loops, the Boolean variable was being set to `false`, indicating that the candidate should not be considered clean.  However, instead of moving on to the next candidate, the loop continued until the entire container was traversed.  Since the `false` flag could never be turned back to `true`, this approach was inefficient.  I replaced that implementation with a function call where, if the candidate overlaps with a (e.g.) jet, instead of setting a flag, the function just returns `false`.\r\n\r\nI would appreciate it if the maintainers can check the changes in logic.  I do not believe I have introduced errors, but that statement is based on just testing `runTheMatrix.py -l 9.0`, which may be insufficient.\nAutomatically ported from CMSSW_9_0_X #17596 (original by @knoepfel).\nPlease wait for a new IB (12 to 24H) before requesting to test this PR.", "branch": "master", "changed_files": 1, "closed_at": "1488898918", "comments": 10, "commits": 2, "created_at": "1488454365", "deletions": 143, "labels": ["comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "2a7edb43d31c7609af6febff1cdaeb0c6de259eb", "merged_at": "1488898918", "merged_by": "cmsbuild", "milestone": "CMSSW_9_1_X", "number": 17715, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Convert ObjectViewCleaner from legacy producer to stream producer", "updated_at": "1489776013", "user": "cmsbuild"}