{"additions": 308, "auther_ref": "unbiasedMiniAODsuperClus", "auther_sha": "b2c2152cba2e4c352461df155c8721decfaa1c67", "author": "SanghyunKo", "body": "#### PR description:\r\n\r\nThis PR addresses two issues:\r\n\r\n1. Replace the ratio between corrected & uncorrected energy in Run 2 NanoAOD with the uncorrected energy itself (to avoid issues like #46046 - if the correction is 0, we cannot recover the energy before applying the correction using the ratio). The NanoDQM plots are modified accordingly.\r\n\r\n2. Currently, EGM still relies on AOD to derive central reco SFs. This is because the supercluster (SC) collection stored in MiniAOD is highly biased since we only store the SC that already reconstructed electron & photon objects. This PR attempts to improve the situation by migrating from the legacy AOD-based workflow to the (EGM) nanoAOD-based workflow. A minimal change in miniAOD is required to remove the biases implied in the current miniAOD. Furthermore, the SC track isolation suggested in #42007 is also incorporated into the EGM NanoAOD.\r\n\r\n#### PR validation:\r\n\r\nThe expected increase in miniAOD file size is marginal - DY: 0.27%, TTto2L2Nu: 0.62%, TTto4Q: 1% (tested 1k events with SC pt > 5 GeV). The increase in EGM nanoAOD due to the new SC collection is approximately 2%. A quick validation on the new track isolation variable has been performed with the DY & TTto4Q samples:\r\n\r\nDY\r\n![scTrkIso_DY](https://github.com/user-attachments/assets/7bdf244d-9451-40b9-ab9c-2fbee5cae92e)\r\n\r\nTTto4Q\r\n![scTrkIso_TTto4Q](https://github.com/user-attachments/assets/f43be350-ff67-4418-bca2-f7fea7a4b73d)\r\n\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNo backport is needed (this PR targets Nano v15).", "branch": "master", "changed_files": 13, "closed_at": "1729588035", "comments": 28, "commits": 10, "created_at": "1729163131", "deletions": 11, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "xpog-approved"], "merge_commit_sha": "8efc581609b82c0875323e65fecdf46adbdf6f12", "merged_at": "1729588035", "merged_by": "cmsbuild", "milestone": "CMSSW_14_2_X", "number": 46423, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Adding unbiased superclusters to miniAOD and EGM nano", "updated_at": "1729588036", "user": "SanghyunKo"}