{"additions": 452, "auther_ref": "port_to_egm", "auther_sha": "99ce2ba039697be23eccf803c0a096250be31c07", "author": "ssrothman", "body": "#### PR description:\r\n\r\nThis PR commits the first tranche of code to apply the newly developed Dynamic Reduction Network (DRN)-based energy regression for electrons implemented using pytorch. This commit is intended for the ECAL calibration use case where the energy of electron Mustache superclusters are corrected. This does not require to be added to the full reconstruction workflow and can be applied on the fly when the necessary nTuples needed for ECAL calibration are produced using the ECALELF framework.\r\n\r\nThe DRN model is implemented  in CMSSW ([here](RecoEcal/EgammaClusterAlgos/interface/SCEnergyCorrectorDRN.h) and [here](RecoEcal/EgammaClusterProducers/src/SCEnergyCorrectorDRNProducer.cc)) using the SONIC service, modifying the existing implementation of the BDT based regression and the corresponding producer.\r\n\r\nThe SONIC config file and torchscript regression weights needed are intended to be hosted on git cms-data. A PR will be created there committing these files referencing the current PR here.\r\n\r\nA summary of this DRN model as well as the rationale of the CMSSW implementation may  be found [here](https://indico.cern.ch/event/1051967/contributions/4550641/attachments/2331577/3973544/ML%20Forum%2010_20_2021.pdf).\r\n\r\nThis is a draft PR pending some careful checks of resource usage. In particular, prior to submitting the full PR we will\r\n1) carefully check the CPU utilization in our proposed workflow\r\n2) build a minimal triton server image to reduce the memory overhead\r\n\r\n#### PR validation:\r\n\r\nValidation has been performed using a custom cfg intended to be run using cmsRun that has been also committed in the test folder ([here](RecoEcal/EgammaClusterProducers/test/DRNTest_cfg.py)). Pending the cms-data PR, the config and weights files must be cloned from https://github.com/ssrothman/DRNData in order to run the validation config. A histogram of the predicted energy over the generated energy for both the DRN and the 2018 UL BDT (as well as the raw energy) is embedded here:\r\n\r\n![bigtest](https://user-images.githubusercontent.com/69219800/138736230-5873dd1f-2a35-4fdd-a274-ba31a8993888.png)\r\n\r\nIt has also been confirmed that this implementation yields identical results to the standalone python implementation used for training and validation of the DRN, such as in the slides linked above. \r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nAs of now a backport is not envisaged, but might be re-visited later.\r\n\r\n@Sam-Harper @lgray @kpedro88 @rchatter @lfinco @swagata87 @jainshilpi @SohamBhattacharya @simonepigazzini @violatingcp ", "branch": "master", "changed_files": 10, "closed_at": "1643959701", "comments": 99, "commits": 16, "created_at": "1635173687", "deletions": 0, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "requires-external", "code-checks-approved"], "merge_commit_sha": "488dcd29da0d78d268a68011bcae105bdfbdfa2c", "merged_at": "1643959701", "merged_by": "cmsbuild", "milestone": "CMSSW_12_3_X", "number": 35839, "release-notes": [], "review_comments": 45, "state": "closed", "title": "Dynamic Reduction Network-based electron energy regression using the SONIC service ", "updated_at": "1643959701", "user": "ssrothman"}