{"additions": 313, "auther_ref": "trackingValidationMonitorPileup", "auther_sha": "58c0caa353024dd7cc2c797454ccf68299ceb360", "author": "makortel", "body": "This PR adds three MultiTrackValidator instances to validation sequence\n- `trackValidatorFromPV` (DQM folder \"Tracking/TrackFromPV\")\n  - Monitors tracks associated to the reconstructed primary vertex wrt. TrackingParticles from the hard scatter event, only for events where the primary vertex is correctly identified (i.e. is matched to the generated one)\n  - Track-PV association is produced with the same code as in miniAOD, the used association criteria corresponds to the \"CompatibilityBTag\" flag\n  - Monitoring includes the full set of plots\n    - Efficiency shows the fraction of hard-scatter TPs that are reconstructed and associated to PV\n    - In fake rate the tracks from pileup are counted as fakes\n- `trackValidatorFromPVAllTP` (DQM folder \"Tracking/TrackFromPVAllTP\")\n  - Monitors the fake rate (and similar quantities) of PV-associated tracks wrt. all TrackingParticles, i.e. shows how much of the tracks associated to PV are fakes and how much from pileup\n- `trackValidatorAllTPEffic` (DQM folder \"Tracking/TrackAllTPEffic\")\n  - Monitors the efficiency of all tracks wrt. all TrackingParticles (in the existing `trackValidator` efficiency is defined wrt. hard-scatter TPs)\n  - This quantity is not very interesting for tracking performance, but helps to check if there are differences in pileup simulation between releases (or between classical mixing and premixing)\n\nFor the standard validation sequence, the new MTV instances above are set to monitor only generalTracks and highPurity tracks in order to keep the memory use under control. The instances for the \"standalone mode\" (running MTV privately alone), also the individual iterations are monitored.\n\nIn addition the PR includes some cleanup, most notably the recently added summary plots (#9201) are created and filled according to the `doSimTrackPlots`/`doRecoTrackPlots` configuration flags.\n\nTested in CMSSW_7_6_X_2015-07-10-1100, no changes expected in existing histograms.\n\n@rovere @VinInn \n", "branch": "CMSSW_7_6_X", "changed_files": 12, "closed_at": "1437714135", "comments": 9, "commits": 8, "created_at": "1436964076", "deletions": 97, "labels": ["comparison-available", "dqm-approved", "fully-signed", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "bd18e058011f59f30e31eea2282c90a2c42a74e7", "merged_at": "1437714135", "merged_by": "cmsbuild", "milestone": "CMSSW_7_6_X", "number": 10219, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Add additional MultiTrackValidator instances to validation", "updated_at": "1476956456", "user": "makortel"}