{"additions": 183, "auther_ref": "EGPFIsolMapFix74X", "auther_sha": "3e3cb6ba267f2796551d42441c9c721b7c873613", "author": "Sam-Harper", "body": "Dear All,\n\n@matteosan1 @lgray \n\nThis change effects the product named particleBasedIsolation. It is used by E/gamma in the computation of electron and photon particle flow isolation at analysis level. It is a final product of the reconstruction chain, nothing in RECO depends on it. \n\nThis map keeps track of which particle flow candidates make up the GedGsfElectron/GedPhoton. In the case the GedEle/Pho pass PF selection, this should only be the identified particle flow ele/pho. In the case the ele/pho fails PF selection, the ele/pho is broken up into charged/neutral/photons as PFAlgo sees fit.  The idea of the map is to flag which particles came from this break up and then veto them in the isolation sum. If you fail to do this, you will get a nice peak of PFIsol/et at 1 as all the ele/phos energy is dumped into the isolation region.\n\nWe have seen that the map is slightly bugged and is as such slightly greedy and sums in objects it shouldnt, particularly in the case of photon isolation. After extensive testing, we have decided that the map is to stay the same for neutral and charged hadrons but we will require the PFPhoton's leading ECAL element to be either the GedEle/Pho's supercluster or one of its subclusters in addition to previous requirements. This change fixes this, it is a small improvement but an improvement none the less.\n\nhttps://indico.cern.ch/event/370494/contribution/3\nhttps://indico.cern.ch/event/305124/contribution/4\nhttps://sharper.web.cern.ch/sharper/cms/talks/debugingEGIsoMap_160215_update.pdf\n\nCheers,\nSam\n", "branch": "CMSSW_7_4_X", "changed_files": 7, "closed_at": "1425113250", "comments": 12, "commits": 3, "created_at": "1424779379", "deletions": 112, "labels": ["comparison-pending", "fully-signed", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "9d58e0007576f4550c52ee42211f1f3da6fdfd8a", "merged_at": "1425113250", "merged_by": "cmsbuild", "milestone": "Next CMSSW_7_4_X", "number": 7922, "release-notes": [], "review_comments": 1, "state": "closed", "title": "bug fix to EG PF isolation map", "updated_at": "1425113250", "user": "Sam-Harper"}