{"additions": 122, "auther_ref": "BPixCablingMapAndGeometryFix_9_2_X_May9", "auther_sha": "391d7ae10104f6376adec87bbc36cedc6db87606", "author": "veszpv", "body": "Three bugs found with BPix reconstruction of CRUZET is treated here:\r\n1) the local frame conversion assumed an incorrect orientation for Layer 1 modules on the -Z half of the ladders \r\n2) a small mistake in the cabling map related to the ROC grouping in Layer 1 modules. \r\n3) an inverted pattern of flipped and non-flipped ladders were implemented in the BPix geometry for all layers\r\n\r\nThe PR corrects all bugs from first principle. The fix is mandatory for data-reconstruction, and recommended for future MC production (when data-MC comparison becomes important.)\r\n\r\nA new cabling map in Prep called 'SiPixelFedCablingMap_phase1_v7_May2' corrects for 2). The use of this new object and the fix for 1) will invalidate MC generated in earlier CMSSW versions and saved in RAW format. This PR introduces a mechanism which turns on the use of the old local frame conversion if the string \"CMSSW_9_0_X\" is found in the version name of the cabling map. A new object in Prep called 'SiPixelFedCablingMap_phase1_v6.3_May2' contains this string and the old mapping. Using it will assure backward compatibility.\r\nThe fix of 3) will invalidate all earlier MC in GEN-SIM if propagated to the DB.\r\n\r\nThe following GT-s should be created after merging this PR\r\n- old ideal geometry + cabling v6.3 + old (mis)alignment scenario for compatibility with old MC\r\n- new ideal geometry from xml + cabling v7 + new alignment for collision data reconstruction (and cosmics rereco)\r\n- new ideal geometry from xml + cabling v7 + new misalignment scenario for new MC\r\n\r\nNote: the fix in 3) rotated all ladders around by Pi about the direction of global Z, therefore the support structure, the cables, and the cooling tubes moved from one side of the modules to the other for all modules  concerning their arrangement along the global radial direction. The total amount of material budget did not change. Tracking POG was notified that tracking reco material might need to be cross-checked.", "branch": "master", "changed_files": 11, "closed_at": "1494914028", "comments": 48, "commits": 4, "created_at": "1494363956", "deletions": 1, "labels": ["alca-approved", "comparison-available", "db-pending", "geometry-approved", "orp-pending", "pending-signatures", "tests-approved"], "merge_commit_sha": "f7b29835c316bff6799022efd0e415177406b900", "merged_at": "1494914028", "merged_by": "davidlange6", "milestone": "CMSSW_9_2_X", "number": 18651, "release-notes": [], "review_comments": 2, "state": "closed", "title": "BPix cabling map and geometry fix", "updated_at": "1495613658", "user": "veszpv"}