{"additions": 3444, "auther_ref": "CMSSW_11_0_X_tau-pog_restructureTauDiscriminators", "auther_sha": "e3ee2f54d22194b79a0f8ad58d32cfb1b8b946e2", "author": "cms-tau-pog", "body": "#### PR description:\r\n\r\nFeatures of this PR:\r\n- new data format for tau discriminators introduced (details see below). Changes AOD format. miniAOD and nanoAOD format remain unchanged, only changes in the processing at this level.\r\n- removes deprecated cut based IDs\r\n- negligible changes in output of combinedIsolationDeltaBetaCorr3Hits with dR=0.5 due to different input setting blessed by Tau Conveners.\r\n\r\nNew data format\r\n- defines struct of std::vector<float> and std::vector<bool> to store multiple raw values and WP flags per tau, called SingleTauDiscriminatorContainer. Actual AOD data format TauDiscriminatorContainer (to replace PFTauDiscriminator in many places) defined as ValueMap of SingleTauDiscriminatorContainer. (PFTauDiscriminator is association vector of floats). This format is also used at PAT level to replace PATTauDiscriminator.\r\nsee DataFormats/TauReco\r\nclass definitions are updated\r\n\r\n- New instances of the TauIDProducerBase template compatible with the new data format are created\r\n\r\n- RECO producers for MVAID, cut based IDs, antiElectron/Muon ID, CutMultiplexer produce new data format and only run once for all WPs. In case of MVA IDs, the raw producer stages out raw value (and category value if applicable) in one object read by the cut multiplexer but not stored in AOD since Cut Multiplexer puts these values together with WP flags into a new instance of TauDiscriminatorContainer which is the stored in MiniAOD.\r\nLists of objects to keep in AOD are updated and reduces drastically.\r\n\r\n- PATTauProducer is changed so that it can read both new and old data format, creating PATTaus in the same format as before. During initialization IDs are sorted so that IDs from one container will be read together.\r\n\r\n- ID producers running on MiniAOD create new data format for PAT Taus which is only transient but used to avoid unnecessary repetitive calls of the producers. CutMultiplexer is merged with its version for PFTaus into a templated version because of parallel structure and to apply major changes due to the new data format only once. PATTauIDEmbedder is adapted in a similar way as the PATTauProducer to read the new data format as well.\r\n\r\n- Deep Tau ID producer is changed such that it produces one instance of the new data format per e,mu,jet branch instead of many product instances. This required to change the internal dictionary structure for the working points by a vector structure in order keep the order of working points inserted into the new format safe.\r\n\r\n- Configurations of PATTauProducer and PATTauIDEmbedder uses helper functions defined in the respective python configurations in order to get the right indexes from the configuration of the input module. PATTauProducer in contrast is finding the right indexes via provenance which is a little more overhead but needed as this producer is also used to read stored data from disk (which can be produced with different configuration) while PATTauIDEmbedder only takes input that is created within the same workflow.\r\n\r\n- Configurations at NanoAOD level for IDs run on MiniAOD are updated\r\n\r\n- Kept producers with format where needed for HLT. HLT so far unchanged, apart from a minor formal config update that does not cause pyhsical changes. New data format could be introduced to HLT sequences in a separate step.\r\n\r\n#### PR validation:\r\npassed code checks\r\npassed unit tests apart from some failing file accesses\r\npassed matrix tests\r\ncentral tau production lines run before/after and comparing resulting ID quantities:\r\nreco + pat step run on a test AOD sample: comparison plots in `/afs/cern.ch/user/s/swozniew/public/TauPOG/Dataformat/recoAndPATstep`\r\nnanoAOD step run on a test miniAOD sample: comparison plots in `/afs/cern.ch/user/s/swozniew/public/TauPOG/Dataformat/nanoAOD`\r\nno differences in both cases apart from the small known difference mentioned above in the overview\r\n\r\n\r\nno backport intended", "branch": "master", "changed_files": 65, "closed_at": "1586412291", "comments": 140, "commits": 18, "created_at": "1574090386", "deletions": 2939, "labels": ["analysis-approved", "code-checks-approved", "comparison-available", "dqm-approved", "fully-signed", "l1-approved", "orp-approved", "pdmv-approved", "reconstruction-approved", "tests-approved", "xpog-approved"], "merge_commit_sha": "49acac1cee9f9d86c4f7223614d21b547127cd38", "merged_at": "1586412291", "merged_by": "cmsbuild", "milestone": "CMSSW_11_1_X", "number": 28417, "release-notes": [], "review_comments": 149, "state": "closed", "title": "New Tau ID data format", "updated_at": "1586412291", "user": "swozniewski"}