{"additions": 5387, "auther_ref": "pixfwd-merge-for-pre12", "auther_sha": "b1d52b710ce10a1e7080529945273e21c331ac0d", "author": "schneiml", "body": "This pull request has all the changes regarding Phase1 FPIX geometry.\n- It adds a completly new geometry description that aims to describe the actual FPIX detector. The current 2017 geometry is based on the TDR and incrorrect in many ways. Sensor positions should be correct (according to the CAD files) to a few microns. (Thanks @veszpv )\n- The material budget is most likely not correct, but at least most relavant volumes should be there. (See Issues, thanks @veszpv). The support rings approximate the actual shape better. (My work)\n- It adds new workflows to use the new geometry.  (Thanks @boudoul )\n- This means that the old TDR geometry should remain untouched, which is not fully true, see below.\n\nIssues:\n- **UPDATE: fixed already** but we should be aware that TDR breakage might be hidden by using the DB geometry. Some C++ code changes do affect the old (TDR/2017) geometry. This should not cause immediate problems, since the old geometry is usually fetched from database where it reains unchanged.\n- Some changes affect DetId assignment/Tracker numbering. This will immediatly affect code using the old geometry, but it should not break too many things. We are looking into fixing this by detecting the geometry and changing behaviour. In the long term, this is not needed since only the new geometry should be used. (@venturia) **Update:** Phase2 fixed by  d427f4d, everything else is fine at least according to the automatic tests.\n- The support ring description uses the new CutTubs solid which causes problems in Geant.  (Thanks @civanch for providing a workaround for the first issue, more might appear) (Without the workaround, the new workflows _will_ crash in GEN-SIM.)\n- The new volumes in the modules cause a lot of new overlaps (but they are not _involved_ in them; they just cause envelopes to grow): All overlaps are air envelope volumes overlapping other things, often also air envelopes; we are looking for a solution by making the blade envelope more precise using unions. This could cause a lot of work, we hope to get a solution tody. (also @ianna)\n\nWe would like to get this version tested to know about potential further issues. The final PR will likely have a few more changes to fix some of the issues.\n", "branch": "CMSSW_8_1_X", "changed_files": 43, "closed_at": "1473455049", "comments": 49, "commits": 29, "created_at": "1473404638", "deletions": 15, "labels": ["comparison-available", "geometry-pending", "operations-pending", "orp-pending", "pdmv-pending", "pending-signatures", "reconstruction-pending", "tests-approved"], "milestone": "Next CMSSW_8_1_X", "number": 15795, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Phase1 Pixel Forward Changes for pre12  (RFC)", "updated_at": "1473455049", "user": "schneiml"}