{"additions": 219, "auther_ref": "approxClustersRelValv0", "auther_sha": "a432845d9fd7666817a0bc7612352698bd93897a", "author": "mandrenguyen", "body": "#### PR description:\r\n\r\nThis PR contains the code needed to run a full reconstruction workflow using a modified data format which explicitly stores an approximated version of siStripClusters rather than full strip tracker RAW information.  The motivation for this is to reduce the size of the RAW data format to more efficiently utilize HLT bandwidth during Run 3 (see slides 1-6 here) [1].  The approximated siStripClusters assume a rectangular cluster shape rather than storing a detailed list of ADC counts for each cluster.  Note that the RAW data size is not actually reduced in this PR, this will come in second PR.\r\n\r\nThese approximated clusters are interfaced with the rest of the tracking sequence by converting them back into a collection of SiStripCluster objects at the beginning of the local reco sequence (instead if generating the clusters from RAW data).  We have found that the changes to the cluster shape cause small differences in the tracking, on the order of 1% or less in MB heavy ion data, with the new procedure having slightly less tracks.  A summary of the tracking performance using the performance of the 2018 reconstruction as a baseline can be found at [2].  This has been shown multiple times in HI PAG meetings.\r\n\r\nIt should be noted that we also turn off the cluster subshape filter in the pixelless and tob/tec tracking iterations. These were found to have a large sensitivity to the approximated cluster procedure, but were not found to strongly affect the tracking output when using regular clusters.  Thus, we believe it is better to just remove this from the sequence.\r\n\r\nBased on small tests with MB events, we expect a modest (~10-20%) increase in the timing of the reconstruction with this change, due to the removal of cluster shape filters, and no significant effect on memory usage.\r\n\r\n[1] https://indico.cern.ch/event/1028779/contributions/4319687/attachments/2227865/3774300/RAW_DataFormat_Run3_Baty.pdf\r\n[2] https://indico.cern.ch/event/1170543/contributions/4916527/attachments/2460140/4217789/ApproximateClustersHI_June10.pdf\r\n\r\n\r\n#### PR validation:\r\n\r\nThis PR may be tested by the new relval worflows 161 (MC) and 140.58 (Run 2 data), which add a \"RawPrime\" step.  Note that in Run 3 the functionality will be implemented instead in the HLT menu, such that it will already be applied in the input RAW data. \r\n\r\n@abaty @icali \r\n\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\n<!-- Please replace this text with any link to  -->\r\n\r\nBefore submitting your pull requests, make sure you followed this checklist:\r\n- verify that the PR is really intended for the chosen branch\r\n- verify that changes follow [CMS Naming, Coding, And Style Rules](http://cms-sw.github.io/cms_coding_rules.html)\r\n- verify that the PR passes the basic test procedure suggested in the [CMSSW PR instructions](https://cms-sw.github.io/PRWorkflow.html)\r\n", "branch": "master", "changed_files": 18, "comments": 44, "commits": 2, "created_at": "1655695040", "deletions": 16, "labels": ["reconstruction-pending", "alca-pending", "operations-pending", "pending-signatures", "orp-pending", "pdmv-pending", "tests-started", "upgrade-pending", "code-checks-pending", "trk-dpg-pending"], "milestone": "CMSSW_12_5_X", "number": 38423, "release-notes": [], "review_comments": 28, "state": "open", "title": "Rawprime workflow with approximated siStrip clusters for heavy ions", "updated_at": "1656174682", "user": "mandrenguyen"}