{"additions": 3, "auther_ref": "killModules_in_DataMixer", "auther_sha": "cec8d84c1b0dea7c7a509dfe71e0660ae2481809", "author": "CMSTrackerDPG", "body": "#### PR description:\r\n\r\nUp to now permanently bad components were killed prior to the DataMixer and separately for signal and pileup. For pileup this was happening in the MixingModule in stage 1 premixing and for signal in the MixingModule in stage 2 premixing. Instead, killing of transiently bad components was deferred to the last step in the DataMixer where signal and pileup digis are mixed. With this commit both permanently and transiently bad pixel components are killed in one place, in the DataMixer. This way premixed pileup library can be produced even before the list of bad components has been finalized and can later be reused (within the same production campaign) even with different bad component scenarios. The proposed change was presented in the Pixel Offline Meeting on Mar. 5, 2024 and the presentation can be found [here](https://indico.cern.ch/event/1383674/#32-possible-changes-in-simulat).\r\n\r\n#### PR validation:\r\n\r\nTested before and after the change using wf 250202.181 to confirm that permanently dead components are killed in both cases.\r\n\r\n#### If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nBackport to CMSSW_14_0_X is foreseen. Since this PR had a merge conflict with https://github.com/cms-sw/cmssw/pull/44276, which had been resolved in the meantime, it might be best to backport both PRs together since they are somewhat related anyways.\r\n\r\n@sroychow \r\n", "branch": "master", "changed_files": 3, "closed_at": "1710250541", "comments": 15, "commits": 1, "created_at": "1709653932", "deletions": 2, "labels": ["simulation-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "07cf22fe9ac21074c48fb9de06316afe20297789", "merged_at": "1710250541", "merged_by": "cmsbuild", "milestone": "CMSSW_14_1_X", "number": 44320, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Kill both permanently and transiently bad pixel components in DataMixer", "updated_at": "1710250542", "user": "ferencek"}