{"additions": 78, "auther_ref": "miniAOD_VtxRecovery", "auther_sha": "7d0d84c06a65dd12b808cd4bc740cc01d9aabfa5", "author": "abaty", "body": "#### PR description:\r\n\r\nThis PR adds an additional (non-default) functionality to the primary vertex producer which allows it to search an existing vertex collection, and re-run the vertexing algorithms if an event does not contain a previously found PV.  If a vertex has been previously found, the first vertex is copied into the new collection.\r\n\r\nThis is of relevance in 2018 HI collisions, where some track selections had to be applied to the tracks input into the PV step for timing purposes.  This caused some events with a few low-pt tracks (which failed cuts) to not have a PV found.  These vertices can be recovered by re-running the vertexing with looser cuts, but we cannot afford to run the vertexing with loose cuts on every event because the timing in central events.\r\n\r\nIn the 2018 miniAOD workflow, we create and run this 'recovery' module and store it as a new slimmed vertex collection for future use in the event selection of HI events.   The new collection's size is about a 0.1% increase in the total file size, and the timing impact is negligible, as only ~5% of events have a recoverable vertex that has not already been found.\r\n\r\nSome info can be found on slides 6 and 7 of this presentation in the HI PAG meeting: [slides](https://indico.cern.ch/event/961836/contributions/4046332/attachments/2114750/3557872/PAGUpdate_TrkMiniPOG_Oct2.pdf)\r\n\r\n#### PR validation:\r\n\r\nThe PR was tested using the configuration file at /afs/cern.ch/user/a/abaty/work/public/forPeople/forChi2PR \r\nAn example of the Z distribution of vertices recovered can be found on the previously mentioned slides, which around 5% additional vertices found in the recovery collection.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nBefore submitting your pull requests, make sure you followed this checklist:\r\n- verify that the PR is really intended for the chosen branch\r\n- verify that changes follow [CMS Naming, Coding, And Style Rules](http://cms-sw.github.io/cms_coding_rules.html)\r\n- verify that the PR passes the basic test procedure suggested in the [CMSSW PR instructions](https://cms-sw.github.io/PRWorkflow.html)\r\n\r\n@mandrenguyen ", "branch": "master", "changed_files": 6, "closed_at": "1603927387", "comments": 55, "commits": 10, "created_at": "1601944153", "deletions": 2, "labels": ["analysis-approved", "code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "9f65642946710c667f1012448ae471c455baa5ce", "merged_at": "1603927387", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 31676, "release-notes": [], "review_comments": 14, "state": "closed", "title": "Adding vertex recovery step for 2018 heavy ion miniAOD production.", "updated_at": "1603927387", "user": "abaty"}