{"additions": 498, "auther_ref": "bin-lookup-JetCorrectorParameters", "auther_sha": "2fa7b086b585a5739fe661fcfe5daa57ee1a36ad", "author": "aperloff", "body": "Summary:\r\n - An update to the the JetCorrectorParameters software in order to speed it up.\r\n - Involves a new class (JetCorrectorParametersHelper) and some minor changes to the existing code\r\n - All changes to the JetCorrectorParameters class are transient\r\n - Changes are backwards compatible\r\n\r\nProblem:\r\nThe more binned parameters you add to the condition, the slower the correction lookup is. As a concrete example, when you go from being binned in (eta) to being binned in (eta,pt) the condition goes from from 82 records in the lookup to almost 3000 records. If moving from being binned in (eta) to being binned in (eta,rho,pt), you now have 64000 records. Before the fix this slowed down the lookup table substantially.\r\n\r\nSolution/Benchmarking:\r\nWith the changes there is a speedup for every jet correction lookup, even with one dimension of binning. For 1D corrections (L2L3Residual like) we see a speedup of ~2.3x (assuming binned with 82 eta bins), for 2D (L2L3 MC truth like) we see ~96.6x, and for 3D we see a speedup of ~12000x . All of these were measured using igprof. Also beneficial is the fact that there should be no noticeable change in behavior for the users or to any existing code. Everything is backwards compatible and requires no change to the database (i.e. all of the new code was made transient).\r\n\r\nDocumentation:\r\nAll of this work is documented in a report I gave to the JERC group (https://indico.cern.ch/event/617090/contributions/2490770/attachments/1420000/2175622/2017_02_23-Alexx-JetCorrectorParameters.pdf).\r\n\r\n@kpedro88 @schoef ", "branch": "master", "changed_files": 9, "closed_at": "1490162380", "comments": 34, "commits": 15, "created_at": "1488916620", "deletions": 25, "labels": ["analysis-approved", "comparison-available", "db-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "8138984a66feaae97de43314a14f6fcad6dfb9fa", "merged_at": "1490162380", "merged_by": "cmsbuild", "milestone": "CMSSW_9_1_X", "number": 17812, "release-notes": [], "review_comments": 7, "state": "closed", "title": "Bin lookup in the JetCorrectorParameters class", "updated_at": "1490262698", "user": "aperloff"}