{"additions": 878, "auther_ref": "matOrderingFix", "auther_sha": "370f7fcc9a59eb7466ad5535ae4d9a347e150b26", "author": "cvuosalo", "body": "The order of materials in the DD4hep XML files ensures that each material does not reference other materials before they are defined, except in a few cases. DDCMS code does handle the delayed resolution of such references, but there are issues with the implementation. Since there are only a handful of materials that are in the wrong order, the easiest approach is to simply revise the order of these few materials so that they no longer are referenced before they are defined.\r\n\r\nThe DD4hep extended geometry description in the DB had the materials in an unspecified order (they were read from an `std::unordered_map`). This PR makes the simple code revision to put the materials in the same order as they are in the XML files. In this way, if the materials in the XML files are in the correct order, the materials list in the DB will have the same order. With the materials in the correct order, DD4hep with geometry from XML and DD4hep with geometry from the DB will have the exact same material budget and should show the same Tracker efficiencies. This change should eliminate the small discrepancies in Tracker efficiencies between DD4hep XML and DD4hep DB as seen in the DD4hep pre4 validation.\r\n\r\nThis PR goes along with PR #34927. After both PRs are merged, the 2021 geometry configuration files will need to be re-generated in a simple PR. After that, a new extended geometry description using all these changes will need to be created, uploaded to the DB, and added to a new Global Tag.\r\n\r\nThere will be two more follow-up PRs. Once the new DD4hep GT is created and the previous DD4hep GT is removed from use, then a PR that requires DD4hep materials to be in the proper order will be submitted. In this PR, an exception will be generated if any material is referenced before it is defined. This PR will ensure going forward that no future PR that puts materials in the wrong order can be merged. We can't submit this planned PR right now because it would break workflow 11634.912.\r\n\r\nThe second follow-up PR is for reduced material scenarios. The following files will need their material order revised just as was done in `Geometry/TrackerCommonData/data/PhaseI/v3/pixbarmaterial.xml`:\r\n```\r\nGeometry/TrackerCommonData/data/zeroMaterial/2021/v1/pixbarmaterial.xml\r\nGeometry/TrackerCommonData/data/FlatMinus05Percent/2021/pixbarmaterial.xml\r\nGeometry/TrackerCommonData/data/FlatMinus10Percent/2021/pixbarmaterial.xml\r\nGeometry/TrackerCommonData/data/FlatPlus05Percent/2021/pixbarmaterial.xml\r\nGeometry/TrackerCommonData/data/FlatPlus10Percent/2021/pixbarmaterial.xml\r\n```\r\nA reduced material PR with these changes, along with creation and uploading of DD4hep reduced material scenarios to the DB, is planned.\r\n\r\n#### PR validation:\r\n\r\nA test DDCMS parser that would reject undefined materials  was used to check that this PR puts the materials lists for both XML and the extended geometry description intended for the DB in the correct order.\r\n\r\n#### Backport\r\nThe code changes in this PR will be submitted as a 12_0 backport. The XML changes are not necessary because the PPS XML materials file in this PR is not even used in 12_0, and as for the `pixbarmaterial.xml` file, the single material that is in the wrong order is never actually used in a volume.", "branch": "master", "changed_files": 7, "closed_at": "1629787387", "comments": 18, "commits": 5, "created_at": "1629681112", "deletions": 47, "labels": ["geometry-approved", "fully-signed", "tests-approved", "orp-approved", "urgent", "code-checks-approved"], "merge_commit_sha": "5431961d2855b6da5e8c4fefc5a104f0b53982da", "merged_at": "1629787386", "merged_by": "cmsbuild", "milestone": "CMSSW_12_1_X", "number": 34974, "release-notes": [], "review_comments": 2, "state": "closed", "title": "[DD4hep] Revise order of materials to prevent delayed resolution of references", "updated_at": "1629787387", "user": "cvuosalo"}