{"additions": 35, "auther_ref": "CMSSW_9_4_X_tau-pog_photonPt", "auther_sha": "dfa978793dce9a9987d99f0f3d66c93245278970", "author": "cms-tau-pog", "body": "Hi Slava, Andrea, \r\n\r\nthis is a PR to mitigate discrepancies in the MC description of PF photons used for tau reconstruction and ID. To mitigate this issue the pT for PF photons to be considered for tau reconstruction and ID is raised from 0.5 to 1 GeV. The implementation and validation has been provided by @mbluj. I post his initial PR description below (*). These are pure changes on configuration level. We do expect changed in the validation plots (see below). Usual unit tests perform fine. We would like to have this still being part of the upcoming 94X production release! \r\n\r\nThanx a lot!\r\n\r\nCheers,\r\nRoger \r\n\r\n(*)\r\nAs title of the PR says, this is a set of modification of python cfi/cff files to increase Et threshold of PF-photons used in tau reconstruction and identification from 0.5 to 1GeV. The modification is expected to have the following effects:\r\n   * momentum (and thus Pt) of reconstructed taus will be slightly smaller,\r\n   * some, but rather small, migration from decay modes with pi0's to decay modes without pi0's (1p+pi0->1p and 3p+pi0->3p)\r\n   * smaller values of photon related isolation sums, etc.\r\n\r\nExpected changes are summarized in slides which can be found here: \r\n   * https://indico.cern.ch/event/671551/#8-performance-of-tau-recoid-wi\r\n   * https://indico.cern.ch/event/671551/contributions/2752656/attachments/1538977/2412783/mbluj_TauId_GammaPtGt1GeV_11Oct2017.pdf", "branch": "master", "changed_files": 6, "closed_at": "1508216836", "comments": 22, "commits": 2, "created_at": "1507743835", "deletions": 35, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "1598183b5f64839c83c5465b14391a6105d4e79b", "merged_at": "1508216836", "merged_by": "cmsbuild", "milestone": "CMSSW_9_4_X", "number": 20900, "release-notes": [], "review_comments": 2, "state": "closed", "title": "increase of pT threshold for photons to be considered for tau reconstruction and ID", "updated_at": "1510914167", "user": "roger-wolf"}