{"additions": 155, "auther_ref": "validateGsfElectron_before_MVA", "auther_sha": "9778d640f34b7f3a6af4ac5e72884460cb4b4185", "author": "guitargeek", "body": "#### PR description:\r\n\r\nYou might remember that the GsfElectron DataFormat was changed in the beginning of last year: https://github.com/cms-sw/cmssw/pull/26485. One good thing about the new format was that all ID variables are stored in it and the MVA producer got adapted accordingly.\r\n\r\nThis broke the possibility to run the MVA ID directly on the old format with the new CMSSW code. One variable (conversion rejection probability) will just assume a default value, and the MVA gets wrong input variables but will not complain. It is something that I noticed back then but didn't say anything, because EGM PostRecoTools convert the old format into the new one if you follow the instructions from the EGM Twiki. \r\n\r\nHowever, not all production workflows convert the GsffElectron format where needed. Workflows that produce miniAOD from pre-106X AOD get it wrong. Two of these workflows are also in the bot-tests: `136.8311` and `136.7611` (see first tests below). There is also some pedagogic EGammma code like my [ElectronMVATutorial](https://github.com/guitargeek/ElectronMVATutorial) (presented on the last Physics Object School and still getting many views and clones) which doesn't do any DataFormat conversion. Maybe there is also other code floating around that doesn't do it. After all, samples in the old DataFormat are still recommended for analysis until the ultra-legacy samples are out, If I get that correctly.\r\n\r\nI suggest to add a simple check which makes sure that the affected variables in the GsfElectron are not their default  value, so it's sure that they are filled and we are dealing with the new format. If this not the case, an error will be thrown with a reference to NanoAOD as an example where the conversion is implemented correctly.\r\n\r\nThe workflows that don't do the data format updating before computing the MVA on the electrons from older AOD files are also fixed.\r\n\r\n[1] https://github.com/cms-sw/cmssw/pull/26485/files#diff-857e86e09a96cefe6edac6eb206e1d22R611\r\n\r\n#### PR validation:\r\n\r\nCMSSW compiles, matrix tests pass.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nNo backport intended (so far).\r\n", "branch": "master", "changed_files": 6, "closed_at": "1592807597", "comments": 45, "commits": 5, "created_at": "1590782516", "deletions": 20, "labels": ["analysis-approved", "code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "f4f5dd7d9714d2343d35ed8398a2fb89e509aa52", "merged_at": "1592807597", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 30052, "release-notes": [], "review_comments": 6, "state": "closed", "title": "Validate GsfElectron before running MVA to avoid reading wrong DataFormat", "updated_at": "1592807598", "user": "guitargeek"}