{"additions": 5466, "auther_ref": "pixfwd-merge-for-pre12-final", "auther_sha": "ff171dba9a64d9fb523fe6a504bedf33de19729e", "author": "schneiml", "body": "This is an updated version of #15795 . All concrete issues are fixed.\n\nThis pull request has all the changes regarding Phase1 FPIX geometry.\n- It adds a completly new geometry description that aims to describe the actual FPIX detector. The current 2017 geometry is based on the TDR and incrorrect in many ways. Sensor positions should be correct (according to the CAD files) to a few microns. (Thanks @veszpv )\n- The material budget is most likely not correct, but at least most relavant volumes should be there. (See Issues, thanks @veszpv). The support rings approximate the actual shape better. (My work)\n- It adds new workflows to use the new geometry (now numbers 104xx).  (Thanks @boudoul )\n- Changes to tracking to handle the new mirror symmetry, affecting cluster shapes (thanks @rovere , @makortel )\n\nThis PR needs a patch to Geant (thanks @civanch ) for the new geometry to work. Without that, workflow 11624 is expected to fail.\n\nFor further discussion, see #15795. The main update here are the new union envelope volumes for modules and blades, which remove _all_ overlaps. An isse regarding inside-out remians, I need more information there (@ianna).\n#15613 has a conflicting change regarding WF numbers, maybe we have to coordinate there (also @boudoul). Update: conflicts resolved multiple times, code was updated.\n", "branch": "CMSSW_8_1_X", "changed_files": 40, "closed_at": "1474390153", "comments": 90, "commits": 30, "created_at": "1473454837", "deletions": 12, "labels": ["comparison-available", "geometry-approved", "operations-pending", "orp-pending", "pdmv-pending", "pending-signatures", "reconstruction-approved", "tests-approved", "urgent"], "merge_commit_sha": "9c48678f4dd94590919a7696f527cd29ecc4dc9e", "merged_at": "1474390153", "merged_by": "davidlange6", "milestone": "Next CMSSW_8_1_X", "number": 15805, "release-notes": [], "review_comments": 9, "state": "closed", "title": "Phase1 Pixel Forward Changes for pre12 (final)", "updated_at": "1474439963", "user": "schneiml"}