{"additions": 504, "auther_ref": "master", "auther_sha": "f06a12114d98c5889369840d540b5e3b4c2397b8", "author": "missirol", "body": "This PR is an attempt to include automatic comparisons for the `edm::TriggerResults` collections in the outputs produced during PR tests in [cms-sw/cmssw](https://github.com/cms-sw/cmssw).\r\n\r\nIt was recently mentioned by TSG experts that such additional checks could be useful to validate the HLT results in PR reviews.\r\n\r\nEven though the original use case is related to the HLT outputs, the implementation is fairly generic, in that it checks all the `edm::TriggerResults` collections in a given workflow (without choices tailored towards HLT).\r\n\r\nThe PR adds a python executable, `compareTriggerResults`, which is basically a wrapper calling the CMSSW executable `hltDiff` on the relevant inputs, and producing an output directory with the relevant results. The output directory includes a file with a summary of the comparisons' results, in `html` or text format.\r\n\r\nThe PR also includes an update of `run-pr-comparisons`, in order to run these additional comparisons. The outputs of these new checks are saved in a subfolder named `triggerResults/`, created in the same directory as (for example) the subfolder `validateJR/`. A 1-line summary of these TriggerResults comparisons is also added to the file `qaResultsSummary.log`, which (afaiu) is what provides the summary message of automatic tests in [cms-sw/cmssw](https://github.com/cms-sw/cmssw) PR reviews.\r\n\r\nLocal tests suggest that the new comparisons take roughly 1min per workflow. If this is too long, maybe these checks could be made optional. This would require feedback from experts (for the moment, I left a placeholder flag for this [here](https://github.com/cms-sw/cms-bot/compare/master...missirol:master#diff-7f111d1913bc7caf04aaa0bff3ba37def0e16e8efa3aebe20d449602c54e524aR328)).\r\n\r\nAttn: @fwyzard @Martin-Grunewald @Sam-Harper\r\n\r\n--------\r\n\r\n**PR Validation:**\r\n\r\nTested `compareTriggerResults` locally with copies of EDM outputs of 2 workflows, from recent CMSSW PRs (could not test locally the updates to run-pr-comparisons).", "branch": "master", "changed_files": 3, "closed_at": "1615879280", "comments": 22, "commits": 11, "created_at": "1615721719", "deletions": 2, "labels": ["externals-pending", "orp-pending", "pending-signatures", "tests-approved"], "merge_commit_sha": "20f9a5757066fae75412a82833ba06c97dffb092", "merged_at": "1615879280", "merged_by": "smuzaffar", "number": 1505, "release-notes": [], "review_comments": 0, "state": "closed", "title": "adding PR checks on edm::TriggerResults", "updated_at": "1615879280", "user": "missirol"}