{"additions": 203, "auther_ref": "mm_dev_improve_DetectorStateFilter_14_0_X", "auther_sha": "772ffbe2089d931056a3dbb5b19a25886466a72a", "author": "mmusich", "body": "backport of https://github.com/cms-sw/cmssw/pull/45275\r\n\r\n#### PR description:\r\n\r\nThis PR concerns an issue regarding the Tracker DCS bits, and the cases in Run 3 where one of these bits went to \"False\" during data-taking, but Tracker certified the data as good (which led to overriding the content of the DCS-only json) [^1]. The most recent case of this was [run-380032](https://cmsoms.cern.ch/cms/runs/lumisection?cms_run=380032) (which Tracker marked good, and HLT later marked bad) [^2].\r\n\r\nThis concerns HLT because of (at least) two reasons.\r\n\r\n  - (A) These Tracker-HV DCS bits are used in the online-dqm clients which measure the HLT beamspot: if at least one of the bits is \"False\", the determination of the online beamspot (which is critical in the HLT reconstruction) may not be updated, so it may be compromised.\r\n\r\n  - (B) There is a significant number of triggers (~70 triggers, roughly 10% of the physics triggers in the menu) using the tracker-HV DCS bits in the online trigger decision. These are typically triggers for displaced objects whose rates become too large if the pixel or tracker are really \"off\", so they use the DCS bits as protection. This means that, when one of these bits are \"False\", these triggers collect no data. If LSs where the tracker-HV DCS bits were \"False\" are allowed to enter \"golden\" jsons (which is currently the case), the analyses using these triggers should in principle use a dedicated json to determine the luminosity recorded by these triggers (in this dedicated json, the LSs with TrackerHV=False would be excluded).\r\n\r\nA proposed solution to this issue, since as far as I understand the problem is that usually only *one* DCS partition of the Strip detector (i.e. either one of `TIBTID`, `TOB`, `TECp`, `TECm`) turns to \"DCS = false\" despite delivering good data, but the filter we're using both for the HLT beamspot and the HLT paths (`DetectorStateFilter` ) \r\n\r\n\r\n```python\r\nprocess.hltStripTrackerHVOn = cms.EDFilter( \"DetectorStateFilter\",\r\n    DebugOn = cms.untracked.bool( False ),\r\n    DetectorType = cms.untracked.string( \"sistrip\" ),\r\n    DcsStatusLabel = cms.untracked.InputTag( \"\" ),\r\n    DCSRecordLabel = cms.untracked.InputTag( \"hltOnlineMetaDataDigis\" )\r\n)\r\n```\r\n\r\nrequires all of partitions to be ON (cf [^3] ).\r\nTo avoid that situation, one could conceive to change the logic of the filter to require a looser combination (e.g. at least one partition ON, or at least two, or whatever is deemed safer to avoid exploding in rate).\r\nThis PR equips `DetectorStateFilter` to check the DCS state of selected combinations of Tracker partitions in order to leverage this idea. The default behaviour of the filter is NOT changed in this PR. Changing the content of the HLT menu will need to be followed up in a dedicated CMSHLT JIRA ticket, while the changing of the online beamspot clients is in the hands of the BeamSpot team.\r\n\r\n#### PR validation:\r\n\r\nRelies on the augmented unit test `scram b runtests_test_DetectorStateFilter` in which the functionality is tested. \r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nVerbatim backport of https://github.com/cms-sw/cmssw/pull/45275 for 2024 data-taking purposes.\r\n \r\n[^1]:  https://indico.cern.ch/event/1271493/contributions/5539298/attachments/2698908/4684210/TrkDPGRun368343.pdf\r\n[^2]: https://indico.cern.ch/event/1396796/contributions/5960214/attachments/2858301/5002113/TkDQM_Expert_Tutorial_May24.pdf#page=38\r\n[^3]: https://github.com/cms-sw/cmssw/blob/9030bf6e5bc33e617ca03ac40e8586ea8b86abc2/DQM/TrackerCommon/plugins/DetectorStateFilter.cc#L117-L118", "branch": "CMSSW_14_0_X", "changed_files": 3, "comments": 3, "commits": 2, "created_at": "1719466286", "deletions": 4, "labels": ["dqm-pending", "pending-signatures", "orp-pending", "tests-started", "backport", "trk"], "milestone": "CMSSW_14_0_X", "number": 45322, "release-notes": [], "review_comments": 0, "state": "open", "title": "[14.0.X] Improve `DetectorStateFilter` to check DCS state of selected combinations of Tracker partitions", "updated_at": "1719475476", "user": "mmusich"}