{"additions": 63, "auther_ref": "consumesHiGenCommon81X", "auther_sha": "247a1f438a99dd66abdaf12ecd584bf5136a376f", "author": "mandrenguyen", "body": "This package seems to have escaped consumes migration, presumably as these filters weren't being used. \nTwo of these filters are now needed again:\nBetaBoostEvtVtxGenerator \nMixBoostEvtVtxGenerator \nwhich are used to apply a boost to HepMCProducts for generators that are not configured to produce asymmetric collisions, as is needed for proton-lead.  \nThey correspond to standard and embedded workflows, respectively.  \nThese are currently run in the relval matrix, so I modified wf's 280 and 301 as follows to test them:\n\ncmsDriver.py AMPT_PPb_5020GeV_MinimumBias_cfi  --conditions auto:run2_mc  --eventcontent RAWSIM -s GEN,SIM --datatier GEN-SIM --beamspot Realistic5TeVPPbBoost\n\ncmsDriver.py Pyquen_DiJet_pt80to120_2760GeV_cfi  --conditions auto:run2_mc_hi -s GEN,SIM --pileup_input das:/RelValHydjetQ_MinBias_5020GeV/CMSSW_7_6_0_pre6-76X_mcRun2_HeavyIon_v4-v1/GEN-SIM --era Run2_2016,Run2_HI --eventcontent FEVTDEBUG --scenario HeavyIons --pileup HiMixGEN --datatier GEN-SIM --beamspot Match5TeVPPbBoost\n\nNote that for that for these wf's the vertex smearing parameters get loaded in this package instead of IOMC.EventVertexGenerators which is not so nice.  These parameters still correspond to 2013 pPb collisions, but I propose to clean this up in a different PR, once we have a guess for the 2016 pPb beam parameters.  \n\nWhile I was touching this package I also forward ported GenHIEventProducer, which was patched into 75X but never made it into CMSSW8.  This will eventually need to be (re)added to heavy ion workflows (as was done in 75X), which will require updating the configBuilder, but I again propose to leave this as separate PR. \n\nI will also make this PR in 80X, as it's not yet clear which release we'll use for pPb GEN-SIM. \n", "branch": "CMSSW_8_1_X", "changed_files": 8, "closed_at": "1466774290", "comments": 2, "commits": 2, "created_at": "1464761624", "deletions": 35, "labels": ["comparison-pending", "generators-pending", "orp-pending", "pending-signatures", "tests-pending"], "merge_commit_sha": "dba7074b469f894dd7752ff5525bd20fca2de9e1", "merged_at": "1466774290", "merged_by": "davidlange6", "milestone": "Next CMSSW_8_1_X", "number": 14719, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Consumes migration and GenHIEventProducer forward port from 75X", "updated_at": "1466774290", "user": "mandrenguyen"}