{"additions": 528, "auther_ref": "ecal-pfsr-90X", "auther_sha": "4caab06b874334063db710af3a4394696b575149", "author": "emanueledimarco", "body": "This change is to implement a match of the online selective readout algorithm, basically:\r\n\r\n- when the hit belongs to a region which the trigger flagged as \"high-interest\"(\"medium interest\"), read in full-readout a set of (one) readout units\r\n- when the hit belongs to a \"low-interest region\", apply the zero-suppression\r\n\r\nRight now the offline ZS was done in two places:\r\n\r\n1. ECAL -> PF rechit translation (including offline zero-suppression)\r\n2. gathering threholds of hits in a PFCluster\r\n\r\nin 2016 thresholds in 1. and 2. coincided and were lower than online zero-suppression. Since online ZS is on uncalibrated amplitude, this possibly produced time- and eta-dependent effects (radiation / transparency loss). In 2017 the online ZS will be much harder, so worsening these effects. \r\n\r\nThis allows to decouple what happens in a high-interest region (online = full-readout ; offline = stay with low cluster gathering thresholds) to what happens in low-interest region (online = zs ; offline = raise the ZS in PFRecHit QTest to a value higher than online, but done on calibrated energy).\r\n\r\nFew details more in this [presentation at the ECAL DPG](https://indico.cern.ch/event/600314/contributions/2423735/).\r\n\r\nWith this PR, which puts in the algorithm of the match of online-offline decisions, but NOT changes thresholds neither in 1. nor in 2., should just abuse of the technical checks of the release integration, and should not introduce changes. Also something to check is the increase in the memory of the job at the beginning of the job, since it creates the mapping between crystals and trigger towers.\r\n\r\nThe second change will be just a change in the thresholds in 2., matching the ones decided for the online running in 2017.\r\n\r\n@bendavid @amassiro @shervin86 @argiro @crovelli please also follow this\r\n", "branch": "CMSSW_9_0_X", "changed_files": 12, "closed_at": "1488806611", "comments": 4, "commits": 2, "created_at": "1488644537", "deletions": 17, "labels": ["comparison-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-pending"], "milestone": "CMSSW_9_0_X", "number": 17776, "release-notes": [], "review_comments": 8, "state": "closed", "title": "ECAL offline selective readout", "updated_at": "1488806611", "user": "emanueledimarco"}