{"additions": 132, "auther_ref": "MM-miniAODFix74X", "auther_sha": "5d4033ab7d729de1014de6d0be6009fcd6f0af55", "author": "cms-met", "body": "This PR fixes the most important bugs observed in miniAODs during the Phys14 exercise.\n(NB. the full fix is only complete with #8027 integrated)\n\nFollowing changes are implemented :\n- pat::MET cor and uncorrected functions are deprecated and now retrieve -1, shift function have to be used instead\n- MET smearing is disabled per default from the miniAOD production config file.\n- protections in the PATMETSlimmer producer have been added to not crash if jet resolution uncertainties are missing (because they are computed and are relevant only when smearing is applied in the current implementation)\n- fix of the jet energy scale uncertainty Up/Down variations which were identical\n- fix of the unclustered energy scale variation not properly computed due to skimmed jet collection used to compute the type1 and 2 MET correction (unclustered energy scale variation is linked to the type2 MET correction)\n- fix a bug during the type1 computation in PAT, due to muon cleaning not properly taken into account\n- add basic caloMET information int he slimmedMET class, can be then accessible in one round for experts who wants to have a look at the caloMET\n\nChanges expected during the validation : \n- smearing has been removed from the MET, MET pt resolution will improve compared to the old code implementation\n- fix of the muon cleaning for the type1 MET brings back a perfect agreement between the RECO and PAT level. small variations expected in events containing muons. \n", "branch": "CMSSW_7_4_X", "changed_files": 9, "closed_at": "1426529325", "comments": 24, "commits": 5, "created_at": "1425913244", "deletions": 182, "labels": ["analysis-approved", "comparison-available", "fully-signed", "tests-approved"], "merge_commit_sha": "6395e41ad966f47a87fe849e27c9734097a594b8", "merged_at": "1426529325", "merged_by": "cmsbuild", "milestone": "Next CMSSW_7_4_X", "number": 8159, "release-notes": [], "review_comments": 0, "state": "closed", "title": "MET bugfix for miniAOD + addition of caloMET in slimmedMET", "updated_at": "1479107055", "user": "mmarionncern"}