{"additions": 17, "auther_ref": "matbudget-fix-ca-pre3", "auther_sha": "06b6b61c5fa6a046f9638f8305848555aa9b019e", "author": "schneiml", "body": "This is a set of patches for the material budget tools that I made some time ago for the large FPIX material budget correction project. It is not supposed to be merged right now.\r\n\r\nApart from some convenience changes, it fixes the issue that the Material Budget Validation tools don't work correctly in some IBs and some releases. This issue is caused by code interacting with Geant that depends on initialisation order (actually, it seems to me that what this code does is safe; but in practice, it does not work), related to retrieving a list of materials.\r\n\r\nMy fix is based on the observation that for the usual use case (described here: https://twiki.cern.ch/twiki/bin/viewauth/CMS/TrackerMaterialBudgetValidation ) this is not needed. \r\n\r\nIf we want to go down this route, all the non-functional and superfluous code could and should be removed from the Tools, but I don't really have time to do it now. Also, this means removing a lot of features from the Tool. I have no idea what these are supposed to do and who uses or used them.\r\n\r\n(On a side note: all (or at least some of) the `runP_` things except for `runP_Tracker` seem to be broken and are superseded by `runP_Tracker`. They should probably be deleted.)\r\n\r\nFor everybody who wants to use the Tool for the normal Validation plots, I can only recommend to apply this patch. For CMSSW in general, we have to decide whether the Tool should be fixed properly, or stripped down to the parts that work.\r\n\r\n@veszpv @ianna @civanch @zucchett @rovere ", "branch": "CMSSW_9_0_X", "changed_files": 4, "closed_at": "1485360196", "comments": 14, "commits": 6, "created_at": "1484831587", "deletions": 12, "labels": ["comparison-available", "dqm-approved", "fully-signed", "geometry-approved", "orp-approved", "tests-approved"], "merge_commit_sha": "fcc1ddb38317336e23bcf9c6c642b699fa65bb23", "merged_at": "1485360196", "merged_by": "cmsbuild", "milestone": "CMSSW_9_0_X", "number": 17210, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Material Budget Tool Fixes", "updated_at": "1485360196", "user": "schneiml"}