{"additions": 49, "auther_ref": "CMSSW_10_6_X_PackedCandidateMoreCaloFractions", "auther_sha": "ebfef1baef943eeda036c6cfe3b1a9af14ab60e0", "author": "steggema", "body": "#### PR description:\r\n\r\nThis PR adds two new data members to PackedCandidates to be able to save two calorimeter energy fractions (one related to ECAL over HCAL energy, the other the ratio of calorimetric energy to overall candidate energy so that absolute HCAL energy fractions as well as track-ECAL energy ratios can be calculated) to charged PF candidates in MiniAOD. The additional information is the main missing information to be able to run algorithms to reject electrons and/or muons misreconstructed as taus on taus reconstructed from MiniAOD information only (see #22594).\r\n\r\nThe PR is expected to increase the size of the MiniAOD output by 1.1%, as measured on a 10000-event TTW file from the Autumn 18 production. The size of the pat::PackedCandidates branch is expected to increase from\r\n\r\nBranch Name | Average Uncompressed Size (Bytes/Event) | Average Compressed Size (Bytes/Event) \r\npatPackedCandidates_packedPFCandidates__PAT. 141015 20723.3\r\n\r\nto\r\n\r\npatPackedCandidates_packedPFCandidates__PAT. 145227 21500.8\r\n\r\nThe proposed implementation adds two new data members so that we end up with two data members that hold \"raw\" information and two that hold regular calibrated information. The reason is that JetMET currently also uses the regular energy fraction data member to save raw energy fractions for isolated charged hadrons so that they can run the charged hadron calibration on MiniAOD events. I found no traces of usage in CMSSW (except for b-tagging, who use the energy fractions saved for neutrals as was the original purpose of these members) and hence propose to move the JetMET content to the raw data mebers so we can save the new information in a logically consistent way in the existing data members (@ahinzmann @zdemirag this may affect you).\r\n\r\n@mverzett @kskovpen As far as I understand the BTV code, the DNN-based b-taggers (who seem to be the only customers in CMSSW) only use the information saved for neutrals, which are unchanged.\r\n\r\nThis is to address #26406 (see also the discussion therein). @peruzzim @rmanzoni @mbluj @slava77 @fgolf @swozniewski \r\n\r\n#### PR validation:\r\n\r\nBasic PR tests have been performed.\r\n\r\n#### if this PR is a backport please specify the original PR:\r\n\r\nN/A\r\n", "branch": "master", "changed_files": 4, "comments": 13, "commits": 2, "created_at": "1556013037", "deletions": 10, "labels": ["analysis-pending", "code-checks-approved", "comparison-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-pending", "xpog-pending"], "milestone": "CMSSW_10_6_X", "number": 26506, "release-notes": [], "review_comments": 0, "state": "open", "title": "Add more calorimeter energy fractions to PackedCandidates", "updated_at": "1556031738", "user": "steggema"}