{"additions": 2447, "auther_ref": "CSC_Run3_Unpacking_CMSSW_12_1_X", "auther_sha": "e18d85b95d4ff2fe0f86327c9cf8c084649557ac", "author": "barvic", "body": "#### PR description:\r\nInitial release of the CSC Run3 data unpacker updates for EventFilter/CSCRawToDigi CMSSW_12_1_X\r\n\r\nScope:\r\nHandles DAQ data format changes for CSC (O)TMB (optical) trigger mother boards readout firmware for Run3.\r\n\r\nFirmware major features:\r\n- Comparator code lookup table (CCLUT) algorithm to enhance the CLCT position resolution (by a factor 2-4) and the bending resolution by factor 3.\r\n- Added GEM GE1/1 readout support for CSC ME1/1 chambers for integrated GEM-CSC local trigger\r\n- Introduces options for high-multiplicity triggering (HMT) on exotic signatures\r\n\r\nCorresponding project task force twiki page and related notes\r\nTwiki: https://twiki.cern.ch/twiki/bin/viewauth/CMS/GEMCSCTriggerTaskForceRun3\r\nhttps://gitlab.cern.ch/tdr/notes/DN-20-016/blob/master/temp/DN-20-016_temp.pdf\r\n\r\nThe CSC unpacker changes are expected to be transparent for Run2-related workflows and backward-compatible with Run2 data.\r\nThe Run3 data format is automatically recognized from the data, based on OTMB firmware revision code.\r\nAdditional configurable options for putting into output stream unpacked GEM GEMPadDigiCluster and HMT Shower CSCShowerDigi new digis collections\r\nCurrently supports Run3 format changes for MEx/1 OTMB, ME1/1 OTMB chambers, based on most recent revision of OTMB2020 Run3 data format specification (from September, 23 2021). \r\nAdditional support for older copper TMB type of boards would be added after initial availability of updated TMB firmware and the validation with real data from test setups and tests at P5.\r\n\r\nSeparate CMSSW_12_0_X backport PR request would be submitted\r\n\r\n#### PR validation:\r\nInitial standard tests\r\nscram b runtests - passed \r\nrunTheMatrix.py -l limited -i all --ibeos - passed\r\n\r\nAdditional validation checks with CSC data from test setups using DQM tools (CMSSW, local standalone)\r\n- legacy Run2 data format backward-compatible\r\n- Run3 MEx1 OTMB (CCLUT+HMT) data is unpacked (single chamber at b904 test setup)\r\n- Run3 ME11 OTMB (CCLUT+HMT) + GEM  data is recognized and unpacked without format errors (single ME11 chamber + 1 layer GEM chamber at b904 setup) \r\nUpdates are partially validated, based on currently available real data samples from b904 tests setups.\r\nFurther final validation would depend on ongoing progress with (O)TMB firmware development and tests at b904 and at P5.\r\n\r\n", "branch": "master", "changed_files": 27, "closed_at": "1636640847", "comments": 64, "commits": 11, "created_at": "1632858501", "deletions": 91, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "0a3ed996f65b69ab97c1e0cd3552a5e849897cc8", "merged_at": "1636640847", "merged_by": "cmsbuild", "milestone": "CMSSW_12_2_X", "number": 35461, "release-notes": [], "review_comments": 58, "state": "closed", "title": "Initial release of CSC Run3 unpacking updates for CMSSW_12_1_X", "updated_at": "1636640847", "user": "barvic"}