{"additions": 923, "auther_ref": "ecalComponentMethod", "auther_sha": "a28729eb716988c7a40453be6368d11725569272", "author": "jhakala", "body": "#### PR description:\r\n\r\nThis PR implements a new method for simulating EB digis which should be more accurate and thus will improve the quality of the MC for timing studies. The method is based on simulating the response of the APD+readout electronics in a way that takes into account the depth of PCaloHit energy deposits, so pulse shape fluctuations (sometimes referred to as the \"Landau term\") are modeled. In addition to improving the EB digis, a new collection is added in the EcalTimeDigis which stores a finely-sampled analog waveform, meant to emulate the output of the preamplifier prior to its sampling by the ADC.\r\n\r\nIn addition to implementing the method, I added a new CondFormat object, such that the \"component shapes\" used in the method can be accessed via the EventSetup from the CondDB.\r\n\r\nThe output will change in the following ways:\r\n- depending on a cfg parameter, a new EBUnsuppressedDigi collection will be added in the DIGI step. (default is that it is omitted.)\r\n- depending on a cfg parameter, a new array is added to the EcalTimeDigis which has the finely-sampled simulated waveform (it has 10 BX with 25 double values per BX [1 ns sampling] for each EB crystal.) (default is that this is omitted too)\r\n\r\nThis doesn't depend on any other PRs or externals. Here are some slides on the method: https://indico.cern.ch/event/1187720/#5-status-of-simulation-of-timi\r\nThose slides are slightly out of date but I can provide more documentation if desired.\r\n\r\n\r\n#### PR validation:\r\n\r\nI've tested this with my own configuration files based on the ecal_devel workflows, in particular runTheMatrix workflow 24234.61, but with customizations added to enable the new functionality. I've looked at the new digis and waveforms from the method and they look as expected (slightly sharper waveforms with more pronounced fluctuations in pulse shapes.) I ran some of the recommended `scram b runtests` but it looked like they were failing due to unrelated reasons.\r\n\r\n", "branch": "master", "changed_files": 51, "closed_at": "1680332430", "comments": 92, "commits": 3, "created_at": "1677109250", "deletions": 56, "labels": ["simulation-pending", "alca-approved", "operations-approved", "pending-signatures", "tests-approved", "pdmv-pending", "db-approved", "orp-approved", "upgrade-approved", "requires-external", "code-checks-approved", "ecal"], "merge_commit_sha": "dd08066da27df93b599deb82d96ecfb1d58d711f", "merged_at": "1680332430", "merged_by": "cmsbuild", "milestone": "CMSSW_13_1_X", "number": 40855, "release-notes": [], "review_comments": 31, "state": "closed", "title": "Improved method for EB digi simulation", "updated_at": "1686040236", "user": "jhakala"}