{"additions": 203, "auther_ref": "improve-clustering-speed", "auther_sha": "883cad19293e2b7b4ea67d4a5aa4669c80c14866", "author": "werdmann", "body": "Last year the execution time of  DAClusterizerInZ_vect and DAClusterizerInZT_vect  was improved significantly by reducing the list of clusters considered for a triack to within 4 sigma in the update() cycles.  Similar arithmetic is used in the purge() method and the final track assignment at the end of vertices().  This code is executed much less frequently than update but there is still some time to gain because they are executed at low Temperature when the cluster lists are long. \r\nIn addition the code was streamlined to avoid repeating some computations. Only changes that are not expected to change the result have been implemented. The cluster list restriction represents an approximation (cutting off a gaussinan at 4 sigma) that can lead to very small changes.\r\n This PR reduces the clustering time by about 30 % with negligible changes of the results.\r\n\r\nSmall additional changes that don't change the behaviour are packaged with this PR\r\n*  new configurable parameter (uniqutrkminp) was introduced for future use. When set to 0 (=current default) it restores the original behaviour\r\n* the 4d vertices until now have no track weights. These are now copied from the 3d fit after the 4d clustering (in plugin/PrimaryVertexProducer.cc)\r\n\r\n![clustering-time-offlinePrimaryVertices](https://user-images.githubusercontent.com/4669785/109121892-23fbfe80-7748-11eb-84e6-618e92574544.png)\r\n\r\n\r\n\r\n\r\n#### PR validation:\r\nthe PR was tested with several RelVal samples from Run 3 and Phase2. Almost no differences in the results have been found.\r\nrunthematrix reports 37 36 35 26 17 4 1 1 1 tests passed, 0 0 0 0 0 0 0 0 0 failed\r\n\r\n", "branch": "master", "changed_files": 7, "closed_at": "1615027270", "comments": 38, "commits": 9, "created_at": "1614236880", "deletions": 173, "labels": ["alca-approved", "code-checks-approved", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "33735d5b0dc99731cfe882f9cee2d689eb5fad5e", "merged_at": "1615027270", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 32994, "release-notes": [], "review_comments": 4, "state": "closed", "title": "Improve the execution speed of the DA clusterizers for primary vertex finding", "updated_at": "1615027270", "user": "werdmann"}