{"additions": 1225, "auther_ref": "exceptionBehaviorBeginEndRun", "auther_sha": "44b20e068f0b3d7534ebce0dd8a7602d43e53f06", "author": "wddgit", "body": "#### PR description:\r\n\r\nImprove the behavior of the Framework after exceptions in Run begin/end stream/global transitions. This is the third in a series of PRs where we plan to make the behavior after exceptions more consistent in all the begin/end transitions. The first PR handled stream begin/end lumi exceptions (PR #44624). The second PR handled global begin/end lumi exceptions (PR #44840). The comments at the head of the first PR state the design for this behavior we are implementing.\r\n\r\nThe intent is that nothing in the output will change if there are not any exceptions. The order of modules in begin/end stream transitions may change, although in existing releases these functions are run asynchronously and the order can vary if an identical configuration is repeated in multi-threaded jobs. It is a problem already if something depends on that order.\r\n\r\nAnother minor change in behavior is that signals pre/post for beginStream and endStream will no longer be issued for trigger results inserter, path status inserters, and end path status inserters. These modules don't do anything in those transitions. I examined the services watching those signals and cannot see any reason for those signals to be emitted.\r\n\r\nThis work was motivated by discussions related to Issues #43831 and #42501.\r\n\r\nThe most complicated detail in this PR is that instead of each StreamSchedule having one WorkerManager, each StreamSchedule will have 3, one for lumis/events, one for runs, and one for beginStream/endStream. Although I intend\r\nto address the beginStream/endStream transitions in the next PR, I went ahead and converted them to use a different WorkerManager because I didn't want to have to modify that complex part of the code twice.\r\n\r\n#### PR validation:\r\n\r\nAn existing unit test covering exceptions in different transitions is extended to cover the most salient cases. Additional manual testing of many various cases was also done. Existing unit tests pass.\r\n", "branch": "master", "changed_files": 32, "comments": 4, "commits": 1, "created_at": "1716392861", "deletions": 554, "labels": ["core-pending", "pending-signatures", "tests-rejected", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_14_1_X", "number": 45017, "release-notes": [], "review_comments": 2, "state": "open", "title": "Improve behavior after exception in begin/end run transitions", "updated_at": "1716405873", "user": "wddgit"}