{"additions": 210, "auther_ref": "hcal-generate-he-fg-lut-new-algo-versions", "auther_sha": "6bb71223f53c5f4b9ea4b6b953245bce62b9a159", "author": "christopheralanwest", "body": "This PR implements code changes needed to implement depth feature bits [1] into HE trigger primitives. The changes are as follows:\r\n\r\n- Generation of HE depth feature bit LUTs for use online (5a23ad7842470b9edf20e3081115d448824d7b25, 5a9be22164f0a1f457aa18b1c60811c539cd739c, c42032b8e661afa41279a1d7b31666c1aae29d5d)\r\n- Do not apply peak finding to feature bits, to match the firmware behavior (as a primary use of the depth feature bit algorithm is MIP detection, peak detection would be very noisy); Fix of indexing issues to reflect that depth indexing starts at 1, not 0 (8ff026a6f96a570a7079d198b5e00e4de5730f0e)\r\n- Addition of new algorithms used for technical tests of the generation of the feature bits (9d50b6d7d19acd67600e62643766a5a4fe7383ee)\r\n- Update to LUT generation configuration and a technical change to the formatting of some of the XML tags in the LUTs (68f7bcc5b86a986b05a32b6b70f7492c34a91191, 8b13429049e2b144883ea96e941c78bc3ca68651) to reflect what is currently in use. This is not logically directly related to other commits but is needed more generally for LUT generation. These changes are already in use.\r\n\r\nThe feature bit code has been tested at 904 using uHTRs that read out only HE [2] and gives perfect agreement between data and emulation. As mentioned at [2], the online software does not yet support the loading of HE feature bit LUTs in uHTRs that read out both HB and HE and so data/emulation comparisons have not been performed for the highest and lowest ieta ranges of HE. I have verified that the LUTs are nevertheless generated for these towers, even though they are not currently used. Since all towers in HE have identical LUTs, no further changes will be needed for the mixed HB/HE readout.\r\n\r\nThe only changes in PR comparison tests will appear in the feature bits of the HE trigger primitives, in samples that contain an upgraded HE. As these feature bits are not yet used by any downstream quantity, no physical quantity will change.\r\n\r\n[1] for details, see pages 23-25 of https://cms-docdb.cern.ch/cgi-bin/DocDB/ShowDocument?docid=12306\r\n[2] http://cmsonline.cern.ch/cms-elog/1063064", "branch": "master", "changed_files": 8, "closed_at": "1540361656", "comments": 51, "commits": 11, "created_at": "1537102932", "deletions": 100, "labels": ["alca-pending", "code-checks-approved", "comparison-available", "db-approved", "l1-approved", "orp-approved", "pending-signatures", "tests-approved"], "merge_commit_sha": "74a76f144c1924c8d5f67d65e98d655ca7449b71", "merged_at": "1540361656", "merged_by": "cmsbuild", "milestone": "CMSSW_10_4_X", "number": 24556, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Complete HE depth feature bit implementation", "updated_at": "1540361656", "user": "christopheralanwest"}