{"additions": 320, "auther_ref": "fc-fixvalid", "auther_sha": "284e33e7b47016e97a316aaed2503794b5a8afed", "author": "fabiocos", "body": "#### PR description:\r\n\r\nThis PR proposes several updates to the MTD validation and reconstruction code, in view of a detailed study of the MTD clustering:\r\n\r\n- the ```MtdTracksValidation``` class is updated by adding histograms to monitor track - ```TrackingParticle``` matching, also including TP with a ```SimTrack``` linked to MTD hits, to better disentangle acceptance effects from other inefficiency sources. This monitoring is now running also in case of fake primary vertex, allowing the code to run also on particle guns output, where the usual vertex selection fails;\r\n- the local reconstruction monitoring is optimised by adding a ```break``` statement in the loop to match simulated and reconstructed hits inside a cluster. The time taken should be significantly cut, especially on events with PU;\r\n- several debugging printout is added or polished, also in cluster reconstruction classes.\r\n\r\nThe memory addition to histogram output has been measured to be about 6 KiB.\r\n\r\n#### PR validation:\r\n\r\nTest MTD validation configuration runs smoothly and provide the desired histograms. As a side note ```SimTrack``` producing hits in ETL are not saved, as outside the tracker volume. This issue should be addressed in a separate development.", "branch": "master", "changed_files": 9, "closed_at": "1653561373", "comments": 15, "commits": 9, "created_at": "1653401714", "deletions": 59, "labels": ["dqm-approved", "reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "upgrade-approved", "code-checks-approved", "mtd"], "merge_commit_sha": "39dd06155ff2eeadb2adad790dd76e8324ca8cdf", "merged_at": "1653561373", "merged_by": "cmsbuild", "milestone": "CMSSW_12_5_X", "number": 38064, "release-notes": [], "review_comments": 0, "state": "closed", "title": "MTD validation: update track-MTD matching efficiency monitoring", "updated_at": "1653561374", "user": "fabiocos"}