{"additions": 6478, "auther_ref": "fc-mtdbarphi", "auther_sha": "780be3d5e7688177a38575ca438a3cbc84061a48", "author": "fabiocos", "body": "The final choice for the MTD geometry in view of TDR is a flat bars layout with the long side along phi: [https://indico.cern.ch/event/777879/contributions/3237688/attachments/1771743/2879703/MTD_ASIC_PRR_20181214.pdf](url) . This PR provides an implementation of this setup as upgrade scenario D38. The module layout is shown in the picture:\r\n\r\n![crystalbarphiflat_1](https://user-images.githubusercontent.com/4058194/50551664-cd3c2c80-0c84-11e9-80cc-0a7537179d28.jpg)\r\n\r\nThis scenario is based on 48 modules (3 groups of 16 with changing thickness).\r\n\r\nIn this PR there is also a fix for the ieta navigation method in BTLDetId, not used so far in digitization and reconstruction but only for analysis. The behaviour was correct for the positive side, but for the negative side it inverted the ordering wrt the intended one, i.e. (... -8 -1 -2 -3 -4 1 2 3 ..) in the transition between negative and positive modules instead of (... -5 -4 -3 -2 -1 1 2 3). The problem is related to the fact that the crystal number 1 for negative side modules is the farthest and not the closest one to the MTD midwall. The fix is extended to the hashedIndex (not used for the time being). \r\n\r\nTest workflows are provided, and the digitization is updated to account for the new scenario.\r\n\r\n", "branch": "master", "changed_files": 20, "comments": 1, "commits": 2, "created_at": "1546203262", "deletions": 958, "labels": ["code-checks-pending", "comparison-pending", "geometry-pending", "operations-pending", "orp-pending", "pdmv-pending", "pending-signatures", "simulation-pending", "tests-pending", "upgrade-pending"], "milestone": "CMSSW_10_5_X", "number": 25572, "release-notes": [], "review_comments": 0, "state": "open", "title": "MTD geometry: add final proposed scenario (flat bars along phi) D38, fix the BTLDetId ieta navigation method", "updated_at": "1546203327", "user": "fabiocos"}