{"additions": 2, "auther_ref": "CMSSW_12_1_0_pre5_HiTracking_Run3_trackingNoLoopers", "auther_sha": "3421ced826db65fd94c1cec9751f2f4c23f10f38", "author": "sayanchatterjee38", "body": "#### PR description:\r\n\r\nTitle: Disabled looper reconstruction in HI Era for Run 3\r\n\r\nDescription: This PR has disabled looper reconstruction from HI Era after checking timing and CPU usage, tracking efficiency, fake, multiple, non-primary reconstructions fractions for peripheral and central events. Also, the same checks were performed in the MinimumBias dataset produced for 1000 events. Please, see slides 1-9 from here [1].\r\n\r\nNo significant changes were observed in event and track variables while removing the No-Looper condition except the Hit count distribution. \r\n\r\nAn issue had been raised already regarding disabling looper reconstruction for HeavyIons. Please look here [2] for detail. \r\n\r\n \r\nLink for the HI Trackin POG: \r\n[1] https://indico.cern.ch/event/1153062/contributions/4841907/attachments/2429416/4159748/NoLooper_HITracking.pdf \r\n\r\nLink for the issue:\r\n[2] https://github.com/cms-sw/cmssw/issues/35758\r\n\r\n\r\n#### PR validation:\r\n\r\nRun time observations and a detailed study of each track variable have been performed with enabling and disabling trackingNoLoopers. We have also performed a detailed comparison of tracking efficiency, fake, multiple, and nonprimary reconstruction fractions for central, peripheral, and minimum bias events with enabling and disabling trackingNoLoopers.\r\n\r\n\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nN/A\r\n\r\n\r\ncc: @mandrenguyen, @abaty, @CesarBernardes", "branch": "master", "changed_files": 2, "closed_at": "1654685770", "comments": 27, "commits": 2, "created_at": "1651807418", "deletions": 4, "labels": ["reconstruction-pending", "operations-pending", "pending-signatures", "tests-rejected", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_12_5_X", "number": 37833, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Disabled looper reconstruction in HI Era for Run 3", "updated_at": "1654685770", "user": "sayanchatterjee38"}