{"additions": 641, "auther_ref": "addLegacyWarning", "auther_sha": "b848186f3402a75c80a7d41c5cfd67626627cabe", "author": "wddgit", "body": "#### PR description:\r\n\r\nThis PR adds a warning that lists legacy modules that are configured in the current job. They print through the MessageLogger at the LogSystem level. Nothing prints if there are none. It looks like this:\r\n\r\n```\r\n%MSG-s LegacyModules:  AfterModConstruction 21-Jul-2021 20:10:16 CEST pre-events\r\nThe following legacy modules are configured. Support for legacy modules\r\nis going to end soon. These modules need to be converted to have type\r\nedm::global, edm::stream, edm::one, or in rare cases edm::limited.\r\n  SecondaryProducer Thing\r\n  EventContentAnalyzer Analysis\r\n%MSG\r\n```\r\nThis PR is split into 3 commits (at least when initially submitted). The 3rd commit actually adds the new warning message. The first two commits deal with unit test failures that are a consequence of this addition to the log file output. Some tests compare log file output to a reference file and fail when they are different. These need to be fixed if they contain legacy types modules.\r\n\r\nIn the first, many modules in FWCore/MessageService are migrated from legacy type to global or one type. The behavior of the modules is not changed. There is a significant amount of cleanup mixed in here. None of this should change the behavior or output of any of the test modules.\r\n\r\nThere are 3 unit tests in FWCore/Integration that start to fail. The second commit fixes these, mostly by updating the reference files.\r\n\r\nI did not do a survey to find all legacy modules in the Framework. I only looked at ones where the unit tests started to fail. Also note that we are intentionally leaving some legacy modules in the Framework to ensure legacy modules continue to work until the point in time where support for legacy modules is completely dropped. We want them to continue to function properly in the temporary period while we migrate away from them. I don't know how many legacy modules remain in the Framework and whether all of them are needed for this purpose.\r\n\r\n#### PR validation:\r\n\r\nMostly relies on existing unit tests. Some of these were updated to keep them working. Three test were modified to check the output of this new warning by comparing a log file with a reference file containing the warning.\r\n", "branch": "master", "changed_files": 68, "closed_at": "1627363544", "comments": 22, "commits": 4, "created_at": "1626884902", "deletions": 1155, "labels": ["code-checks-approved", "core-approved", "fully-signed", "orp-approved", "reconstruction-approved", "tests-rejected", "upgrade-approved"], "merge_commit_sha": "e207da6659fe980049e20372fa9c8577e19d410f", "merged_at": "1627363544", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 34577, "release-notes": [], "review_comments": 4, "state": "closed", "title": "Add warning that lists legacy modules if any are configured.", "updated_at": "1627363544", "user": "wddgit"}