{"additions": 303, "auther_ref": "deprecateConvertToUnscheduled", "auther_sha": "29b399ee3d24af1ba0c36cb8b2e354e07b88f91c", "author": "makortel", "body": "#### PR description:\r\n\r\nThis PR proposes to deprecate the `convertToUnscheduled()` and `cleanUnscheduled()` customize functions that were first introduced in 2012 as a \"temporary aid\" to help in moving to \"unscheduled execution\", and the `--runUnscheduled` command line argument to `cmsDriver.py`. In both cases the function/argument are left there, but they only print a deprecation message (to minimize breaking \r\n\r\nThe current behavior is to take all EDProducers and ignored EDFilters in Paths (either directly or via Sequences) and move those modules into Tasks associated to the same Paths. This transformation was useful to expose the module-level intra-event concurrency to the framework in the maximal way.\r\n\r\nSince then, the framework has evolved, and with #29024 all modules (except EDFilters) in Paths are now run concurrently (still according to the filtering logic). Therefore the `convertToUnscheduled()` is no longer strictly needed to maximize the intra-event concurrency between modules. In addition, #29553 makes the distinction between EDProducers in Tasks and in Paths more important:\r\n* currently EDProducers in Tasks whose Event products are not consumed are not run for Events (unless they use `Accumulator` extension), they are, however, run for lumi, run, and job transitions\r\n* with the PR EDProducers in Tasks whose any products are not consumed are deleted before beginJob transition\r\n\r\nTherefore I'm starting to feel uneasy to move EDProducers from Paths to Tasks behind people's back (ok, in principle the use of `convertToUnscheduled()` can be argued to be a \"deliberate choice\"), and am proposing to remove that functionality.\r\n\r\nIt may be that some more modules get run now in the RECO step (e.g. DQM, VALIDATION, ALCA are still mostly using Sequences, whereas e.g. RAW2DIGI and RECO use Tasks).\r\n\r\nMoving producers from Paths/Sequences to Tasks is recommended to be continued (a bit less overhead, and unnecessary producers do not get run).\r\n\r\nI had to modify VALIDATION sequences in two places to avoid circular dependencies (modules in Paths/Sequences still need to be declared in the order of their data dependencies). I decided to just move modules to Tasks to make it explicit that their execution order does not matter. It may be that further testing (e.g. full matrix) reveals more such cases.\r\n\r\nResolves #20363. Resolves #20203. \r\n\r\n#### PR validation:\r\n\r\nLimited matrix and (relevant) unit tests run.", "branch": "master", "changed_files": 48, "closed_at": "1591033554", "comments": 109, "commits": 13, "created_at": "1588607565", "deletions": 448, "labels": ["alca-approved", "analysis-approved", "code-checks-approved", "comparison-available", "core-approved", "dqm-approved", "fastsim-approved", "fully-signed", "geometry-approved", "hlt-approved", "operations-approved", "orp-approved", "pdmv-approved", "reconstruction-approved", "simulation-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "afe34f626e8e6fd78f2eb387bf22a28898a24dc3", "merged_at": "1591033553", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 29630, "release-notes": [], "review_comments": 5, "state": "closed", "title": "Deprecate convertToUnscheduled() customize function and --runUnscheduled argument of cmsDriver", "updated_at": "1591033554", "user": "makortel"}