{"additions": 11, "auther_ref": "fixTempFileDeletion", "auther_sha": "c30c771b771f9cd980139d178306fec39dc7f048", "author": "wddgit", "body": "#### PR description:\r\n\r\nMake WriteBuffer delete all its temp files in /dev/shm.\r\n\r\nEach time the unit tests run the bug fixed here leaves behind 4 files with names similar to the following.\r\n\r\n```\r\n-rw-r--r--. 1 wdd    zh 1842 Jan 31 20:44 testProd23885_2buffer1\r\n-rw-r--r--. 1 wdd    zh 1842 Jan 31 20:44 testProd23885_3buffer1\r\n-rw-r--r--. 1 wdd    zh 1842 Jan 31 20:44 testProd23885_1buffer1\r\n-rw-r--r--. 1 wdd    zh 5842 Jan 31 20:44 testProd23885_0buffer1\r\n```\r\n\r\nThe 5 digit number is the PID. There is a possibility of a name clash if a later unit test both has the same PID AND is run by a different user. I noticed this while testing an unrelated PR and probably unluckily hit such a name clash.\r\n\r\nThis is related to #40484. Note that on cmsdev32 there are a few thousand old files in /dev/shm related to this problem  cluttering up that directory. Some are there from problems fixed in #40484 and some from problems fixed by this PR. There could be some on other machines as well. I'm not sure how the machines are configured, but I would guess these will cleaned up next time each machine is rebooted. Until then, there is a possibility of name clashes in these unit tests (probably rarely). We believe the IBs avoid the problem because the code does try to delete the clashing file if it can. That does not work if a different user owns the file though, so for users running the unit tests outside the IBs there is a potential for problems.\r\n\r\n#### PR validation:\r\n\r\nExisting unit tests pass. I manually ran them and manually examined the contents of /dev/shm and new files are not left there anymore when the unit tests run. They appear to be getting cleaned up when the test ends as intended.\r\n", "branch": "master", "changed_files": 2, "closed_at": "1675259185", "comments": 8, "commits": 1, "created_at": "1675193329", "deletions": 1, "labels": ["core-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "e4e860f782a4d1581b976745e683951214cac80e", "merged_at": "1675259185", "merged_by": "cmsbuild", "milestone": "CMSSW_13_0_X", "number": 40652, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Make WriteBuffer delete all its temp files in /dev/shm", "updated_at": "1675259186", "user": "wddgit"}