{"additions": 2132, "auther_ref": "particlenet_cmssw130", "auther_sha": "55daf9d3783923e4f29ca7b5e56bb9875036a8c7", "author": "scooperstein", "body": "This PR adds a set of ParticleNet-based networks and infers them on the relevant jet collections. These networks are significant extensions of the ParticleNet jet flavor classifiers that have been included in CMSSW so far. The new AK4 network performs simultaneously jet flavor classification, jet pT regression, and hadronic tau ID and reconstruction (charge, DM). The new AK8 network performs jet classification and mass regression simultaneously, while also including resonance decays to merged hadronic taus for the first time.\r\n\r\nThe AK4 networks are split by jet eta (central vs. forward) and by jet source (CHS vs. PUPPI). The CHS training is needed for studies of using ParticleNet for hadronic tau ID and reconstruction (TAU), while the PUPPI training is intended for the jet classification and pT regression (JME, BTV). We intend to unify these tasks to run on only one jet source (PUPPI) in the future, but this solution was agreed upon with the L2 POG conveners in the interim because current PUPPI tunes are inefficient for seeding hadronic taus. The networks are also split by jet eta because the scope of the forward network is highly reduced, allowing for a lighter and faster network architecture for the forward jet inferences. The AK8 network takes PUPPI jets as a source and is only inferred for central AK8 jets.\r\n\r\nNote that the input features for these networks are dependent on miniAOD input collections, therefore they can only be inferred on the miniAOD. \r\n\r\nThis commit is dependent on the model files as committed in this PR: https://github.com/cms-data/RecoBTag-Combined/pull/50. This PR has been tested by running the added tasks on a single tt file and checking the outputs of the network evaluations. \r\n\r\nAdditional information on these networks available in recent presentations:\r\nat JME: https://indico.cern.ch/event/1220368/contributions/5141019/attachments/2548768/4389765/cooperstein_ParticleNet_nov162022.pdf\r\nand at the Tau POG: https://indico.cern.ch/event/1223165/contributions/5158297/attachments/2561047/4414677/cooperstein_ParticleNetPlusTau_dec62022.pdf\r\nIn addition, an analysis note AN-22-094 (http://cms.cern.ch/iCMS/jsp/openfile.jsp?tp=draft&files=AN2022_094_v2.pdf) describes these networks in detail.\r\n\r\n@rgerosa\r\n", "branch": "master", "changed_files": 19, "closed_at": "1680531103", "comments": 111, "commits": 25, "created_at": "1676033813", "deletions": 64, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "requires-external", "code-checks-approved", "xpog-approved", "btv", "tau", "jetmet"], "merge_commit_sha": "6397f33f687c5176577f1b01398350d8b3ea723f", "merged_at": "1680531103", "merged_by": "cmsbuild", "milestone": "CMSSW_13_1_X", "number": 40745, "release-notes": [], "review_comments": 45, "state": "closed", "title": "Integration of extended ParticleNet trainings for simultaneous jet flavor tagging, pT regression, and tau ID + reconstruction", "updated_at": "1680531103", "user": "scooperstein"}