{"additions": 15, "auther_ref": "solids-dimen-precision", "auther_sha": "abd776afcb2c7ee493e82fc1b1e41d94850174e3", "author": "cvuosalo", "body": "Native Geant4 in the Geant4 IB performs strict tests on trapezoid solids, while VecGeom Geant4 used in the master is more lenient. Native Geant4 requires all trapezoid dimensions to be non-zero, and it requires trapezoid faces to be planar down to the nanometer scale.\r\n\r\nThe DD4hep big XML file in the DB uses precision 5 for solids. At this precision, the trapezoids `tidmodule0:TIDModule0StereoKaptonCut` and `tecmodule1s:TECModule1TopFrame2` get zero values for their `bl2` and `tl2` parameters. In fact, these two solids are not true Trapezoids and should probably be defined as Trd1 or something similar, but historically they were defined as Trapezoids with two vanishingly small but non-zero dimensions. In addition, at precision 5, some trapezoid faces show deviation from being planar at the nanometer scale.\r\n\r\nSince the Run 3 geometry has been finalized, this PR attempts to make the smallest revision possible to remove the complaints from Native Geant4. In the revised DD4hep big XML file, the precision of Trapezoids (only) is increased from 5 to 8. In addition, the `bl2` and `tl2` parameters of Trapezoid `tecmodule1s:TECModule1TopFrame2` are increased from 5.e-14 to 5.e-8 millimeters. This new value should still be small enough to have the same effect as the original, but it doesn't require an excessive precision to represent.\r\n\r\nAfter this PR, the revised DD4hep big XML file will be uploaded to the DB, and a PR will be submitted to put this big \r\nXML file into the DD4hep Global Tag. We can consider at that point whether the revised Global Tag will be suitable for 12_1. With the revision, regression will probably not be preserved since numeric values will change, but no significant changes would be expected.\r\n\r\nThis PR resolves issue #35655.\r\n\r\n#### PR validation:\r\n\r\nThe revised big XML file from this PR was compared with the previous one to check that the only change was the addition of three digits to each Trapezoid parameter. Simulation was run with Native Geant4, and no complaints were generated.\r\n\r\n\r\nBackporting to 12_0 is probably not advised at this late stage for 12_0.", "branch": "master", "changed_files": 2, "closed_at": "1634719318", "comments": 13, "commits": 1, "created_at": "1634678866", "deletions": 0, "labels": ["geometry-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "136dbee2a0f812322a74b81957454c06fce25d3e", "merged_at": "1634719318", "merged_by": "cmsbuild", "milestone": "CMSSW_12_1_X", "number": 35737, "release-notes": [], "review_comments": 0, "state": "closed", "title": "[DD4hep] Increase precision of Trapezoid definitions to prevent complaints from Native Geant4 10.7", "updated_at": "1634719319", "user": "cvuosalo"}