{"additions": 4625, "auther_ref": "pull/36163", "auther_sha": "b5d4f10bec39f67f602808147ae2cbcfeac599de", "author": "cvuosalo", "body": "The file `Geometry/VeryForwardData/data/CTPPS_Pixel_2021/Modules/v2/ppstrackerMaterials.xml` contains PPS materials that are not used anywhere, as far as I can tell. Some of the composite materials are defined in the wrong order, which could cause problems in the future. It is planned to require that all components of a composite material be defined before the material itself is defined, but we can't make that change as long as there are existing composite materials defined in the wrong order. The PPS materials in this file are the only materials in the Run 3 geometry that are defined in the wrong order. Since they are not even used, it is fairly simple to just remove them.\r\n\r\nAnother unused material `PPS_Epoxy` is deleted from the `RP_Materials.xml` file in this PR.\r\n\r\nAfter this PR, a new big XML file will be created and uploaded to the DB.\r\n\r\nThis PR is replaces #36163.\r\n\r\nA late addition to this PR is a correction to the ordering of the materials in the `pixbarmaterial.xml` files for the reduced material scenarios. The materials \"Polyurethane\" and \"SupplyTubeEpoxy\" were referenced before being defined. The fix is just to move the definitions prior to the references in the file. This fix was made earlier in the main `pixbarmaterial.xml` file but did not get into the reduced material versions of that file until now.\r\n\r\nPR validation:\r\n\r\nThe DD4hep XML workflow, 11634.911, was run successfully with this PR.\r\n\r\nNo backport is needed.", "branch": "master", "changed_files": 27, "closed_at": "1638375613", "comments": 14, "commits": 5, "created_at": "1638298981", "deletions": 46, "labels": ["geometry-approved", "fully-signed", "tests-approved", "orp-approved", "upgrade-approved", "code-checks-approved"], "merge_commit_sha": "8fa87a9d2b46fb72c05317fc814a4eb04676dfaf", "merged_at": "1638375613", "merged_by": "cmsbuild", "milestone": "CMSSW_12_2_X", "number": 36307, "release-notes": [], "review_comments": 0, "state": "closed", "title": "[DD4hep] Remove unused PPS materials from Run 3 2021 (replaces #36163)", "updated_at": "1638375613", "user": "cvuosalo"}