{"additions": 1, "auther_ref": "prepareForConcurrentRuns", "auther_sha": "9af0340e240b28fc855175e3e51c6986fdc4dbe5", "author": "wddgit", "body": "#### PR description:\r\n\r\nModify DQMStore so that it continues to function when the pull request adding Framework support for concurrent runs is merged. That pull request, #38801, adds additional concurrency that was always planned in the design and documented on the design TWIKI, but in fact was not implemented. After that PR is merged, the streamBeginRun and streamEndRun transitions may run concurrently with some other transitions, including globalBeginLuminosityBlock. The current implementation of DQMStore relies on globalBeginLuminosityBlock occurring before beginStreamRun to call initLumi for Monitor elements with lumi scope. DQMStore will break if beginStreamRun is called after globalBeginLuminosityBlock because new MonitorElements will be booked and then initLumi will never be called.\r\n\r\nThis is a one line fix for this problem.\r\n\r\nNote that this fix is intended to allow DQMStore to function properly in the case where the number of concurrent runs is configured to 1, which will be the default. There might or might not be additional work necessary in DQMStore to support a configuration where the number of concurrent runs is configured to be greater than 1. That case has not been tested. The plan is to get support for concurrent runs implemented in the Framework and later improve modules and services outside the Framework to support that mode of operation as resources are available.\r\n\r\nNote that PR #38801 cannot be merged until after this PR is merged and we would like to merge that one soon.\r\n\r\n@makortel and @Dr15Jones, you might be interested in this also.\r\n\r\n#### PR validation:\r\n\r\nBehavior should remain exactly the same, so this relies on existing tests.\r\n", "branch": "master", "changed_files": 1, "closed_at": "1664248091", "comments": 9, "commits": 1, "created_at": "1663937851", "deletions": 0, "labels": ["dqm-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "00ec2353119ed79e3beba1308271a81cbfe9e1f5", "merged_at": "1664248091", "merged_by": "cmsbuild", "milestone": "CMSSW_12_6_X", "number": 39491, "release-notes": [], "review_comments": 0, "state": "closed", "title": "prepare DQMStore for Framework concurrent run support", "updated_at": "1664248091", "user": "wddgit"}