{"additions": 49, "auther_ref": "removeGetManyByTypeDQM", "auther_sha": "d7d6e5bb4d3edc5d4f34b2a3b22ee3c772d176c2", "author": "wddgit", "body": "#### PR description:\r\n\r\nRemove calls to getManyByType in DQM modules.\r\n\r\nThe primary motivation for this change is to delete uses of getManyByType so that we can delete the function getManyByType from the Framework without breaking compilation.\r\n\r\nThe Framework has been throwing an exception when getManyByType is called without a call to consumesMany since 2015. We've just finished a large migration where all code calling both consumesMany and getManyByType was replaced by GetterOfProducts or was removed in some other way. The function consumesMany has been deleted entirely from the Framework. The only uses of getManyByType that are left are the ones where consumeMany was not called. All these have been broken since 2015. The Framework will throw an exception if these calls to getManyByType are executed. This change either deletes the code entirely or moves the exception throw from the Framework directly to the module at the location of the getManyByType call.\r\n\r\nI deleted EgHLTDebugFuncs.h entirely. There does not appear to be anything of value there.\r\n\r\nFor the others I commented out the call to getManyByType and threw an immediate exception instead.\r\n\r\nThere are two alternatives I can think of:\r\n\r\nThese modules have been broken since 2015. I could delete the modules completely instead. I would be happy to do that. There was enough content there that it was hard for me to make that judgement by myself, although deleting is probably the better choice.\r\n\r\nIf we really need these modules, we could upgrade them to use GetterOfProducts. This seems unlikely, because they have been broken for so many years already (I don't want to create new tests, but if provided an otherwise working test I'll run it after upgrading).\r\n\r\nIf you want me to implement one of the alternatives, ask and I will do that instead.\r\n\r\n#### PR validation:\r\n\r\nNothing uses this code and it is already broken. There is nothing to test.\r\n", "branch": "master", "changed_files": 8, "closed_at": "1689679216", "comments": 11, "commits": 1, "created_at": "1689361098", "deletions": 55, "labels": ["dqm-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "2eec6f0e49692e8df86c0f394a8279d5640a1c0b", "merged_at": "1689679216", "merged_by": "cmsbuild", "milestone": "CMSSW_13_3_X", "number": 42271, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Remove calls to getManyByType in DQM modules", "updated_at": "1689679216", "user": "wddgit"}