{"additions": 1247, "auther_ref": "CMSSW_12_1_X_tau-pog_L2wCNN", "auther_sha": "e73fe94d146f9667d44b0f88fc080bbbc06c1944", "author": "cms-tau-pog", "body": "#### PR description:\r\n\r\nIn this PR the implementation of a machine learning based approach for the L2 taus is introduced. The chosen ML algorithm is a CNN trained with different hadronic taus production mechanisms (and reweighed in order to avoid overtraining for specific production mechanisms) versus fake taus coming from QCD. \r\n\r\nYou can find: \r\n- the L2TauNNTagProducer which produces the CNN outputs for given L1Tau collections (>=1 collection). For each collection a vector of CNN output is created;\r\n- the L2TauNNTagFilter which takes in input a L1 collection (just 1 in this case), the vector of CNN outputs and the CNN threshold. For the threshold, three different Working Points have been defines in order reach three different desired rate values (3kHz, 4kHz and 5kHz) - evaluated on  EphemeralHLTPhysicsX. For more information see the presentation at the TSG meeting [1]\r\n- The L2TauML production file and a custom function (testL2TauTag) that includes the L2TauTagProducer+Filter \r\n- instruction on how to run the test in a README.md file\r\n- A unit test based on the test mentioned above\r\n\r\nThe trained CNN and the normalization file (needed to normalize the matrix which will be given in input to the CNN) is currently in the private fork [2] of the RecoTauTag-TrainingFiles repository as you can see from the instructions in the md file. The training files are planned to be provided via `cms-sw/cms-data`, see [3].\r\n\r\n[1] https://indico.cern.ch/event/1040952/contributions/4401915/attachments/2260841/3837378/L2TauIDCNN.pdf\r\n[2] https://github.com/valeriadamante/RecoTauTag-TrainingFiles/tree/L2Taus\r\n[3] https://github.com/cms-data/RecoTauTag-TrainingFiles/pull/7\r\n\r\n#### PR validation:\r\nThe PR has been validated on top of 12_1_0_pre4. The provided test has been validated and runs smoothly.\r\n\r\nThe following tests were run and passed as expected, since this PR does not include any change to the official workflows:\r\n```\r\nscram b distclean \r\ngit cms-checkdeps -a -A\r\nscram b -j 8\r\nscram b runtests\r\nrunTheMatrix.py -l limited -i all --ibeos\r\n```\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\nThis PR is not a backport.", "branch": "master", "changed_files": 9, "closed_at": "1634826548", "comments": 47, "commits": 14, "created_at": "1634107877", "deletions": 0, "labels": ["hlt-approved", "fully-signed", "tests-approved", "orp-approved", "requires-external", "code-checks-approved"], "merge_commit_sha": "16173a30d3f0c9ecc5419c474bb4d272c58b65c8", "merged_at": "1634826548", "merged_by": "cmsbuild", "milestone": "CMSSW_12_1_X", "number": 35640, "release-notes": [], "review_comments": 78, "state": "closed", "title": "L2 tau identification with a CNN", "updated_at": "1634826549", "user": "azotz"}