{"additions": 61, "auther_ref": "rotReorder", "auther_sha": "2fd71aa5ceda21e9c7acfffd1ebbb0908a18a686", "author": "cvuosalo", "body": "The extended geometry description (also called the big XML file) stored in the DB specifies a rotation for each physical volume and boolean solid, though the rotation can be omitted if it is the identity rotation. There is a long list of rotations, and many rotations are defined multiple times with different names. When the big XML file is generated, particular rotation names have to be chosen. Prior to this PR, matching was done with insufficient precision so that very close but different rotations were confused. In particular, the rotation `eealgo:EECrRoC1R1`, which is a 1e-6 radian rotation, was confused with the identity rotation. This problem was compounded by DD4hep ignoring this tiny rotation during volume placement and treating it as identity. The result was that, with the DD4hep geometry from the DB, some volumes were slightly rotated incorrectly, which caused small overlaps.\r\n\r\nThis PR increases the precision of rotation matching during creation of the big XML file, so different rotations that are very close will not be confused. It needs to go along with a fix in DD4hep that will allow DD4hep to recognize the tiny `eealgo:EECrRoC1R1` rotation.\r\n\r\nAll the rotations in the geometry system were checked, and `eealgo:EECrRoC1R1` was found to be the only one so small that it was close to identity.\r\n\r\nThis PR also implements following the order of rotation definitions in the source XML files, so when the same rotation is defined with different names, the first name is used. This method favors the standard rotation names in `rotations.xml` over the redefinitions in sub-detector XML files.\r\n\r\nNote that this PR only changes the tool that creates the big XML file and does not directly affect any workflow.\r\n\r\n#### PR validation:\r\n\r\nThe DD4hep big XML file was created and compared carefully against the DDD big XML file. Sunanda has already shown that replacing mismatched rotations with the identity rotation eliminates the overlaps of concern.\r\n\r\nAfter the DD4hep fix is merged into CMSSW, the DD4hep big XML file will be created with this PR and will be tested and validated prior to uploading to the Conditions DB.\r\n\r\nThis PR should be backported to 12_0 to allow creation of a 12_0 DD4hep big XML file if needed.", "branch": "master", "changed_files": 2, "comments": 3, "commits": 1, "created_at": "1631739585", "deletions": 38, "labels": ["geometry-pending", "pending-signatures", "orp-pending", "tests-started", "code-checks-approved"], "milestone": "CMSSW_12_1_X", "number": 35299, "release-notes": [], "review_comments": 0, "state": "open", "title": "[DD4hep] Increase precision of rotation matching in making DD4hep big XML file for DB", "updated_at": "1631740203", "user": "cvuosalo"}