{"additions": 11, "auther_ref": "EPCombEcalEnergyErrFix_1020pre5", "auther_sha": "126de739aee32b4374f142a6a1004581f663ce86", "author": "Sam-Harper", "body": "Dear All,\r\n\r\nA flaw in how the ECAL-Trk combination is done has been reported to E/gamma which introduces a discontinuity in the Et spectrum when scaled & smeared. This is due to using the corrected relative ecalEnergyErr for the ECAL-Trk combination.  This bug fix now means that the uncorrected relative ecalEnergyErr is used. \r\n\r\nIn scale and smearing, the smearing is applied in quadrature to correct ecalEnergyErr which represents the per electron estimate of the resolution.  However due to how the combination uses this value, this results in incorrect responses. Details can be seen in https://indico.cern.ch/event/716848/contributions/3042888/attachments/1669765/2678161/scaleSmearingAndEP.pdf and a follow up https://sharper.web.cern.ch/sharper/cms/talks/scaleAndSmearingReprise.pdf\r\n\r\nThis bug effects the values stored in the 2017 miniAODv2 and the 2016 legacy miniAODv2. Obviously it is too late for the 2017 miniAODv2 but if it could fix the legacy, that would be good. These fixes can be applied at the user level, which will have to be done for 2017 data. \r\n\r\nWhen backporting to 94X, will I need a flag in the module config to reproduce the original bugged version?\r\n \r\n ", "branch": "master", "changed_files": 3, "closed_at": "1530021489", "comments": 12, "commits": 1, "created_at": "1529939398", "deletions": 3, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "278db19116ad938cc962fdc34aa4f7e5da32dfd8", "merged_at": "1530021489", "merged_by": "cmsbuild", "milestone": "CMSSW_10_2_X", "number": 23677, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Fixing ECAL-Trk energy combination such that it gets the uncorrected ecal energy err", "updated_at": "1530021490", "user": "Sam-Harper"}