{"additions": 433, "auther_ref": "feature-edmMemberSize", "auther_sha": "aca0cf407313c5cbdbb03de4e013083cd901eeef", "author": "rsreds", "body": "#### PR description:\r\n\r\nThis PR extends the functionality of `PerfTools/EdmEvent` by introducing the ability to measure individual leaf sizes in addition to branch sizes within ROOT trees.  \r\nThis allows to evaluate the disk usage of single data members of the objects in a root file.  \r\nIt adds an option to compute the size of each leaf in a branch (`--get-leaves-size`, `-L`).  \r\nIt calculates the overhead of a branchs size compared to the sum of its leaf sizes to obtain the same total size with both modes.  \r\nIt adds an option to select the ouput format (`--output-format`, `-f`) (text or json, defaults to text).  \r\nThe JSON file is formatted to work with [circles](https://github.com/fwyzard/circles).  \r\n  \r\nThese changes do not affect existing workflows unless explicitly enabled via the new options.  \r\n\r\n![piechart (2)](https://github.com/user-attachments/assets/d21b0344-3a2a-4469-bd6b-eb5daac885a0)\r\nAn example of the data grouped by the object type of the leaves\r\n\r\n#### PR validation:\r\n\r\nLocal manual verification confirm that the original branch size measurement functionality remains unchanged; the new leaf size measurement mode correctly computes sizes and overhead and JSON output is correctly formatted.  \r\nThe modified tool was tested with various EDM files to ensure expected behaviour.  \r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport.  \r\n", "branch": "master", "changed_files": 4, "comments": 18, "commits": 4, "created_at": "1738575108", "deletions": 209, "labels": ["core-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending", "ngt", "allow-rsreds"], "milestone": "CMSSW_15_0_X", "number": 47248, "release-notes": [], "review_comments": 7, "state": "open", "title": "Extend edmEventSize to measure leaf sizes", "updated_at": "1738748159", "user": "rsreds"}