{"additions": 3684, "auther_ref": "fix-zero-comparisons", "auther_sha": "1d471a121438fc62eeb9ea08df11416b5aaecb0e", "author": "cvuosalo", "body": "Certain units tests are failing on the ARM architecture because tiny floating-point values near 0 are slightly different than on the standard CPU, as described in issue #29036.\r\n\r\nTo fix this problem, the printed values used for comparison will be rounded to 0 if they are less than 1e-7. The internal values will not be changed, only the printed values used to compare the test results and the baseline reference file, which is being updated.\r\n\r\nThis change means the DT Geometry unit test will be less sensitive to small differences in norm vector values near zero, which could possibly mean it might miss a real problem, but the current test is too sensitive in failing because of 1e-16 fluctuations. I think the version of the test in this PR is sufficiently sensitive to catch real errors while avoiding false positives.\r\n\r\nThis PR adds a new utility file `Rounding.h`. I looked to see if a function to round values near 0 already exists, but I couldn't find one, so I added this new file. If there is already such a rounding function, or if I put the new file in the wrong place, this PR can be revised.\r\n\r\n#### PR validation:\r\n\r\nThe unit test should now be platform-independent. I hope this PR can be tested against the ARM IB because I have not be able to test the code change on an ARM machine.\r\n\r\nNo backport is needed.\r\n", "branch": "master", "changed_files": 3, "closed_at": "1583145201", "comments": 26, "commits": 2, "created_at": "1582752244", "deletions": 3655, "labels": ["bug-fix", "code-checks-approved", "comparison-pending", "fully-signed", "geometry-approved", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "61014d46ec76b7113b0e0e8f28657b83dd6b6637", "merged_at": "1583145201", "merged_by": "cmsbuild", "milestone": "CMSSW_11_1_X", "number": 29052, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Fix failing test on ARM by rounding small values to 0", "updated_at": "1583145201", "user": "cvuosalo"}