{"additions": 2, "auther_ref": "removeDeprecatedJetCorrector", "auther_sha": "44852c6f38e125b178a7204c0ffc3e6051cc956d", "author": "wddgit", "body": "#### PR description:\r\n\r\nRemove the deprecated ::JetCorrector class from CMSSW and other related files with it. The migration from ::JetCorrector to reco::JetCorrector started in 2014 and it is time to finally complete it. For the most part this PR removes unused dead code and simplifies things. It makes it impossible for someone to use the deprecated code and obvious failures will occur if they try. It reduces the amount of code we need to maintain and support.\r\n\r\nAlmost this entire PR consists of deletions. There are two exceptions to that. In the old JetCorrector.h file I added a #error with a descriptive message so that any attempt to use it results in a compilation failure with an informative message. The other exception is in RecoHI/HiJetAlgos/python/hiCaloJetsForTrk_cff.py. I migrated that file from using the old JetCorrector type to using the new reco::JetCorrector. Somehow that one was missed earlier.\r\n\r\nThere has been a long effort to migrate from the old JetCorrectors to the new JetCorrectors that has been in progress since 2014. Volker Adler did most of this migration long ago. I've recently migrated all the remaining C++ code. I've also migrated all the Python configuration code that is used in existing tests that I can find. And I will help if merging this PR reveals more cases of code in CMSSW that needs migration. There are 4 PRs that are submitted but not merged yet. These need to be merged before this PR or there will be compilation errors. These are #39875 #39864 #39847 and #39804.\r\n\r\nThere are dozens of configuration files that still reference the old cff files deleted by this PR. Those will be broken by this PR, but they are all old and look to be old obsolete code that is already broken. It is not worth the effort to deal with them at this point. If someone tries to run them they will fail with an obvious exception and then they can migrated to use the new JetCorrector class. There is a good chance none of them will ever be used again.\r\n\r\n#### PR validation:\r\n\r\nRelies on existing tests. Errors caused by this should result in obvious exceptions.\r\n\r\nThe one exception is the change in hiCaloJetsForTrk_cff.py. That is tested by runTheMatrix.py test 140.53. That is how I noticed it still needed to be migrated.\r\n\r\nIf other failures show up, I will be available to help migrate the affected code.\r\n", "branch": "master", "changed_files": 32, "comments": 20, "commits": 2, "created_at": "1667325630", "deletions": 2695, "labels": ["reconstruction-pending", "dqm-pending", "analysis-pending", "pending-signatures", "orp-pending", "tests-started", "requires-external", "code-checks-approved", "xpog-pending"], "milestone": "CMSSW_12_6_X", "number": 39953, "release-notes": [], "review_comments": 2, "state": "open", "title": "Remove deprecated JetCorrector and related files", "updated_at": "1667659735", "user": "wddgit"}