{"additions": 160, "auther_ref": "devel_daqFixIniTempAndDiscardLS_126X", "auther_sha": "ee1f105c55cb1addd2887cff1f6950fff6e7e3dd", "author": "missirol", "body": "backport of #40099\r\n\r\n#### PR description:\r\n\r\nFrom the description of #40099 by @smorovic:\r\n\r\n> Two changes are implemented for the file-based output protocol:\r\n> \r\n> Early \"initemp\" file marker:\r\n> \r\n>   - A file marker is created in constructor (.initemp of .ini depending on the stream type and content availability at construction). From 12_6_X, as noticed in tests, beginRun (or globalBeginRun) in GlobalEvFOutputModule can be called after event processing in the source starts, so creating such markers at beginRun is no longer sufficient. Marker needs to be created early for hltd daemon to know which streams are in the run, and therefore wait for output completion until lumisection can be closed in the merging system. Standard INI file is still created with information from beginRun, except in case of DQMHistograms where it is empty, so creation was moved to constructor.\r\n> \r\n>   - Changes are implemented in the GlobalEvFOutputModule (data streams), DQMFileSaverPB (DQMHistograms stream) and L1/HLTriggerJsonMonitoring (L1/HLTRates streams). **Note:** in combination with correspoding changes in hltd, this patch is **required** for CMSSW_12_6_X being used in the HLT environment, as collecting output doesn't work with current version of the sw.\r\n> \r\n> \r\n> Discard LS:\r\n> \r\n>   - appearance of a file marker in hltd run directory will trigger discard of specific LS data locally in CMSSW. Motivation for this is freeing space in temporary ramdisks in HLT to allow data processing to be unblocked. With concurrent lumisections (N = 2 by default in HLT), LS potentially doesn't get closed until N new lumisections are queued, so a range of several lumisections is checked by the input source. In the output module, a new file marker check (this is a fast file operation done in ramdisk) is performed before each event is written. Discarding is implemented only for the data streams, since special streams are negligible in size.\r\n\r\n#### PR validation:\r\n\r\nNone (relies on the validation done for #40099).\r\n\r\n#### If this PR is a backport, please specify the original PR and why you need to backport that PR. If this PR will be backported, please specify to which release cycle the backport is meant for:\r\n\r\n#40099\r\n\r\nFix (+new feature) for HLT online workflows.\r\n", "branch": "CMSSW_12_6_X", "changed_files": 8, "closed_at": "1669613563", "comments": 9, "commits": 1, "created_at": "1669370467", "deletions": 41, "labels": ["daq-approved", "dqm-approved", "hlt-approved", "fully-signed", "tests-approved", "bug-fix", "orp-approved", "backport-ok"], "merge_commit_sha": "f8372765495a853e60e5605ab3c6534baaef20c0", "merged_at": "1669613563", "merged_by": "cmsbuild", "milestone": "CMSSW_12_6_X", "number": 40156, "release-notes": [], "review_comments": 0, "state": "closed", "title": "(DAQ) File based protocol update: \"initemp\" markers + \"discardLS\" feature [`12_6_X`]", "updated_at": "1669613564", "user": "missirol"}