{"additions": 93, "auther_ref": "124_pilotFastSimRun3", "auther_sha": "705630c0126509eef9e9e5bef431498b100b58a6", "author": "srimanob", "body": "#### PR description:\r\nAs reported in SIM meeting news (25 March), https://indico.cern.ch/event/1143277/, FastSim cmsDriver does not work. This PR is to handle Run-3 FastSim workflow including\r\n- fix the issue coming from the interplay between `run3_common` and `fastSim` modifiers. \r\n- include `PAT` step to the FastSim sequence as done in the FullSim. The `MINIAODMCUPXXFS` step is not needed at the end of sequence.\r\n- introduce 2021 FastSim workflows (include premixing production workflow). The PU premixing workflow can be done later when PU dataset is available.\r\n\r\nTopic to discuss (maybe at the later PR):\r\n- It is not clear we should exclude GEM also as we did for Run-2. I just create FastSim era in the same way as Run_2 by excluding it. It may not need to exclude anymore.\r\n- Workflows are added in the same style as 2018. Should we move to upgrade workflow? [2022-02-26: Migrate to upgrade, except premix lib production.]\r\n\r\nIssues (keep track in https://github.com/cms-sw/cmssw/issues/37351):\r\n- Currently, Workflows run upto PAT. However, the validation, dqm and harvesting are not yet done for miniaod. \r\n- Nano does not work.\r\n\r\n#### PR validation:\r\nConfigs from following runTheMatrix run until the end.\r\n`runTheMatrix.py --what standard -l 2021.1 -t 8 --wm init`\r\nand\r\n`runTheMatrix.py --what upgrade -l 11634.301 -t 8 --wm init`\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\nNot a backport and no need of backport", "branch": "master", "changed_files": 8, "comments": 22, "commits": 5, "created_at": "1648220940", "deletions": 2, "labels": ["simulation-pending", "operations-pending", "pending-signatures", "tests-pending", "orp-pending", "pdmv-pending", "upgrade-pending", "code-checks-approved"], "milestone": "CMSSW_12_4_X", "number": 37347, "release-notes": [], "review_comments": 0, "state": "open", "title": "Run-3 FastSim modifier and workflows in runTheMatrix", "updated_at": "1648302083", "user": "srimanob"}