{"additions": 352, "auther_ref": "pps_re_alignment_11_1", "auther_sha": "3386bdf47233193afe6bd12a2dced9f4ecdea4ff", "author": "CTPPS", "body": "#### PR description:\r\n\r\nThis PR adds a convenience module which can apply (some) alignment changes directly to lite local tracks, a format that is available in miniAOD. The motivation is to have an effective tool to check alignment updates without the burden of accessing AOD files (often on tape). The alignment updates compatible with this new module are limited to RP shifts - such changes are equivalent to shifts of reconstructed tracks.\r\n\r\nThis new module will NOT be used in any central workflow, thus absolutely no changes are expected. This new module is intended for private use by experts.\r\n\r\n#### PR validation:\r\n\r\nValidation files can be found in \"RecoPPS/Local/test/re_alignment\". There are several alignment files: full (with complete alignment) and also split into two components (base and corr). Standard PPS reco is made with the \"full\" (black) and \"base\" (blue) alignment. Then, the re-alignment is run on top of \"base\" results with \"corr\" alignment (red dashed). The plot below shows histograms of reconstructed track positions: As expected black and red-dashed histograms overlap and the blue histogram is misaligned.\r\n![make_cmp](https://user-images.githubusercontent.com/17830858/86022887-3ee86880-ba2b-11ea-9ecc-4f31affb3b10.png)\r\n", "branch": "master", "changed_files": 7, "closed_at": "1593841747", "comments": 22, "commits": 5, "created_at": "1593436373", "deletions": 0, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "ce0e500cbbdc15e9366585df871bbd90a064aa02", "merged_at": "1593841747", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 30452, "release-notes": [], "review_comments": 22, "state": "closed", "title": "PPS: re-alignment module", "updated_at": "1593841748", "user": "jan-kaspar"}