{"additions": 59, "auther_ref": "dev-auto-nano", "auther_sha": "d6bef675df784477c34843089cc7068a0a6f4a17", "author": "simonepigazzini", "body": "#### PR description:\r\n\r\nIntroduce a new utility to configure the NANO step using a mapping technique similar to the one used by DQM to load only selected modules.\r\n\r\nautoNANO allows one to customize the NANO step using a syntax like: `-s NANO:@PHYS+@L1Full` where the `@` is then mapped to sequences and customize function and loaded into the processing. Previously we used the standard  `-s NANO:my_cff.my_sq1+sq2` syntax to customize the NANO step, this is still supported, but the two syntaxes cannot be mixed.\r\n\r\nWe also introduce a different mapping function than the one used by DQM, mainly because the latter uses a list of lists to specify different modules (pre, main, post) while we prefer to use a dictionary to avoid ordering related bugs (we can discuss if we actually want to port the DQM implementation to use a dictionary instead of a list of lists as well).\r\n\r\nIn this PR we insert a minimal set of workflows into autoNANO, the list will be expanded soon collecting the other existing workflow that are currently configured in a different way.\r\n\r\n#### PR validation:\r\n\r\nRan few test jobs for all possible combination. Successfully  reproduced PromptNano 2023 and standard NANO ntuples.\r\n\r\nNo backport foreseen at the moment.\r\n\r\n#### Further details on the autoNANO syntax\r\n\r\nThe default NANO sequence (which includes a \"default customize function\") is loaded by default if no step modifer is specified (`-s NANO`) or if the mapping points to empty strings (`'PHYS': {'sequence': '',  'customize': ''},). Missing dictionary keys are instead used to specify a workflow that do not require a dedicated \"sequence\" or \"customize\".", "branch": "master", "changed_files": 2, "comments": 8, "commits": 2, "created_at": "1689144306", "deletions": 3, "labels": ["operations-pending", "pending-signatures", "orp-pending", "tests-started", "code-checks-approved", "xpog-pending"], "milestone": "CMSSW_13_3_X", "number": 42238, "release-notes": [], "review_comments": 0, "state": "open", "title": "Introduce autoNANO", "updated_at": "1698659821", "user": "simonepigazzini"}