{"additions": 20, "auther_ref": "EGSCRegULUpdate_1050", "auther_sha": "d32be86da3979d6abee5570636a7713bcc5e93f5", "author": "Sam-Harper", "body": "#### PR description:\r\n\r\nThis PR updates the mustache supercluster energy regression for incoming UL regression. \r\n\r\nThe 2017 regression will be coming soon to a global tag and then 2016/2018 will follow in a few weeks. \r\n\r\nThis PR is backwards compatible with the existing supercluster regression, as in it will work just fine with what is in the global tag right now. There are two changes\r\n\r\n1) seed eta is added to the endcap as an input variable to help the regression be more stable with high eta. This is the last variable the regression and the current 74X regressions simply ignore it. \r\n\r\n2) a bug was fixed in the calculation of sigmaIEtaIPhi, it was always not set as sigmaIPhiIPhi was always set to std::numeric_limits<float>::max() when it was being constructed.   The option to reapply that bug is available. \r\n\r\nBy default, this bug will be fixed which means the 74X regressions will get this fix and therefore the correction value for a given supercluster will change slightly after this change. This I do not consider an issue as\r\n\r\n1. it only effects mustache superclusters whose exact energy is not terribly important except for the ECAL DPG who are the main users of this (most people use refined superclusters). It does enter E/gamma seeding though so can have some minor  effect there\r\n1. the existing regressions are regardless broken right now when being run on 106X samples as they are not adapted to the new thresholds\r\n1. the change is on average small.\r\nhttps://sharper.web.cern.ch/sharper/cms/egamma/2019/May13th/cruijffSigmaBugComp.png\r\nhttps://sharper.web.cern.ch/sharper/cms/egamma/2019/May13th/cruijffMeanBugComp.png\r\n(with the differences being just bad fits)\r\n\r\n#### PR validation:\r\n\r\nThe result of the new regression (which is not yet active, needs GT updates)\r\nhttps://indico.cern.ch/event/817696/contributions/3423912/attachments/1840813/3018110/superClusterRegressionUL_ecalFollowup.pdf\r\nhttps://indico.cern.ch/event/817696/contributions/3423665/attachments/1840744/3017891/UL_10X_regV2.pdf\r\n\r\nValidating running this regression in CMSSW vs the ntuple training, saw 57 out 19,408,000 electrons have a difference between the two of more than 1 MeV. All were <0.5 GeV except one which had a delta of 1 GeV. Not entirely sure why, but very rare process and is good enough :)\r\n\r\n\r\n", "branch": "master", "changed_files": 4, "closed_at": "1558030127", "comments": 13, "commits": 1, "created_at": "1557742218", "deletions": 11, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "27c471e49fe03ee6e8d62268ad4e10fa6d6036ae", "merged_at": "1558030127", "merged_by": "cmsbuild", "milestone": "CMSSW_11_0_X", "number": 26763, "release-notes": [], "review_comments": 0, "state": "closed", "title": "updating SC reg corrector for UL regression", "updated_at": "1558030127", "user": "Sam-Harper"}