{"additions": 186, "auther_ref": "CMSSW_12_5_X_tau-pog_deepTau-v2p5-WPs-nano", "auther_sha": "d0122b1f7436ac8b0ecc4293b6ab955175183fd9", "author": "cms-tau-pog", "body": "#### PR description:\r\nThis PR adds working point definitions for a newly integrated DeepTau v2p5. \r\nA corresponding study with details about WP threshold derivation and tau efficiency/mis-ID rate plots for both Run2 UL and Run 3 samples can be found [here](https://indico.cern.ch/event/1173018/contributions/4926652/attachments/2466518/4237200/wp_eff_final.pdf).\r\n\r\nIn particular, the changes in this PR are:\r\n* WP thresholds values for DeepTau v2p5 are added to runTauIdMVA.py and thus to miniAOD;\r\n* For nanoAOD, add a dedicated set of variables `_deepTauVars2018v2p5` to `taus_cff.py`,\r\n* Unify WP masking interface to a single function `_tauIdWPMask()`;\r\n* Option to compute WP flags from raw scores (`from_raw` argument in `_tauIdWPMask()`) given the threshold values, instead of reading them directly from MINIAOD;\r\n* Change the format of storing WPs from bitmask to integer values for user-friendliness [see note 1]. \r\n\r\nBackport to 12_4_X foreseen.\r\n\r\n[Note 1]: Change of the format of storing WPs affects also WPs of already present tauIDs and thus is not backward compatible. For instance if old versions of nano (with old eras) were produced with this PR integrated they would have format which is not backward compatible with the same versions without this PR. We think, however, that there is not realistic use-case, i.e. old versions of nano are not produced with new releases. Keeping backward compatibility is possible, but implementation will be painful. Comments from experts are welcome.\r\n\r\n#### PR validation:\r\n\r\nSuccessfully tested with the \"limited\" set of matrix tests and a custom nanoAOD production.\r\n\r\n", "branch": "master", "changed_files": 8, "closed_at": "1659653902", "comments": 39, "commits": 20, "created_at": "1657717179", "deletions": 133, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "xpog-approved"], "merge_commit_sha": "92e4e3f3917305da12e80c88fd799eff4bedca73", "merged_at": "1659653902", "merged_by": "cmsbuild", "milestone": "CMSSW_12_5_X", "number": 38726, "release-notes": [], "review_comments": 3, "state": "closed", "title": "DeepTau v2p5 in nanoAOD", "updated_at": "1659653902", "user": "mbluj"}