{"additions": 4143, "auther_ref": "fc-etl-v5", "auther_sha": "7e94e89f12303c98842f06ee953826782badefbc", "author": "fabiocos", "body": "#### PR description:\r\n\r\nThis PR is based on the recent refresh of phase2 scenarios in #31673 , updates the ETL TDR scenario v4, moving it from D53 (which is removed) to D72, and adds the post-TDR ETL scenario v5, where only two sectors per disc are used. With the occasion, the association Left / Right to type 1 / 2 modules is inverted, for practical purposes of geometrical ordering to be used in the ```RecoMTD/DetLayers``` tracking geometry.\r\n\r\nTest workflows are provided, but not added to the matrix until the update of ```RecoMTD/DetLayers``` is made (otherwise the RECO step is bound to fail).\r\n\r\nFor the time being the Phase2C11 era is used, as in scenario D68, which is the starting point for the new ones here added. Anyway the possible addition of an ETL-dedicated modifier, as discussed in the scrutiny of #31654 , should be refrected in the update of this PR.\r\n\r\n#### PR validation:\r\n\r\nAll the standalone tests of MTD geometry packages produce reports that are consistent with the drawings upon direct inspection, and existing unit tests (based on D50) are not affected. These scenarios are currently used to develop the update of ```RecoMTD/DetLayers```.", "branch": "master", "changed_files": 18, "closed_at": "1602830670", "comments": 28, "commits": 4, "created_at": "1602143088", "deletions": 63, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "geometry-approved", "operations-approved", "orp-approved", "pdmv-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "05c82a35723127a5f959b3fab75a261613c31fe7", "merged_at": "1602830670", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 31710, "release-notes": [], "review_comments": 2, "state": "closed", "title": "MTD geometry: add scenarios D72 (ETL v4) and D73 (ETL v5), remove D53", "updated_at": "1602830671", "user": "fabiocos"}