{"additions": 369, "auther_ref": "dqm-fix-histo-booking-calls", "auther_sha": "2cbd069ea9544bcae3e4aaa623918970d74949f2", "author": "andrius-k", "body": "#### PR description:\r\n\r\nChanged a macro that would generate histogram booking calls to regular methods inside `IBooker`.\r\n\r\nPrevious implementation was using a macro to generate a facade monitor element booking methods for DQMStore. Such approach saves some lines of code but code navigation becomes impossible and readability decreases. \r\n\r\nDue to the fact that argument forwarding (`std::forward<Args>(args)...`) somehow caries out the type information of literal value arguments, different overloads are chosen after the update. Such cases were identified and fixed in this PR.\r\n\r\nThe problematic methods are [these two](https://github.com/cms-sw/cmssw/blob/cca5eecc3fa46fcae943c7dad1a2c37668261579/DQMServices/Core/interface/DQMStore.h#L212-L220). When `0` literal value is passed to the fourth argument, the pointer overload is (incorrectly) selected because of two reasons:\r\n\r\n- `0` is a valid null pointer literal value, and\r\n- it takes an implicit conversion (from int to double) for a double overload to be called\r\n\r\nPreviously the double version of the overload would be selected and the new behaviour is incorrect. \r\n\r\nThe fix is simple: finding all the cases where one of these two overloads are called and replacing zero literal values (i.e. `0`) with double literal values (i.e. `0.0` or '0.').\r\n\r\n#### PR validation:\r\n\r\nThe calls mentioned above were found by temporarily changing the type of first overload from `double` to `int` and compiling with `-k` (keep going in case of errors) option. This resulted in an ambiguity (compiler error with a corresponding message) because `0` literal value could be used for both methods without any implicit conversions. \r\n", "branch": "master", "changed_files": 6, "closed_at": "1558464090", "comments": 52, "commits": 4, "created_at": "1552472370", "deletions": 71, "labels": ["code-checks-approved", "comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "74f35fa9fb6d5ad775bc66959992b7bda221e478", "merged_at": "1558464090", "merged_by": "cmsbuild", "milestone": "CMSSW_11_0_X", "number": 26161, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Replaced DQM histogram booking macro to regular methods inside IBooker", "updated_at": "1558464091", "user": "andrius-k"}