{"additions": 2048, "auther_ref": "Phase2Muons", "auther_sha": "93099c0fd3d77063fd9481ccc0648dda76196df7", "author": "Parsifal-2045", "body": "#### PR description:\r\n\r\nThis PR implements a new Standalone (L2) Muon seeding strategy that fully utilizes the L1 Tracker Muons (L1TkMu) information. \r\nL3 Tracker Muon reconstruction is also streamlined, also taking advantage of the improved L1TkMu, to reduce redundancy. \r\nThe full scope of the changes was described in the [HLT Upgrade meeting on 8/10/2024](https://indico.cern.ch/event/1460055/contributions/6147459/attachments/2941712/5168585/2024_10_08_thesis_results.pdf), while the details on the integration were presented in the [meeting on 3/12/2024](https://indico.cern.ch/event/1482695/contributions/6261220/attachments/2978788/5244435/2024-12-03%20Phase%202%20validation%20and%20integration%20in%20CMSSW.pdf#page=4).\r\n\r\nThe new L2 seeder directly matches the stubs used to produce each L1TkMu with segments in DTs/CSCs. All matched segments are assigned to the seed, together with the pT measurement from the L1TkMu. This approach produces a single collection of seeds. \r\nOn the other hand, the current implementation produces two collections of seeds (from L1TkMu and \"offline\") that require matching and produces roughly a factor of 5 more seeds in ZMM simulated events with 200 PU.\r\nThe changes implemented in the seeding module results in a significant improvement in timing (about 42%) with mostly compatible efficiency.\r\n\r\nThe streamlining of the L3 reconstruction hinges on the idea of performing either the Inside-Out or the Outside-In L3 Tracker Muon reconstruction first, to then execute a second pass only for candidates that require it (i.e. either they were not reconstructed in the first pass or the quality of the track was not good enough). This approach starts from either reconstruction path (flexible in case of future changes or detectors' requirements) to produce a filtered collection of L3 tracks: the filter uses some of the same criteria used in the HLT Muon ID step (e.g. number of hits in the pixel, number of hits in the tracker, normalized chi2, ...). The filtered L3 Tracks are geometrically matched to either L1TkMu (Outside-In first) or Standalone Muons (Inside-Out first):\r\n- if the match is successful, the track is considered good enough and passes to the next phase;\r\n- if the match is unsuccessful, the lower-level object will be reused to seed the second reconstruction path.\r\nFrom the current results, the Inside-Out first approach seems to perform better, with more than 80% of the events in a ZMM sample at 200 PU requiring a single reconstruction path, to be compared with about 20% for the Outside-In first approach.\r\nIn any case, the streamlined L3 reconstruction reduces the fakerate in the merged (L3 IO + L3 OI) tracks collection as well as timing, while maintaining compatible physics perfomance until and including the final HLT Muon ID objects. All results, validation plots and ntuples are available [here](https://lferragi.web.cern.ch/plots/muon_hlt_phase2/14_2_0_pre4_PR/)\r\n\r\nThe changes have been implemented using two new process modifiers:\r\n- phase2L2AndL3Muons implements the new Standalone Muon seeding and executes the L3 Tracker Muon reconstruction Inside-Out first;\r\n- phase2L3MuonsOIFirst to be used on top of the previous one, swaps the L3 Tracker Muon reconstruction from Inside-Out first to Outside-In first\r\n\r\nThese process modifiers have been included in a set of workflows targeting SingleMu, TTbar, and ZMM samples:\r\n- .777 includes the phase2L2AndL3Muons \r\n- .778 includes the phase2L2AndL3Muons and the phase2L3MuonsOIFirst process modifiers\r\n \r\n#### PR validation:\r\n\r\nValidation builds on top of #46860 introducing specific validation paths for the new objects (e.g. filtered collections, objects to reuse). Physics performance mostly compatible with the current implementation. Tested on CMSSW_14_2_0_pre3 RelVals (TTbar and ZMM) (not pre4 due to those being limited to 35 PU) as well as private production with workflows 29834(.0, .777, .778) (TTbar) and 29850 (.0, .777, .778) (ZMM). \r\n**Please test on Phase 2 workflows using also .777 and .778 modifiers** \r\n", "branch": "master", "changed_files": 46, "comments": 37, "commits": 6, "created_at": "1733747812", "deletions": 159, "labels": ["dqm-approved", "hlt-approved", "l1-approved", "operations-approved", "reconstruction-approved", "fully-signed", "tests-approved", "orp-pending", "pdmv-approved", "upgrade-approved", "code-checks-approved", "changes-dataformats", "ngt", "allow-Parsifal-2045"], "milestone": "CMSSW_15_0_X", "number": 46897, "release-notes": [], "review_comments": 45, "state": "open", "title": "[NGT] Implement new seeding module for HLT Standalone Muon seeding and streamline HLT L3 Tracker Muon reconstruction ", "updated_at": "1734622226", "user": "Parsifal-2045"}