{"additions": 1, "auther_ref": "BSErrorScaleDQMLegacy", "auther_sha": "1b96ec3e40f979f1235fb6faaeb12c40dca51710", "author": "dzuolo", "body": "#### PR description:\r\n\r\nThis PR reverts the value of the error scale of the BeamSpot fit in the DQM Legacy client to 1.2\r\nThe error scale is a multiplicative term of the covariance matrix that accounts for under or over estimation of the PV errors.\r\nThe value 1.2 was estimated at the beginning of Run 1 operations and never changed since then.\r\nAt the beginning of the 2022 data taking at 13p6 TeV the client was constantly crashing due to fit failures. Offline investigations revealed that setting the error scale to 1.0 was curing the issue so we changed the value. Unfortunately we did not investigate the impact on the BeamSpot transverse widths. As you can see in the attachment we get a width of 18 um with error scale 1.2 which is quite far from the expected 10 um that we can get with an error scale of 1.2\r\nWe are in contact with Tracker DPG to perform an evaluation of the pixel vertices pulls using the split vertex method but we would to change the value in production before LHC moves to PHYSICS.\r\n\r\nThese change will affect the BeamSpot used in the HLT and Express reco and not the one in the Prompt reco. \r\n\r\n#### PR validation:\r\n\r\nSee attached plots. The code itself is unchanged.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNot a backport. A forward port to 13_1_X will be made soon.\r\n\r\nFYI: @mmusich @francescobrivio @gennai - could one of you please launch the test? Thanks!\r\n\r\n@cmsdqm : can you please put this PR in production before the next stable beams? Thanks!\r\n\r\n<img width=\"933\" alt=\"2022G_errorScale1p0\" src=\"https://user-images.githubusercontent.com/46677792/234884932-299b192f-5bef-4789-9f72-22357ef34389.png\">\r\n<img width=\"937\" alt=\"2022G_errorScale1p2\" src=\"https://user-images.githubusercontent.com/46677792/234884941-bde06fce-7b2d-4f36-b351-9956c53682d8.png\">\r\n", "branch": "CMSSW_13_0_X", "changed_files": 1, "closed_at": "1682702815", "comments": 12, "commits": 1, "created_at": "1682596696", "deletions": 1, "labels": ["dqm-approved", "fully-signed", "tests-approved", "orp-approved", "backport-ok"], "merge_commit_sha": "db47c5cb8db22d3f1e3d39bfd07ab346c582bf73", "merged_at": "1682702815", "merged_by": "cmsbuild", "milestone": "CMSSW_13_0_X", "number": 41446, "release-notes": [], "review_comments": 0, "state": "closed", "title": "[13_0_X] Reverting BeamSpot Legacy DQM client error scale to 1p2", "updated_at": "1682702815", "user": "dzuolo"}