{"additions": 64, "auther_ref": "ecalConcurrentIOVs", "auther_sha": "9717c1954ad6fdf9a53a9bf439f7cee6f62e8177", "author": "wddgit", "body": "Currently the Framework only allows one EventSetup IOV (Interval of Validity) to be processed at a time, but we are preparing to change this in the future and allow multiple concurrent IOVs. This PR modifies two ESProducers related to ECAL preparation for this change.\r\n\r\nPrior to this, these ESProducers held a pointer to a single produced object. After this PR it will use the ReusableObjectHolder class to manage multiple objects, one for each concurrent IOV. The objects need to hold different content for different IOVs and the ESProducers need to modify them during their produce call in a thread safe manner.\r\n\r\nThe dependsOn feature of the EventSetup has difficulty communicating with these different objects in the callbacks and produce function calls. The usage of the dependsOn feature is replaced by usage of the new ESProductHost class. It has a similar purpose, but works better when there are multiple IOVs because its interface allows direct communication via arguments between the produce methods and the lambda function that gets called when the dependent record changes.\r\n\r\nTested using runTheMatrix test 25.0 step 3 by printing out the contents of the produced products and comparing before and after the change. I also stepped through the changes in a debugger.\r\n", "branch": "master", "changed_files": 4, "closed_at": "1537794956", "comments": 14, "commits": 1, "created_at": "1536936914", "deletions": 43, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "db-approved", "fully-signed", "orp-approved", "reconstruction-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "8a372b6021cf13913adda6ed8ed7bdb09a635bb7", "merged_at": "1537794956", "merged_by": "cmsbuild", "milestone": "CMSSW_10_3_X", "number": 24548, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Prepare ecal ESProducers for concurrent IOVs", "updated_at": "1537794956", "user": "wddgit"}