{"additions": 0, "auther_ref": "legacyCleanupAnalysis", "auther_sha": "2cd429add6ad63e3c4836a6aaf0c368d84841ccc", "author": "wddgit", "body": "#### PR description:\r\n\r\nThis is part of a Core campaign to eliminate all references to legacy type modules from CMSSW. This completes the modules in the analysis category (this is the last one of these PRs for code outside the Core software).\r\n\r\nLegacy module support was removed in January 2023 and all the modules removed could not have been compiled since then because compilation would have failed.\r\n\r\nThis PR deletes 4 modules.\r\n\r\nTestGenParticleCandidates hasn't seen development since 2007 except for generic migrations, for example the last was the consumes migration 11 years ago. It hasn't been in BuildFile.xml and compiled in IBs since at least 2010. Nothing in CMSSW references it. I could easily migrate it to be a ```one``` type module and will if someone requests it, but it really looks like ancient junk.\r\n\r\nFor the other 3 modules, the case for deletion is even stronger. I only deleted the header files and cfi files in this PR. Back in 2019, PR #27888 deleted the .cc files which contained most of the code for these modules. I suppose it was just an oversight not to delete the headers. There are comments in the 2019 PR which discuss the reasons for deleting the modules. That old PR also seems to imply the author thinks the entire TopQuarkAnalysis subsystem is abandoned... Deleting the entire subsystem might save enough resources to be worth doing, but its outside my expertise and outside the scope of what I'm trying to do with this PR...\r\n\r\n#### PR validation:\r\n\r\nNone. Just deletes unused code.\r\n", "branch": "master", "changed_files": 7, "comments": 5, "commits": 1, "created_at": "1706739253", "deletions": 302, "labels": ["analysis-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_14_0_X", "number": 43833, "release-notes": [], "review_comments": 0, "state": "open", "title": "Delete last analysis legacy type modules", "updated_at": "1706770383", "user": "wddgit"}