{"additions": 784, "auther_ref": "trackingVertexValidation_harmonizeTP_v5", "auther_sha": "1b94ce4fcd7d18d0812245231e419c5fe65ae5d5", "author": "makortel", "body": "Previously tracks and TrackingParticles were associated to each other separately in track (all tracks + once for each iteration, and x2 for high purity tracks) and in vertex validation. In this PR the production of these track-TP associations is consolidated (the gain in time is, however, small as making the track-TP association in the presence of ClusterTPAssociationProducer is relatively fast).\n\nIn order to continue to support the per-iteration efficiency plots, a generic helper function (`associationMapFilterValues`) is implemented to enable filtering key-value pairs from `AssociationMap` based on the value. This allows to do the track-TP associations once with full collections, and then for iteration-specific easily restrict the TP-track association to the tracks of that iteration.\n\nThe configuration interface of MultiTrackValidator is slightly modified to use the same parameter for delivering the InputTags for associations/associators. The flag `UseAssociators` dictates whether the associators (True) are used or the associations (False). All other uses than validation for pp (as found with `git grep`) are migrated.\n\nIn addition, I propagated the change from iteration numbers to names (#5807) to the labels of the iteration-specific track selectors. Since the names of the MTV histogram directories change anyway in this PR, this way we get these two renames of the directories into a single validation cycle (for sure).\n\nTested in CMSSW_7_5_X_2015-04-12-2300, but rebased on top of CMSSW_7_5_X_2015-04-21-2300 due to new configuration files in FastSim/Validation that had to be migrated. No changes expected in histogram contents.\n\n@rovere @VinInn \n", "branch": "CMSSW_7_5_X", "changed_files": 39, "closed_at": "1430940406", "comments": 26, "commits": 11, "created_at": "1430139544", "deletions": 289, "labels": ["analysis-pending", "comparison-available", "dqm-approved", "fastsim-approved", "geometry-approved", "orp-pending", "pending-signatures", "reconstruction-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "1e52ed0b2a43c0322755e80585dedd1c6b6188b5", "merged_at": "1430940406", "merged_by": "davidlange6", "milestone": "CMSSW_7_5_X", "number": 8888, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Use common track-TP association in track and vertex validation", "updated_at": "1476956287", "user": "makortel"}