{"additions": 67, "auther_ref": "hpFilter4Muons123X", "auther_sha": "eced23d98819c86fe97e30b1af42e916a05c14d2", "author": "mandrenguyen", "body": "#### PR description:\r\n\r\nThis PR selects out highPurity tracks as input to the muon reconstruction for heavy ions.  It was noticed that the efficiency of global muons dropped in central (high multiplicity) events.  This inefficiency is larger than that observed for tracker tracks, which is modest, or for stand-alone muons, which are basically unaffected by centrality.  We surmised that poor quality tracks must be interfering with the matching.  It was found that by switching to highPurity tracks, we increased the efficiency of muon reconstruction at low momentum, without any effect at high momentum.   \r\n\r\nThe highPurity requirement is dropped when the primary vertex is not found.  This occurs in very low multiplicity events, particularly ultra-peripheral collisions.   Primary vertex information is used in the track quality assignment, which leads to tracks often failing to be assigned as highPurity.   The  fake track contribution is such collisions is negligible, however, so this requirement can simply be dropped, reverting to the default behavior used for pp reconstruction.\r\n\r\nThis development was presented to the muon POG:\r\nhttps://indico.cern.ch/event/1094481/#10-low-pt-reco-muon-efficiency\r\nhttps://indico.cern.ch/event/1100342/contributions/4629173/attachments/2356132/4020819/muonRecoRun3_30112021.pdf    \r\n\r\n@flodamas\r\n\r\n#### PR validation:\r\n\r\nTested with wfs 158 and 159\r\n\r\n\r\n\r\n\r\n", "branch": "master", "changed_files": 11, "closed_at": "1643199366", "comments": 29, "commits": 6, "created_at": "1641980403", "deletions": 8, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "9e1d632a8f29a207b0208f9b099a58e99b9392d8", "merged_at": "1643199366", "merged_by": "cmsbuild", "milestone": "CMSSW_12_3_X", "number": 36693, "release-notes": [], "review_comments": 16, "state": "closed", "title": "pre-select high purity tracks as input for muon reco in pp_on_AA era", "updated_at": "1643199367", "user": "mandrenguyen"}