{"additions": 378, "auther_ref": "CMSSW_11_2_X_tau-pog_deepTauForHLT_phase2", "auther_sha": "036963dfc9305c804317dacb0be73ac8af369ad7", "author": "cms-tau-pog", "body": "#### PR description:\r\n\r\nModifications of the DeepTauID code for phase II tau trigger studies:\r\n* add auxiliary functionality like a check of input IDs, file dump of input quantities.\r\n* add options `disable_CellIndex_workaround`, `disable_hcalFraction_workaround` to turn off workarounds which won't be needed in the future.\r\n*  add option `enableHGCalWorkaround` to PFRecoTauDiscriminationByIsolation serving as input to DeepTauID to enable a workaround needed for phase II.\r\n* Changed default value for variables related to number of hits to 0 instead of -999\r\n* Change the puppiweight to have an additional argument to define its return value for AOD. This allows the puppiweights to be defined separately for different blocks. Additionally split between weights for inner and outer blocks. All values have been extracted from the training.\r\n\r\nClean up of defaults in DeepTauID functions introduced during last preparation of phase II trigger studies (PR #31744 ):\r\n* Remove the default_value constant from all deepTau v2 code\r\n* Removed default_value argument from certain candfunctions and instead use conditionals where needed in the places these functions are called.\r\n\r\n_Modifications/defaults preserve the current DeepTauID for PAT level and no physics changes are intended there.\r\nDeepTauID on AOD as introduced recently in PR #31744 is developing and changes are intended._\r\n\r\n#### PR validation:\r\n\r\n* Basic check by the developers: Reran config file with update from deepTauAtHLT.py and everything ran smoothly. Running RecoTauTag/RecoTau/test/runDeepTauIDsOnMiniAOD.py also ran fine. Upon brief inspection, no strange behaviour observed.\r\n* code checks and format applied\r\n* unit tests pass\r\n* limited matrix tests pass\r\n", "branch": "master", "changed_files": 4, "closed_at": "1612539535", "comments": 36, "commits": 18, "created_at": "1610957476", "deletions": 124, "labels": ["code-checks-approved", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "acf500a11f0bef732bbf0ae4dfba6e33c23d0ac3", "merged_at": "1612539535", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 32676, "release-notes": [], "review_comments": 36, "state": "closed", "title": "Further preparations of deep tau ID for hlt phase2", "updated_at": "1612539536", "user": "swozniewski"}