{"additions": 26, "auther_ref": "fixDIGIToA_HGCAL", "auther_sha": "583c09436029f2b4d61cfb1b01deac81de4480fb", "author": "amartelli", "body": "This PR \r\n- fixes a bug spotted by @adas1994 in the computation of the time-of-arrival in the HGCAL digi\r\n- adds some comments to help the understanding of the code\r\n- fixes in the way in which the PCaloHits are cumulated, to deal with PCaloHIts having exactly the same time stamps (very few cases only observed in high PU)\r\n\r\nQuick reminder (how ToA firing works):\r\n- In each Silicon cell, the ToA is fired when the cumulative charge is at threshold (12fC).\r\n- Since a full pulse shape is not available, the single time stamps deposited by G4 in each cell (each with a time and a charge) are used:\r\n      - the time-sorted list of time stamps is considered, and their cumulative charge computed.\r\n      - the 2 time stamps with cumulative charge around the threshold (the one before, and the one after) are picked as reference\r\n       - the ToA is extracted with the linear interpolation between the 2 chosen time-stamps, taking the value at which the interpolation crosses the 12fC threshold.\r\n\r\nExplanation of  the bug fix:\r\n- The bug is in the interpolation of the cumulated charge vs time, to compute the ToA at threshold, \r\nand consists in the further cumulation of the already cumulated charges.\r\n- The first cumulation of time-stamps is correct\r\n- The identification of the cells with ToA available is correct\r\n- The bug only involves the identification of the time stamps used to interpolate and extract the ToA\r\n\r\nWe expect an impact if the delay among time stamps is \"big\", and this is what happens with PU.\r\nThe validation run, comparing the performance between the TDR version (with bug) and this PR version show a negligible impact also at 200PU.\r\n\r\nBug, fix and validation documented in the slides:\r\nhttps://cernbox.cern.ch/index.php/s/gMcLoFLjHXBpNdi\r\n\r\n\r\nFor reference @rovere", "branch": "master", "changed_files": 1, "closed_at": "1580313007", "comments": 23, "commits": 3, "created_at": "1579710120", "deletions": 18, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "simulation-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "0d1ebd66151e37b53b86837cb72b811817d3d9a8", "merged_at": "1580313007", "merged_by": "cmsbuild", "milestone": "CMSSW_11_1_X", "number": 28777, "release-notes": [], "review_comments": 0, "state": "closed", "title": "HGCAL: fix interpolation boundaries for ToA", "updated_at": "1580313007", "user": "amartelli"}