{"additions": 334, "auther_ref": "soft_mva_id_for_run3", "auther_sha": "9e23a7b442e39a542e7e46ee23a79b509ea4b6db", "author": "drkovalskyi", "body": "#### PR description:\r\n\r\nThe PR introduces a new MVA discriminator, optimized for muons with transverse momentum less than 10 GeV, for Run3 data  analysis. \r\n\r\nThe new model is trained using the XGBoost algorithm. The code uses the XGBoost C API for inference. A utility class, `XGBooster`, is introduced to avoid mistakes caused by incorrect usage of the model. Some of the inputs require additional processing of the muon matching information, which is implemented in `SoftMuonMvaRun3Estimator` files along with the model-specific inputs.\r\n\r\nThis PR adds one more float to the `pat::Muon` class, which alters the class check sum and necessitates a new version of the dictionary. It also adds one more branch to NanoAOD, deriving its value from the pat::Muon object as created in MiniAOD.\r\n\r\nThis new muon discriminator will be utilized for the reference soft muon selection in Run3 by MUO POG and BPH PAG. It is expected to be available in PromptReco in Run2024 and beyond. The latest presentation on the subject can be found at:\r\nhttps://indico.cern.ch/event/1351304/#6-update-on-the-soft-muon-mva\r\n\r\n==WARNING==\r\nThe model is stored in `cms-data` and it needs to be integrated into CMSSW release for the code to work. The relevant PR can be found at https://github.com/cms-data/RecoMuon-MuonIdentification/pull/10.\r\n\r\n#### PR validation:\r\n\r\nThe code is copied from a private NanoAOD setup where it was extensively tested on hundreds of MC and Data samples. Modifications related to integration into PAT are minimal. A small RelVal test has been performed to confirm that results are identical to the private production.\r\n\r\nFYI @JanFSchulte, @z4027163", "branch": "master", "changed_files": 12, "closed_at": "1706019337", "comments": 41, "commits": 6, "created_at": "1703091707", "deletions": 1, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "requires-external", "code-checks-approved", "xpog-approved"], "merge_commit_sha": "4c8a2165aca97274520701e70a698b6c9dc74c49", "merged_at": "1706019337", "merged_by": "cmsbuild", "milestone": "CMSSW_14_0_X", "number": 43622, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Soft muon MVA id for run3", "updated_at": "1706019339", "user": "drkovalskyi"}