{"additions": 2617, "auther_ref": "printoutEventSetupDependences", "auther_sha": "57670a811b5bd34015266bc73a4e231282f447de", "author": "wddgit", "body": "#### PR description:\r\n\r\nThe Tracer service will print out information about the dependences between modules when the dumpPathsAndConsumes configuration parameter is set true. Before this PR, this information only covered dependences between EDFilters, EDAnalyzers and EDProducers. This PR extends that to also include EventSetup modules. The dependency information it prints is based upon the consumes calls in the C++ code.\r\n\r\nIssue #12126 requests this capability. This is an old request, originally from 2015.\r\n\r\nFor the most part, this PR adds and doesn't modify existing code. It shouldn't modify the behavior of the EventSetup. It shouldn't affect output of the program. Mostly it is additional code to get data out of existing data structures that are somewhat difficult to access.\r\n\r\nWhen reviewing this PR, one might benefit by first looking at the following file that contains reference output of a unit test:\r\n\r\n```\r\nFWCore/Integration/test/unit_test_outputs/testConsumesInfo_1.log\r\n```\r\n\r\nThere are 5 main parts in the output.\r\n\r\n1. Paths and the modules on paths\r\n2. ED modules and modules they depend on\r\n3. EventSetup modules and modules they depend on\r\n4. ED modules with individual data products they consume and more detail\r\n5. EventSetup modules with individual data products they consume  and more detail \r\n\r\nParts 3 and 5 are new. Parts 2 and 4 have EventSetup dependences added. Note that parts 4 and 5 have detail that includes both consumer and producer transitionID. The transitionID in the EventSetup is the count of the associated setWhatProduced function call in the ESProducer. This might be important because prefetching depends on this and is not done at the level of an entire ESProducer module.\r\n\r\nResolves https://github.com/cms-sw/framework-team/issues/1187\r\nResolves #12126 \r\n\r\n#### PR validation:\r\n\r\nThe existing unit test for this dump of information is extended to cover the various EventSetup cases and the output of the dump is compared to a saved reference file known to be correct by manual inspection.\r\n", "branch": "master", "changed_files": 72, "closed_at": "1739474136", "comments": 51, "commits": 1, "created_at": "1734038177", "deletions": 556, "labels": ["core-approved", "hlt-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "heterogeneous-approved"], "merge_commit_sha": "bf4d4fe891e7d94189bb86054451336cfba119c9", "merged_at": "1739474136", "merged_by": "cmsbuild", "milestone": "CMSSW_15_1_X", "number": 46929, "release-notes": [], "review_comments": 83, "state": "closed", "title": "Print ES module dependences from Tracer", "updated_at": "1739474137", "user": "wddgit"}