{"additions": 39, "auther_ref": "dnnTrackSelectionPPonAA", "auther_sha": "31612116985b9c237cce75cd52e2468ed4a25a9f", "author": "mandrenguyen", "body": "#### PR description:\r\n\r\nThe heavy-ion reconstruction (eras based on `pp_on_AA`) use track selection calibrations based on a BDT that was trained on Run 2 PbPb MC for six of the tracking iterations.\r\nIn the meantime, pp has migrated to a DNN-based track selection.  \r\nThere is an ongoing effort to perform a DNN training for heavy ions, but this is not 100% sure to converge for 13_2_X, which is the intended release for 2023 PbPb. \r\nAs a back-up solution we have tested the default pp calibrations, but tightening the working points to give a similar efficiency to the old BDT calibrations.   \r\nIt was found that the efficiency and fake rate are very similar, except at high pT where the fake rate is dramatically lower with the DNN track selection. \r\nThe performance is shown here:\r\nhttps://indico.cern.ch/event/1278968/contributions/5372961/attachments/2646731/4581824/Performance_of_DNN_with_pp_training_in_heavy_ions.pdf\r\nThis PR switches to the DNN as the default for heavy ions.\r\nWe also remove an additional difference between pp and HI tracking, which was the use of the `tight` quality bit in the hit cleaning between steps. \r\n\r\n\r\n#### PR validation:\r\n\r\nTested with wf 160\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNo backport will be needed.\r\n\r\n@CesarBernardes @abaty @sayanchatterjee38 @icali \r\n", "branch": "master", "changed_files": 8, "comments": 17, "commits": 2, "created_at": "1684243111", "deletions": 27, "labels": ["reconstruction-pending", "operations-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "tracking"], "milestone": "CMSSW_13_2_X", "number": 41698, "release-notes": [], "review_comments": 0, "state": "open", "title": "enable dnn tracking for heavy ions for Run 3 eras", "updated_at": "1684339432", "user": "mandrenguyen"}