{"additions": 201, "auther_ref": "bugFixConcurrentLumisWithException", "auther_sha": "2d43723df62bc5920eaa633a9071fbf7d7ada410", "author": "wddgit", "body": "#### PR description:\r\n\r\nThis fixes a bug that would be encountered when more than\r\none lumi is being processed concurrently and there is an\r\nexception. If the exception is associated with a lumi other\r\nthan the last one read, an infinite wait will be entered.\r\nThe wait is in the processLumis function of the EventProcessor.\r\nIt waits on every task in the stream SerialTaskQueues.\r\nIn the above situation the serial queue is not resumed\r\nbefore the wait and there are still tasks in the queues.\r\nThere is code that would clean these up in the function\r\nendUnfinishedLumis but that only runs after the wait\r\nis over and processLumis has returned. Too late.\r\n\r\nThis commit also fixes the maxEvents output parameter which was\r\nbroken when more than one lumi is processed concurrently. As far\r\nas I know nothing uses this, but it is an advertised parameter\r\nof the Framework that is supposed to work. One note about\r\nthis. If events are running concurrently when the limit is\r\nreached, then all the events already running will complete, so\r\nthe job could write more than the requested number of events\r\nto output.\r\n\r\nThe modified code is not executed if there are no exceptions and\r\nthe maxEvents output parameter is not used. Under normal\r\ncircumstances this should not have any effect on output or\r\nperformance.\r\n\r\n#### PR validation:\r\n\r\nThis adds two new unit tests. One test would fail with an infinite\r\nwait if executed in a release before this commit. It creates the\r\ncondition described above. The other tests the maxEvent output\r\nparameter. Plus I added an assert that checks that the reference\r\ncount is one in normalEnd when we try to delete RunResources\r\nand get endRun to execute (something to be concerned about in\r\nconcurrent lumi mode).\r\n\r\n", "branch": "master", "changed_files": 9, "closed_at": "1554661393", "comments": 29, "commits": 3, "created_at": "1554322731", "deletions": 43, "labels": ["code-checks-approved", "comparison-available", "core-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "d11322ce0de19e893097da6b1e46f8428013bd7e", "merged_at": "1554661393", "merged_by": "cmsbuild", "milestone": "CMSSW_10_6_X", "number": 26349, "release-notes": [], "review_comments": 3, "state": "closed", "title": "Bug fix for behavior after exceptions with concurrent lumis", "updated_at": "1554661393", "user": "wddgit"}