{"additions": 103, "auther_ref": "draft-Run2-migrate", "auther_sha": "80a119f117dec0e54e04223d55dc8e8644b19d7d", "author": "cvuosalo", "body": "Not for merging. This PR is for saving some example code changes that might be helpful for the Runs 1-2 DD4hep migration.\r\n\r\nAttempting to process the DDD big XML file (also called the extended geometry description file) with DD4hep can be a helpful step for migration. The big XML file contains the results of the algorithms, so migrating the algorithms can be avoided or postponed. It might even be possible to perform the migration solely on the big XML file and avoid migrating all the XML and algorithms, though there are limitations with such an approach.\r\n\r\nThis PR is an attempt to allow the DDD big XML file to be processed by DD4hep. It is not complete. Two problems are addressed. First, the SpecPars in the big XML file are given their proper names, which are missing from the standard DDD big XML file. Second, the materials are re-ordered to avoid references being made before definitions. However, a few materials are still out of order. They might be corrected by using newer versions of materials XML files, where these ordering issues have already been fixed. There may be further issues with processing the DDD big XML file with DD4hep yet to be discovered. The task is a work in progress, which may not necessarily be the most promising avenue for performing the migration.\r\n\r\nThe DDD big XML file for Run 2 2018, for example, is created with this command:\r\n```\r\ncmsRun CondTools/Geometry/test/writehelpers/geometryExtended2018_xmlwriter.py\r\n```", "branch": "master", "changed_files": 5, "closed_at": "1648658527", "comments": 4, "commits": 1, "created_at": "1647634766", "deletions": 10, "labels": ["geometry-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_12_4_X", "number": 37276, "release-notes": [], "review_comments": 0, "state": "closed", "title": "[Draft] [DD4hep] Improvements for DDD big XML file to help Runs 1-2 migration", "updated_at": "1648658528", "user": "cvuosalo"}