{"additions": 8208, "auther_ref": "master", "auther_sha": "f6b107e99bfae614119b3b8726c50bf066f43e78", "author": "ghugo83", "body": "**PR description:**\r\n\r\nThis PR adds Tracker T15, and its associated workflows.\r\nThis Tracker has same active geometry as T14, but significant MB update from latest Mechanical designs. More details in [1].\r\nThanks a lot to IT Mechanics group for the fruitful exchange! \r\n\r\nFull Tracker description is accessible at: http://ghugo.web.cern.ch/ghugo/layouts/T15/OT616_200_IT613/info.html \r\n\r\nGeometry scenario is: 2023D42.\r\nWorkflows are: 294xx (no PU), 296xx (PU).\r\n\r\nTracking performance should be compared with T14 (2023D40 scenario).\r\nNotably, it would be valuable to get the fake rate at PU200 (workflow 29434.0) versus T14.\r\n\r\nThis PR also removes the Trackers which were used for IT portcards placement study (T12 and T13 + their associated workflows).\r\n\r\nNB: This includes data from latest Mechanical designs, which is a moving process: obviously IT MB will still need to be further updated, as latest designs become available. This can imply significant changes.\r\nThis PR does however contain a first deep review of full IT MB.\r\nThis should also point out the importance of Mechanical choices, which can have a deep impact on the tracking performance.\r\n\r\n\r\n**PR validation:**\r\nFollowing was done for validation:\r\n- Deep debug with Mechanical engineers, often data needed to be adapted to be in a format which tkLayout can digest.\r\n- Debug / adaptation of tkLayout for new IT MB, all volumes.\r\n- Debug of XMLs, all volumes.\r\n- Solved all overlaps on CMSSW with Fireworks and Geant4 tools.\r\n- Checked no shift in workflows numbers.\r\n- Checked that workflows with D42 run smoothly with no extra error / warning.\r\n\r\n\r\n**[1] Tracker changes in this PR (versus T14 description):**\r\n\r\n_Outer Tracker:_\r\nSlight diff in MB, intentionally kept to non-significant.\r\n\r\n_Inner Tracker:_\r\n- Module materials fully revisited: HDI, capacitors, ROC.\r\n- Added missing/updated modules cooling rails and cooling blocks materials. \r\n- Cooling pipes fully revisited, for all subdetectors: Ti -> SS everywhere, 1 mm wall thickness everywhere, changed diameters and #pipes in TBPX, changed to double-pass model in TFPX and TEPX, adaptation to new dee design in TEPX.\r\n- TEPX: also added PCB panel.\r\n- Added missing supports and screws, updated CFRP supports thicknesses.\r\n- ITST and service cylinder fully revisited: geometry, materials, also added flange section and reinforcement rings.\r\n- Cabling updated to latest designs.\r\n\r\n\r\nTO DO:\r\n- Portcards not updated.\r\n- Add junction interface (CFRP) between TBPX outer cylinder and services cylinder.\r\n- All cooling pipes diameters are set in tkLayout to ID=2.0 mm and OD = 2.2 mm (except on TBPX ladders: ID = 1.6 mm and OD = 1.8 mm). To be tuned.\r\n- Add ITST support rails.\r\n- Further tune ITST & service cylinder.\r\n- Add to tkLayout software support for more precise volume description and placement (many points here!).\r\n- Services are assumed to be uniformly distributed around service cylinder, instead of routed at specific phi locations.\r\n- OT MB not revised.\r\n\r\nFYI: @emiglior @jalimena @boudoul @kpedro88 @pwittich @alkemyst ", "branch": "master", "changed_files": 19, "closed_at": "1557211507", "comments": 32, "commits": 5, "created_at": "1556274938", "deletions": 21904, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "geometry-approved", "operations-approved", "orp-approved", "pdmv-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "da2a03fc096c7ba9bdc4c5f9989b73a38b2203c2", "merged_at": "1557211507", "merged_by": "cmsbuild", "milestone": "CMSSW_10_6_X", "number": 26544, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Phase 2 Trackers. Remove T12 and T13 (IT portcards placement study). Add T15 (Major Inner Tracker MB update from latest Mechanical designs).", "updated_at": "1557232410", "user": "ghugo83"}