{"additions": 960, "auther_ref": "fastsim-newcfg-premix-march22", "auther_sha": "ca801baad3d9c724198ee93e7667d5c15ba001a5", "author": "lveldere", "body": "This PR superseeds #8414\n\nThe FastSim cfg structure was altered,\nto better resemble the standard cfg structure.\nThis will increase maintainability on long term,\nand on short term it is a necessary step in the preparation for premixing.\n### Changes\n- **cmsDriver**: the FASTSIM, deprecated since a long time, is removed from ConfigBuilder\n- **cmsDriver & runTheMatrix**:  FastSim has now the following steps in cmsDriver GEN,SIM,RECOBEFMIX,DIGI,L1,L1Reco,RECO,EI,HLT:@frozen25ns,VALIDATION all FastSim runTheMatrix workflows are migrated accordingly\n- **HLT**:  L1 and L1Reco step are moved outside the HLT step and are now separate steps in FastSim\n- **HLT**: clones of collections are replaced with EDAliases\n- **HLT DQM / Validation**: to avoid crahses in runTheMatrix workflows the inputlabel for SimVertices consumed by HLTriggerOffline/Btag is made configurable\n- **L1/DIGI**: packing and unpacking of calorimeter digis is removed and in order not to change any of the default InputTags, EDAliases are used to mimic the presense of post pack/unpack digi collections\n- **FASTSIM**: unnecessary dependence of FamosProducer on BeamSpot is removed \n- **unit tests**: outdated fastsim unit tests are removed from addOnTest.py\n- **Mixing**: reco track accumulator includes MVA values in mixing \n- **Mixing**: firstStepPrimaryVertices including PU tracks is emulated by reconstructing it from all  \n  generalTracks since after mixing no initialStepTrack collection is available.\n- **MIxing**: DataMixingModule can be configured to use RecoTrackAccumulator to mix tracker information\n### TODO after this PR\n- **HLT** cfg needs a more permanent solution which does not require to import the menu inside a wrapper in FastSimulation/Configuration (see e.g. FastSimulation/Configuration/python/HLT_GRun_Famos_cff.py)\n  discussion initiated in #8414\n- **HLT** rare segfualt in L2muons\n- **tracking** Perhaps a cleaner solution is needed on long term to delete the modules from full iteratitve tracking from the Reconstrion cfg\n- **FASTSIM** Remove all FastSim cfg and other code that has become obsolete\n### Tests\n- runTheMatrix.py -l 5.1,135.1,135.8,25400\n- wf 135.1 with 1000 events, sanity checks for distributions of main physics objects\n- detailed comparison of old dumped cfg vs new dumped cfg \n", "branch": "CMSSW_7_5_X", "changed_files": 44, "closed_at": "1428567000", "comments": 65, "commits": 37, "created_at": "1427032334", "deletions": 1188, "labels": ["comparison-available", "fastsim-approved", "fully-signed", "operations-approved", "orp-pending", "pdmv-approved", "tests-started"], "merge_commit_sha": "d22a183f2f14c0aab826ca807ae1124457c400cb", "merged_at": "1428566999", "merged_by": "davidlange6", "milestone": "CMSSW_7_5_X", "number": 8455, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Fastsim New CFG structure (preparations for premixing)", "updated_at": "1429614028", "user": "lveldere"}