{"additions": 397, "auther_ref": "dqm-new-legacy-io", "auther_sha": "b3259d5ce3ec70fe0e4d65fff181cd399566e768", "author": "schneiml", "body": "#### PR description:\r\nIn offline, the legacy TDirectory files for the DQMGUI are written by the `DQMFileSaver` module. While reading the code and its configurations, it became apparent that this module is not actually used in online or HLT (any more?), even though most of the code is dedicated to these cases. (Online and HLT use `DQMServices/FileIO` now.)\r\n\r\nSo, I stripped down this module to prove the hypothesis. \r\n\r\nIn addition, this PR contains the new TDirectory writing code by @andrius-k, as a new independent class. It is still linked into the DQMStore and can be called as `edm::Service<DQMStore>()->save(...)`. I also updated the Online output modules to use this helper (`DQMFileSaverOnline`) or contain the writing code (`DQMFileSaverPB`). Consequently, `DQMStore` itself does not contain _file writing_ code any more. There is still a huge amount of _file reading_ code, which is largely useless and to be removed next.\r\n\r\n#### PR validation:\r\n\r\nThis PR needs testing in online DQM (not done yet) and ideally also in HLT (or a solid confirmation that the module is never loaded in HLT). The changes to the ProtoBuf writer need to be tested in the HLT/fastHadd/online DQM chain. None of this is done so far. I'll try to provide a test setup in another PR.\r\n\r\nThis PR needs testing in Tier0 Express processing, where the `runIsComplete` logic is used.\r\n\r\nThe main point of the PR is to test\r\n- That only a single mode of this module is used in offline, to be confirmed by the IB tests; (as far as it seems confirmed)\r\n- That the new TDirectory writing code works; (confirmed)\r\n- Which unit tests depend on behavior removed in this PR. (none, it seems)\r\n\r\n[I suspect some tests to fail (assuming these tests are run in the PR tests, not sure about that), and some flaws in the TDirectory writing code (it does not support QTests yet, for example).] Edit: all fixed.\r\n\r\n", "branch": "master", "changed_files": 13, "closed_at": "1578947197", "comments": 63, "commits": 11, "created_at": "1575914465", "deletions": 1026, "labels": ["code-checks-approved", "comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "e3e4a3cab31ceadfb9c406618024b7b1d501bfa8", "merged_at": "1578947197", "merged_by": "cmsbuild", "milestone": "CMSSW_11_1_X", "number": 28588, "release-notes": [], "review_comments": 0, "state": "closed", "title": "DQM: new DQMFileSaver", "updated_at": "1578947198", "user": "schneiml"}