{"additions": 58, "auther_ref": "bugfixLateEndRun", "auther_sha": "e644c6caaa21bbfb74db0e7cd620215a94ca315a", "author": "wddgit", "body": "#### PR description:\r\n\r\nThis fixes the problem from issue #26246. This is related\r\nto a data race condition in EventProcessor. Almost always,\r\nthe correct data path wins the race and there are no\r\nproblems. In these cases, there should be no differences\r\nin the output with or without this PR. But there are very rare\r\ncases where the wrong code path wins the data race, then\r\nendRun gets called late and this would most likely cause a\r\nseg fault or very bad failure of some unpredictable nature. \r\n\r\nThe condition is related to the deletion of the\r\nLuminosityBlockProcessingStatus object. If we want\r\nto call endRun after exiting processLumis, then\r\nthis status object must have already been destroyed\r\nbecause it holds a shared_ptr to the RunResources\r\nobject that prevents endRun from running. If it isn't\r\ndestroyed then endRun may get called at some random\r\ntime much later which causes serious problems.\r\n\r\nThe writeT task in EventProcessor::globalEndLumiAsync\r\nis the one that caused the failure in the issue. Although\r\nthere were several similar issues that this also fixes that could\r\nresult in the same problem.\r\n\r\n#### PR validation:\r\n\r\nIt is hard to write a test for this, because it is a rare non reproducible problem. Even without the fix, almost always the right code path wins and there is absolutely no difference in how things execute in that case.\r\n\r\n#### if this PR is a backport please specify the original PR:\r\n\r\nPotentially I could backport this. These failures are very rare, so it is a judgement call whether it is worth the effort. Probably it was introduced when concurrent lumis were implemented.\r\n", "branch": "master", "changed_files": 2, "closed_at": "1554230114", "comments": 21, "commits": 2, "created_at": "1553799626", "deletions": 31, "labels": ["code-checks-approved", "comparison-available", "core-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "8df3c804a679e361484de7e45e49afcc3ad93bfe", "merged_at": "1554230114", "merged_by": "cmsbuild", "milestone": "CMSSW_10_6_X", "number": 26289, "release-notes": [], "review_comments": 8, "state": "closed", "title": "Fix race condition in EventProcessor", "updated_at": "1554230114", "user": "wddgit"}