{"additions": 486, "auther_ref": "SiPixelQuality_DQM_v1", "auther_sha": "6674e8abc4f0ec764cfab46282ba60639c1e67ac", "author": "tocheng", "body": "Hello, the PR is meant to monitor the PCL payloads of SiPixelQuality using tracker offline DQM.\r\nThe harvester is changed to a DQMEDAnalyzer to produce the payloads and DQM IO in one CMSSW module. \r\n\r\nThe continuous payloads are replace by one payload if they are identical. This will clean the redundant payloads in the tags.\r\n\r\nAnd with the help of the DQM plots, I found a bug in the tag for prompt-reco from the SiPixelQuality production; only the low DIGI ROCs in the permanent bad components were added to the tag for prompt-reco, while all the components that were low efficient (due to 2017 DCDC damage) were not included. So this bug was fixed in the later commit of the PR.\r\n\r\nMore details can be seen in the pixel offline meeting this week.\r\nhttps://indico.cern.ch/event/688868/contributions/3062848/attachments/1680102/2698910/PixelQualityPCL_July3rd_2018_pixeloffline.pdf\r\n\r\nSorry for pending the PR for quite some time. I was trying to find way to normalize the DQM plots in the way that they can be easily compared between different runs regardless the length of the run. But the simple way led to the crash of all TProfile plots for tracker DQM. There are other solutions, but from my point of view, too complicated to be done in a reasonable time. \r\nSo I keep the plots as what they are and they are still good enough to use without the normalization.\r\n\r\n", "branch": "master", "changed_files": 5, "closed_at": "1531458507", "comments": 44, "commits": 6, "created_at": "1529340827", "deletions": 109, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "fully-signed", "operations-approved", "orp-approved", "tests-approved"], "merge_commit_sha": "6ac15b7d997e604279ace0c857ea589595078ce8", "merged_at": "1531458506", "merged_by": "cmsbuild", "milestone": "CMSSW_10_2_X", "number": 23616, "release-notes": [], "review_comments": 8, "state": "closed", "title": "Monitoring of SiPixelQuality PCL using tracker offline DQM and bugfix for the SiPixelQuality tag for PromptReco", "updated_at": "1531458512", "user": "tocheng"}