{"additions": 172, "auther_ref": "from-CMSSW_12_6_0_pre2_newCLCTSorting", "auther_sha": "d6a17557306eca5bae013856a8d530c0193211b1", "author": "tahuang1991", "body": "#### PR description:\r\nLast year we found that current CSC trigger efficiency drops around 5% per station in the inner ring.  The root cause is: when high pT muons showered in the CSC chamber, the cathode hits produced by high pT muon is prefired, 1 or 2BX earlier than nominal case, while anode hits are still in-time. Conventional ALCT(built from anode hits)-CLCT(built from cathode hits) match algorithm would be inefficient as CLCTs from high pT muon are also prefired and CLCTs built from secondary hits are more in-time.  Therefore we proposed the upgraded ALCT-CLCT match algorithm for muon showers:\r\n1. define a local zone around the CLCT key halfstrip to flag the local shower if total hits in the local zone is over threshold\r\n2. if local shower is valid, then ALCT-CLCT match would pick up earlier CLCT, rather than in-time CLCT.  if local shower is not found, then it rolls back to conventional ALCT-CLCT match: ALCT would pick up more in-time CLCT, namely CLCT in the center of match window\r\n3. local shower definition is configurable: both the shower zone and shower threshold. Right now local shower feature is not enabled in the default configuration\r\n4. it is NOT included in firmware yet but MC studies with TeV muons showed that new ALCT-CLCT match would improve trigger efficiency when muon showers in the CSC station.\r\n\r\n#### PR validation:\r\npresentation on CSC meeting: \r\nhttps://indico.cern.ch/event/1197553/contributions/5035258/attachments/2504761/4304563/TaoOTMBStatus_TAMU_20220907_EMTFEff.pdf\r\nhttps://indico.cern.ch/event/1199888/contributions/5047438/attachments/2508640/4311202/TaoOTMBStatus_TAMU_20220907_EMTFEfffollowup.pdf\r\n\r\npresentation on L1 DPG meeting:  slide16-19\r\nhttps://indico.cern.ch/event/1216605/contributions/5117665/attachments/2538591/4369875/Tao_OTMB_L1TDPG_20221031.pdf\r\n\r\n\r\n\r\n\r\n", "branch": "master", "changed_files": 8, "closed_at": "1674816887", "comments": 16, "commits": 3, "created_at": "1674174662", "deletions": 10, "labels": ["l1-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "ae444b609c287e486d6837ef5cd189b3a5871906", "merged_at": "1674816887", "merged_by": "cmsbuild", "milestone": "CMSSW_13_0_X", "number": 40572, "release-notes": [], "review_comments": 5, "state": "closed", "title": "Add new ALCT-CLCT match algorithm for high pt muon  showers", "updated_at": "1674816888", "user": "tahuang1991"}