{"additions": 22, "auther_ref": "disableConcurrentLumisGEN", "auther_sha": "b7773880fa0276507d7c94f9b4ef54a771ab2f31", "author": "makortel", "body": "#### PR description:\r\n\r\nAs reported in #25090 several generator EDModules are not planned to be made support concurrent lumis (e.g. too difficult, so little overal CPU time spent so that it is not worth it, or with `ExternalGeneratorFilter` desire to continue testing generators also directly).\r\n\r\nIn order to silence the warning message on multithreaded jobs, and to later allow changing that warning to an exception (to better prevent any modules that do not support concurrent lumis to creep in workflow steps that are expected to support concurrent lumis), following the example of https://github.com/cms-sw/cmssw/pull/35073 this PR suggest the ConfigBuilder to set the number of concurrent lumis (and IOVs) explicitly to 1 if the job has `GEN` step with any of the generator EDModules that do not support concurrent lumis. In this PR I added a new file `Configuration/Generator/python/concurrentLumisDisable.py` to contain the list of the EDModules (so that it would be explicitly maintained by @cms-sw/generators-l2), in principle they could be listed elsewhere too.\r\n\r\nThis PR is very similar to \r\n\r\n#### PR validation:\r\n\r\nWorkflows `5.2,140.0,521.0,7.0,300.0,140.0,5.5,511.0,281.0,8.1,534.0,281.0,132.0,280.0,120.0` set their GEN step to use 1 concurrent lumi, and workflow `10024.0` continues to set 2 concurrent lumis (when run multithreaded).", "branch": "master", "changed_files": 2, "comments": 6, "commits": 1, "created_at": "1631038527", "deletions": 0, "labels": ["generators-pending", "operations-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_12_1_X", "number": 35182, "release-notes": [], "review_comments": 0, "state": "open", "title": "Set numberOfConcurrentLuminosityBlocks to 1 for GEN steps that have EDModules that are not going to support concurrent lumis", "updated_at": "1631143415", "user": "makortel"}