{"additions": 349, "auther_ref": "ReorganizeWrapperHeader", "auther_sha": "2efe7fbd69be880a6cbcf7969c1b744fc6167eee", "author": "wmtan", "body": "The header file Wrapper.h is difficult to maintain, as it is very long and has heterogeneous content, with inconsistent formatting.  This pull request is primarily a physical reorganization of this file.  It splits Wrapper.h into three separate, more coherent files.  One new file, WrapperView.icc contains the member function definitions for functions that support views, and associated helpers, with absolutely no changes to the implementation  A second new file, WrapperDetail.h, now contains the low level detailed code for supporting SFINAE metaprogramming so functions (other than view related functions) can act differently based on the member functions or data of the wrapped class. Also, the formatting of the remaining content of Wrapper.h is standardized to make it easier to read.  There are also two minor substantive internal improvements, neither of which impacts functionality.  One is that in WrapperBase.h, four functions that should have been declared as pure virtual are now so declared.  Secondly, the SFINAE code that was moved to WrapperDetail.h used two different implementations for SFINAE for historical reasons, which makes maintainability more difficult.  This pull request standardizes the SFINAE code in WrapperDetail.h  to use the same implementation throughout. No  API is modified by this pull request.  All framework unit tests and the short set of relval tests pass with this PR.\n", "branch": "CMSSW_7_5_X", "changed_files": 4, "closed_at": "1424510791", "comments": 11, "commits": 1, "created_at": "1424467870", "deletions": 394, "labels": ["comparison-available", "core-approved", "fully-signed", "tests-approved"], "merge_commit_sha": "544ca7b6fb5256942b72ad5217ae980b3de8504e", "merged_at": "1424510791", "merged_by": "cmsbuild", "milestone": "CMSSW_7_5_X", "number": 7890, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Refactor  and split up Wrapper.h for maintainability, as it has become unwieldy", "updated_at": "1424530456", "user": "wmtan"}