{"additions": 192, "auther_ref": "l1t-RicksPR-AprilMWGRv3_11_3_X", "auther_sha": "b0b43f167ad149af70c425c652b39a7301ad5737", "author": "cecilecaillol", "body": "#### PR description:\r\n\r\nThis is a bug-fix to the uGT emulator for the unconstrained pT (UPT) invariant mass correlation condition; the calculation in the original PR incorrectly used the nominal pT, rather than the UPT. The bug-fix to the emulator is somewhat extensive and required code changes in several locations:\r\n(1) TriggerMenuParser(.h, .cc), GlobalScales.(h, .cc) all had to be modified to correctly parse, set, and get the LUT scales for UPT.\r\n(2) CorrCondition.cc had to be modified to correctly get and apply the LUT scales for UPT to enable the correct calculation of the invariant mass for UPT using integer arithmetic based on the LUT scales for UPT.\r\n(3) TriggerMenuParser.cc also had to be modified to correctly parse the UPT and DXY (impact parameter) cuts for muon correlation conditions.\r\n(4) the print function in MuonTemplate.cc now includes displaced muon information, for debugging purposes.\r\n\r\n#### PR validation:\r\n\r\nThis PR has been validated by the following:\r\n(1) confirming that all code changes compile correctly using l1t-integration-CMSSW_11_2_0 with tag l1t-integration-v105.3\r\n(2) confirming that all code changes execute properly by producing test vectors\r\n(3) confirming that the bug-fix is correct by comparing the emulator results in the test vectors with the uGT firmware.\r\n\r\nNote that the VHDL firmware independently had the same bug, which caused earlier test vector comparisons between the emulator and the firmware to (incorrectly) agree. These new validation tests now demonstrate (correct) agreement between the bug-fixed emulator with the bug-fixed firmware.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nhttps://github.com/cms-l1t-offline/cmssw/pull/903/\r\n\r\n@rekovic @cavana ", "branch": "master", "changed_files": 6, "closed_at": "1620822487", "comments": 13, "commits": 6, "created_at": "1617730689", "deletions": 10, "labels": ["code-checks-approved", "fully-signed", "l1-approved", "orp-rejected", "tests-rejected"], "milestone": "CMSSW_12_0_X", "number": 33350, "release-notes": [], "review_comments": 0, "state": "closed", "title": "L1T bug-fix to the uGT emulator for the unconstrained pT (UPT) invariant mass correlation condition", "updated_at": "1620822487", "user": "cecilecaillol"}