{"additions": 6447, "auther_ref": "update-cscvalidation-for-12x", "auther_sha": "81ecb036eeafe6d00ff1cc1aa0c08d0f7f7511c2", "author": "ptcox", "body": "#### PR description:\r\n\r\nThis PR updates RecoLocalMuon/CSCValidation to CMSSW 12_X compatibility,\r\nThis is a stand-alone package for analyzing CSC digis, rechits, and segments, in more or less detail. Historically it was used to prototype DQM code. More recently is was used to provide CSC expert diagnostic plots which are too resource-intensive for use in DQM, and run in an automated fashion via a complex python scripts. I have integrated various developments in the code used externally into the CMSSW version for consistency, as well as updating for 12_x compatibility\r\n\r\nIt is a final-user package, not used anywhere else in CMSSW. \r\n\r\nIt includes src files and test files, and a subdirectory macros containing various root-related files for producing nice plots from the root output file produced by running CSCValidation.\r\n\r\nIt does not enter in, or affect, any CMSSW workflows.\r\nIt does not depend on any other PRs.\r\n\r\n#### PR validation:\r\n\r\nI have tested this extensively in 12_3_6 and in 12_5_0_pre3, running on 12.5 TeV collisions data in Express FEVT, SingleMuon RAW, and the SingleMuon Zmu skim RAW.\r\n\r\nI have run\r\ngit cms-checkdeps -a -A\r\nscram b -j 8\r\nscram b runtests\r\nwithout issue,\r\n\r\nI attempted to run `runTheMatrix.py -l limited -i all --ibeos` but after it had produced 20 subdirectories of output I ran out of disk space (they filled 10% of my quota which seems pretty extreme) without other errors. Since CSCValidation has absolutely nothing to do with any CMSSW workflows even doing that seems like a complete waste of time.\r\n", "branch": "master", "changed_files": 13, "closed_at": "1658330053", "comments": 8, "commits": 13, "created_at": "1657898053", "deletions": 1960, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "1a6af8d35a9e30ad3ac0b3241ff56a5c652892e4", "merged_at": "1658330053", "merged_by": "cmsbuild", "milestone": "CMSSW_12_5_X", "number": 38759, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Update cscvalidation for 12x", "updated_at": "1658330054", "user": "ptcox"}