{"additions": 5629, "auther_ref": "taskInitialVersion11", "auther_sha": "70048b081e4c2b75f8cf5185c69440b3e30fc22f", "author": "wddgit", "body": "This includes the initial implementation of the Task feature in the Core CMS configuration code. It allows creating Tasks, adding modules to them, and associating them to sequences, paths, end paths, and the schedule. In many ways they behave like Sequences except that the order modules appear on Tasks does not matter. New unit tests were added to test the Core code changes.\r\n\r\nThis PR also includes fixes for the runTheMatrix.py tests that I could run on cmsdev04 and IB unit tests. The intent of these python fixes was to have exactly the same modules run in unscheduled mode as before this change so the behavior should not change at all. I ran tests to verify this. But in the long run it would be a positive development for experts to use the Task feature to specify a smaller set of modules so resources are not wasted creating modules that will never need to be run. (I will monitor the full IBs and centrally fix any additional failures that show up)\r\n\r\nThere is much work remaining to be done to migrate all CMS configurations to use the Task feature.\r\nThis PR only does the minimum amount of migration needed to keep runTheMatrix.py and the unit tests working. A large amount of additional work will be needed to convert all CMS configuration code to use this new Task feature to specify modules that should be run in unscheduled mode instead of relying on the convertToUnscheduled function.\r\n\r\nThis PR modifies the convertToUnscheduled function to work properly with the new Task feature. EDProducers and EDFilters removed from paths and endpaths are automatically placed on a Task.\r\n\r\nNote this is a resubmission of PR #16538. This one is against 9_0_X but that earlier one was against 8_1_DEVEL_X and was closed before merging. The first 3 commits are identical and the subsequent commits resolve all the comments made to the earlier PR, mostly Chris's comments. ", "branch": "CMSSW_9_0_X", "changed_files": 196, "closed_at": "1483461298", "comments": 96, "commits": 18, "created_at": "1481233636", "deletions": 1093, "labels": ["analysis-pending", "comparison-available", "core-pending", "operations-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-rejected"], "milestone": "CMSSW_9_0_X", "number": 16925, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Initial implementation of Task feature in CMS Core configuration code", "updated_at": "1486148485", "user": "wddgit"}