{"additions": 57, "auther_ref": "fc-mtdsimhistory", "auther_sha": "538535831c6f38c1f539c5570988a17b8c207a7d", "author": "fabiocos", "body": "#### PR description:\r\n\r\nThis PR provides an update of the work originally proposed in https://github.com/cms-sw/cmssw/pull/41318 , and is documented in the presentation at the MTD DPG https://indico.cern.ch/event/1311014/contributions/5519119/attachments/2691938/4671605/MTDDPG-SIMtruth_20230728.pdf . Its purpose is on one hand to preserve the link between a ```PSimHit``` in BTL and ```SimTrack``` ids stored in the event, on the other discriminate (as much as possible) between BTL hits directly produced by primary tracks initially crossing crystals and by other possible tracks: secondaries from interactions in tracker that are not stored in the event history, hits by looping tracks that exited BTL and entered it again (not only charged tracks spiralizing in magnetic field, but also neutrals bouncing on material can have such a pattern), and hits from particles back-scattered into BTL from interactions with calorimeters (mostly ECAL). \r\n\r\nIn order to store such information while leaving unchanged the basic structure of the ```PSimHit``` object, the track id information stored in the hit is expanded with an offset large enough not to interfere with the genuine expected number of particles even in a quite large event (like for instance high pT QCD jets).\r\n\r\nThe categorization is based on a monitoring of volume boundary crossing in ```Phase2SteppingAction```, coping with the current Phase2 geometry structure, and on track classification in ```MCTruthUtil``` at the beginning of the track processing.\r\n\r\n#### PR validation:\r\n\r\nCode compiles, runs, and a detailed MessageLogger and event content hit analysis shows the desired behaviour. A DQM comparison on 10k MinBias events with and without this PR does not show any statistically significant effect, but for the multiplicity of tracks per crystal, which depends clearly on the track identifier of the hits.", "branch": "master", "changed_files": 7, "closed_at": "1691149806", "comments": 7, "commits": 3, "created_at": "1691047269", "deletions": 30, "labels": ["simulation-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "05e9125173f2c6c1a1899ae861528ab96a22955b", "merged_at": "1691149806", "merged_by": "cmsbuild", "milestone": "CMSSW_13_3_X", "number": 42455, "release-notes": [], "review_comments": 0, "state": "closed", "title": "MTD simulation: update trackId for BTL PSimHits", "updated_at": "1691149806", "user": "fabiocos"}