{"additions": 1252, "auther_ref": "10_3_X_dev", "auther_sha": "ea55a66cf481241071f0f3bfb361e93cfac3a7be", "author": "guitargeek", "body": "## Final Summary\r\n\r\n* Separated XML file parsing from the `GBRForest` data class itself and moved it to `GBRForestTools` where the parser was completely rewritten. The XML file is now parsed directly instead of translating a TMVA::Reader. This reduces startup time and CPU usage since the tree structure is only iterated over once.\r\n* Created new package __CommonTools/MVAUtils__ to resolve cyclic dependencies which houses:\r\n  * The new `GBRForestTools` which set up a GBRForest from (gzipped) XML files by parsing it with __tinyxml2__\r\n  * `GBRForestWriter` to read GBRForests from DB (previously in __CommonTools/Utils__)\r\n  * `TMVAEvaluator` and `TMVAZipReader` (previously in __CommonTools/Utils__)\r\n* Clean up of MVA related code in `PFEgammaAlgo`\r\n* Changed all CMSSW code which uses GBRForests to make use of this new infrastructure.\r\n* External PR https://github.com/cms-sw/cmsdist/pull/4332 translates old text-based weights files to XML format such that the new `GBRForestTools` can use them\r\n\r\n## Original Message\r\n\r\nHi all,\r\n\r\nrecently I re-implemented the GBRForest/GBRTree for a few reasons:\r\n\r\n1) Unexpected behaviour with large weight files [1]\r\n3) Could only be constructed from TMVA readers, which need quite some boilerplate code to set up\r\n2) TMVA is a very heavy dependency\r\n\r\nReason 1. triggered my work here, because my Bayesian optimization studies for the electron ID resulted in > 20 MB weight files which I could not readily use with the current implementation.\r\n\r\nI don't know if you want to merge it to master, but at least it would be nice to get it tested once at least so I feel confident in the results of my private studies where I use this implementation. But the bigger weight files will come sooner or later also to CMSSW :-)\r\n\r\nNotes:\r\n* The implementation relies on tinyxml2 [2]. Tinyxml 1 is in the cmsdist, but it would be nice to also have a recent version. For now, I just copy-pasted the tinyxml2 source code but it would be nicer to have it in the build configuration.\r\n* I could not add new data members to the GBRForest, because that would break the de-serialization of old GBRForests. I would have liked to, e.g. to store the variable names, but it's OK like this. Users who want to get the variable names can just pass a string vector to the constructor and they get stored there.\r\n* I could not reuse the `readGzipFile` function in __CommonTools/Utils__ [3], because adding that package to the BuildFile of __CondFormats/EgammaObjects__ would introduce a cyclic dependency. It's maybe not optimal that CommonTools/Utils houses both really low-level functionality like the reading of gzip files and higher level business that requires GBRForests itself.\r\n* In PFProducer, there were really old TMVA weight files in the old .txt format [4]. To read them with the new GBRForest, I had to port them to the newer XML format for which I wrote a little tool [5]. The converted XML files are shipped with this PR, but if we should actually merge this there should be probably a separate PR for cms-data [4].\r\n* All the code touched in this PR is actually run in the RelVal tests, which is nice.\r\n* No changes expected; purely technical.\r\n\r\nCheers,\r\nJonas\r\n\r\n[1] https://github.com/cms-sw/cmssw/issues/24395\r\n[2] https://github.com/leethomason/tinyxml2\r\n[3] https://github.com/cms-sw/cmssw/blob/master/CommonTools/Utils/src/TMVAZipReader.cc#L21\r\n[4] https://github.com/cms-data/RecoParticleFlow-PFProducer\r\n[5] https://gist.github.com/guitargeek/a00c86ffd697c8c8aac5e6797a352a3c\r\n", "branch": "master", "changed_files": 84, "closed_at": "1540975336", "comments": 224, "commits": 19, "created_at": "1535741219", "deletions": 1810, "labels": ["alca-pending", "analysis-pending", "code-checks-approved", "comparison-available", "db-approved", "l1-approved", "orp-approved", "pending-signatures", "reconstruction-approved", "requires-external", "tests-approved", "upgrade-approved"], "merge_commit_sha": "985cd27a03c4b278121c8b4fa66871a07f1f47ef", "merged_at": "1540975336", "merged_by": "cmsbuild", "milestone": "CMSSW_10_4_X", "number": 24432, "release-notes": [], "review_comments": 45, "state": "closed", "title": "GBRForest implementation without TMVA", "updated_at": "1540975336", "user": "guitargeek"}