{"additions": 779, "auther_ref": "ChrisSPhase2EcalRecoGPU", "auther_sha": "50eca144f8030043955f2540e972e2c8437608f4", "author": "ChrisSandever", "body": "#### PR description:\r\n\r\nThis PR contains two extra modules in RecoLocalCalo/EcalRecProducers for the ECAL reconstruction on GPU for the Phase 2 upgrade. It modifies 2 other modules with no effect on phase 1 operation. \r\nThe new modules are producers, the first of which is a data format converter, which converts phase 2 digis to SoA digis copied onto the GPU device. The other modules is a producer that produces UncalibratedRecHits by reconstructing the amplitudes using the weights method of reconstruction. It is Phase 2 compatible and does the reconstruction on a GPU.\r\nThere is an existing module that produces UncalibratedRecHits with the same method for Phase 2 executing the reconstruction on CPU. The UncalibratedRecHits from both modules are virtually identical. Furthermore, the CUDADataFormats/EcalRecHitSoA/interface/EcalUncalibratedRecHit.h data format has been modified to include the AmplitudeError variable to be compatible with the CPU data format.\r\nA switch producer has been added to the phase 2 configuration to be able to run the CPU and GPU algorithms.\r\n\r\n#### PR validation:\r\n\r\nThe PR passed scram b -tests and runTheMatrix.py -l limited -i all --ibeos.\r\nThe configuration was tested with ECAL Phase 2 WF 28234.61.\r\nBy adding the gpu modifier to the reconstruction step of WF 28234.61 the GPU branch of the switch producer has been tested.\r\nThe UncalibratedRecHits are equivalent for all variables between the CPU and GPU reconstructions.\r\nThe timings of the CPU and GPU algorithms have been compared and are similar.\r\n", "branch": "master", "changed_files": 14, "comments": 47, "commits": 23, "created_at": "1650990092", "deletions": 70, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending", "heterogeneous-pending", "ecal"], "milestone": "CMSSW_12_5_X", "number": 37695, "release-notes": [], "review_comments": 40, "state": "open", "title": "ECAL Phase 2 weights method amplitude reconstruction on GPU", "updated_at": "1655920117", "user": "ChrisSandever"}