{"additions": 22, "auther_ref": "ruben-FixDisplacedFilter-CMSSW_13_1_0_pre2", "auther_sha": "e1e435aa1b1eafb1e42e4bfa209c0ed276527349", "author": "24LopezR", "body": "#### PR description:\r\n\r\nThis PR intends to fix an unexpected behavior observed when validating the performance of the slimmedDisplacedMuons collection in MiniAOD samples. \r\nThe issue consists in a bad filtering of highly displaced muons caused by the definition of muon.numberOfMatches(), which was proved to not be appropriate to effectively select displaced muons when no tracker track is reconstructed.\r\nThe fix in this PR proposes to change this variable for another one. Now, the segments of the track are counted through the reco::Track object itself, which yields a more accurate description of the standalone muon track properties. \r\nThis issue was reported to and discussed with the MUO POG, a detailed description can be found at:\r\nhttps://indico.cern.ch/event/1263952/ (\"Update on displaced muon collection performance studies\").\r\n\r\nMuon number expected to increase in muons from the slimmedDisplacedMuons collection which are not .isGlobal() nor .isTracker() in high displaced signals e.g DisplacedSUSY and Cosmics. These muons are not expected to change in prompt signals except for some small fluctuations. Standard muons should not be affected in any way.\r\n\r\nThe fix has been checked to work properly in cosmics data and H->SS MC signal (higher and lower displacement). \r\n\r\nSee attached plot for a comparison of muon $d_{xy}$ distribution for a highly displaced H->SS signal (ctau=4000mm) between the old filter (red) and the fix in this PR (blue).\r\n![HTo2LongLived_400_150_4000_h_dxy](https://user-images.githubusercontent.com/68101581/235872960-d5666d03-63d1-49bd-80fb-f9309f479912.png)\r\n\r\nOther authors: @CeliaFernandez  \r\n\r\n#### PR validation:\r\n\r\nThe code changes have passed all standard runTheMatrix test workflows.\r\nNo significant increase in size of MiniAOD is expected (tested on ttbar workflow 11834.21)\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nWe would like to have this also backported to 13_0_0.\r\n", "branch": "master", "changed_files": 1, "closed_at": "1683811766", "comments": 16, "commits": 2, "created_at": "1683097507", "deletions": 2, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "xpog-approved", "muon"], "merge_commit_sha": "f783f5db07e309fd7fa6c05798a7d278de3af793", "merged_at": "1683811766", "merged_by": "cmsbuild", "milestone": "CMSSW_13_2_X", "number": 41496, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Change from numberOfMatches() to segment number in DisplacedMuonFilterProducer", "updated_at": "1683811766", "user": "24LopezR"}