{"additions": 1485, "auther_ref": "new_pixel_fastsim_94X", "auther_sha": "34931aeb0f02c05ac2929de4bacbf9311c19281b", "author": "pmaksim1", "body": "This is a backport of the new pixel RecHit infrastructure (#23799) for 94X. It contains:\r\n\r\n- pixel RecHit smearing code has been completely rewritten, in order to make it more maintainable, and extensible to other geometries. (The old code assumed a lot of things about the Phase 0 geometry, whereas the new code pushes all physics / geometry issues to pixel template object and the resolution histograms.)\r\n\r\n- the pixel resolution histograms are now separated for each type of pixel RecHit (regular vs cluster-on-edge vs cluster-with-big-pixel) as well as for each DetUnit with a specific orientation of local B field (since that determines the drift). Thus, a pixel template matches each pixel resolution histogram file.  [This is very important for Phase 1 Forward, since the blades are tilted about both axes, and thus the angles are different from Phase 0 geometry.]\r\n\r\n- pixel templates are loaded from the DB.\r\n\r\n- the current code is essentially completely generic, and will work for Phase2 as well.  (Provided that the proper resolution files are provided.)\r\n\r\nNote that the hit merging is still off. Its effects have not been studied well enough to turn it on at this time.\r\n", "branch": "CMSSW_9_4_X", "changed_files": 14, "closed_at": "1538399178", "comments": 21, "commits": 2, "created_at": "1538268057", "deletions": 568, "labels": ["comparison-available", "fastsim-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "f714f3c6e0720fe6e046acb6339440a2acf332e1", "merged_at": "1538399178", "merged_by": "cmsbuild", "milestone": "CMSSW_9_4_X", "number": 24764, "release-notes": [], "review_comments": 0, "state": "closed", "title": "New pixel RecHit infrastructure for FastSim (for Phases 0, 1, 2, and beyond), backport of ##23799 for 94X ", "updated_at": "1538399178", "user": "pmaksim1"}