{"additions": 323, "auther_ref": "CMSSW_12_4_0_pre2_deepMET_SONIC", "auther_sha": "dab4965aec74ae1120084d35227ab0ec9932a8c7", "author": "wpmccormack", "body": "#### PR description:\r\n\r\nThis PR introduces a producer for DeepMET using SONIC for co-processor-enabled inferences-as-a-service.  For more information on the status of SONIC, please refer to this presentation to JetMET DPG: https://indico.cern.ch/event/1143469/contributions/4799423/attachments/2416540/4135308/March_28_JetMET_SONIC.pdf.  Please note that the producer introduced here _does not_ affect the main DeepMET producer in any way.  This is an _alternate_ way to run the standard DeepMET model using inference as a service.  As noted in the linked slides, this producer has been validated locally on Tier 2 resources and at scale with cloud computing, but with this PR, we hope to perform more \"official\" production tests.  But again, this producer does not any workflow unless explicitly called.  A helper-function macro is slightly modified, as are a few config files.  There will be an accompanying PR into https://github.com/cms-data/RecoMET-METPUSubtraction, which adds needed model files.\r\n\r\nTagging @kpedro88 @yongbinfeng @violatingcp @nhanvtran @jmduarte\r\n\r\n#### PR validation:\r\n\r\nThis PR was tested on LPC using a Triton server running on the GPU-enabled AILab machines at FermiLab.  Tests have also been performed using the DeepMET SONIC producer at Purdue T2 and in Google Cloud.  When the producer is not called, there is no performance impact, and when it is called, the MET results are the same as for the generic DeepMET producer.", "branch": "master", "changed_files": 12, "comments": 100, "commits": 15, "created_at": "1652708303", "deletions": 41, "labels": ["operations-pending", "reconstruction-approved", "pending-signatures", "tests-approved", "orp-pending", "requires-external", "code-checks-approved", "xpog-approved", "jetmet-pog-approved", "jetmet"], "milestone": "CMSSW_12_5_X", "number": 37963, "release-notes": [], "review_comments": 17, "state": "open", "title": "Adding DeepMET SONIC Producer to CMSSW", "updated_at": "1655576617", "user": "wpmccormack"}