{"additions": 331, "auther_ref": "Phase2-hgx321", "auther_sha": "5729689e319c3d8f947d583998638b2286945865", "author": "bsunanda", "body": "#### PR description:\r\n\r\nMake some fixes to the issues in storing hits for the scintillator part of HGCal. \r\n\r\nIn the process of debugging the SimHits for scintillators, several hit id's were found to be declared to be invalid. This was traced down to wrong assignment of the ID's from position. Most likely while introducing the cassette concept, the conversion between SIM/RECO unit was disturbed. That led to wrong assignment of DetId's. This is cured by this PR. In the process, possible shifts due to cassette positioning etc are rightly handled now. Most of the codes are used for debugging while a very small fraction is used in the fix.\r\n\r\nSince it is a bug fix the comparison plots for many phase2 scenarios will look different\r\n\r\n#### PR validation:\r\n\r\nUse several phase2 runTheMatrix test workflows\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\n<!-- Please replace this text with any link to the master PR, or the intended backport release cycle numbers -->\r\n\r\nShould be backported to 12_4_X if any MC production for Phase2 scenario will be done using that", "branch": "master", "changed_files": 16, "closed_at": "1661265081", "comments": 27, "commits": 3, "created_at": "1661066861", "deletions": 52, "labels": ["geometry-approved", "simulation-approved", "fully-signed", "tests-approved", "orp-approved", "upgrade-approved", "code-checks-approved", "hgcal-dpg-approved"], "merge_commit_sha": "ee0b0bae050352b3f8194ec1b9f88d5620876294", "merged_at": "1661265081", "merged_by": "cmsbuild", "milestone": "CMSSW_12_5_X", "number": 39130, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Phase2-hgx321 Make some fixes to the issues in storing hits for the scintillator part of HGCal", "updated_at": "1661265081", "user": "bsunanda"}