{"additions": 7, "auther_ref": "fc-fixVtxTrkSel20240618-141X", "auther_sha": "e2a141215b12f21f162d5cd88855606239017cdc", "author": "fabiocos", "body": "#### PR description:\r\n\r\nThis PR proposes two fixes and one update to the reconstruction code, related to the use of MTD time information.\r\n\r\n1. https://github.com/cms-sw/cmssw/pull/44562 propagated the momentum uncertainty to the estimated time-of-flight for a track, and therefore to the uncertainty of time at the PCA. In doing this, the ``safe`` version provided by ```TOFPIDProducer``` was updated, but the best option, then propagated to the PF candidates, missed the corresponding update. This PR adds such update. The impact is marginal, as can be seen from a test on 100 ttbar events + PU:\r\n\r\n![MTD__Tracks_TrackSigmat0Pid](https://github.com/cms-sw/cmssw/assets/4058194/f00aa6f5-5494-4df8-a747-5a2a13e1143d)\r\n\r\n2. In the update of the vertex reconstruction code for time use, made in https://github.com/cms-sw/cmssw/pull/43592 , transient tracks were provided with time and time uncertainty information. When this information is not available (negative time uncertainty) or the MVA quality selection is used, and failed (off by default), the uncertainty is moved to a constant large value of 350 ps, set as constexpr in ```TransientTrack:: defaultInvalidTrackTimeReso```. These values are checked both in the DA clustering where time is used, and later in the legacy vertex time calculation, to prevent the use of such tracks. But the test is at present requiring a value larger than the constant, while it should be larger of equal the constant. The main impact of such an issue is to use tracks without time information in the clustering with time 0 and a 350 ps uncertainty. From, a test on 100 ttbar events + PU the consequences look minor on validation plot, one of the possibly most interesting changes is in the distribution of vertex times, which loses a funny spike at zero:\r\n\r\n![MTD__Vertices_recPVT](https://github.com/cms-sw/cmssw/assets/4058194/f8d0fa01-df2e-4f6f-8756-22ced9d539b8)\r\n\r\n3. @noepalm recently showed at the MTD DPG meeting https://indico.cern.ch/event/1418042/contributions/5972640/attachments/2868431/5021447/Palmeri_MTD_DPG_310524.pdf that the estimate of vertex time with the DA algorithm ```fromTracksPID```, applied so far only to 3D vertices, is improving also the vertex resolution and pull distributions for 4D vertices (second iteration in the 3Dt + 4D chain), when replacing the legacy weighted average approach. This PR proposes such an update in the official workflow.\r\n\r\n#### PR validation:\r\n\r\nTests where performed by rerunning the reconstruction step for the  CMSSW_14_1_0_pre4 D110 ttbar + PU200 RelVal on top of the available GEN-SIM-DIGI-RAW sample (100 events).", "branch": "master", "changed_files": 4, "comments": 3, "commits": 1, "created_at": "1718889236", "deletions": 4, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "upgrade-pending", "code-checks-pending", "tracking", "mtd"], "milestone": "CMSSW_14_1_X", "number": 45279, "release-notes": [], "review_comments": 0, "state": "open", "title": "Use of MTD time in reconstruction: fixes and update", "updated_at": "1718889289", "user": "fabiocos"}