{"additions": 801, "auther_ref": "addSiStripCalCosmicsNano_121pre1", "auther_sha": "c52defb96dd625233f218921184017b1fed4e195", "author": "pieterdavid", "body": "#### PR description:\r\n\r\nThis PR adds NanoAOD-style output for the SiStripCalCosmics ALCARECO (introduced in https://github.com/cms-sw/cmssw/pull/26032), based on the existing configuration (which was run by the DPG) to make flat trees for the Lorentz angle and backplane correction measurement, and taking advantage of the changes in https://github.com/cms-sw/cmssw/pull/33565 .\r\nThe code adds a plugin for per-run per-module information about the magnetic field etc., uses a `SimpleFlatTableProducer` for per-track information, and adds a plugin that stores the necessary per-cluster information (split in a base class that gets the clusters, and a subclass that stores the variables for the Lorentz angle and backplane correction - another subclass will be used for the gains tree).\r\nThis is a very small ALCARECO, so the size is small in both cases (the flat format is about the same size as the EDM format), but it has been extensively validated, and provides an interesting case to discuss the configuration and possibility of central production.\r\nAs a minimal solution to add this to cmsDriver I added a `SiStripCalCosmicsNano` ALCARECO based on the existing `SiStripCalCosmics`, and changed the code to insert a `NanoAODOutputModule` if the dataTier of a FilteredStream is NANOAOD. That seems to work (it can be tested with the `ALCA:SiStripCalCosmicsNano` step, which is also added to the relevant matrix workflows by this PR), but something less ad-hoc may be preferred - please provide input, this is the reason why the PR is marked as \"work in progress\".\r\nThe idea (discussed with XPOG) is to have this integrated for testing at T0 with CRAFT in October, so depending on if that works out and which release is used there, a backport to the 12_0 branch may be needed.\r\n\r\n#### PR validation:\r\n\r\nEvent-by-event comparison for 2018 cosmics by @robervalwalsh , see [these slides](https://indico.cern.ch/event/992968/contributions/4424055/attachments/2270726/3856338/20210624_NanoAOD_CalibTrees.pdf)\r\n\r\nCC: @robervalwalsh @mdelcourt @ataliercio @jandrejk @mmusich @tsusa @mariadalfonso @gouskos ", "branch": "master", "changed_files": 16, "closed_at": "1631661780", "comments": 35, "commits": 8, "created_at": "1629728796", "deletions": 152, "labels": ["alca-approved", "operations-approved", "fully-signed", "tests-approved", "pdmv-approved", "orp-approved", "upgrade-approved", "code-checks-approved", "xpog-approved"], "merge_commit_sha": "9624bb7563907e344872c9504a8bb5d36111c885", "merged_at": "1631661780", "merged_by": "cmsbuild", "milestone": "CMSSW_12_1_X", "number": 34985, "release-notes": [], "review_comments": 4, "state": "closed", "title": "Add SiStripCalCosmics ALCANANO", "updated_at": "1631661781", "user": "pieterdavid"}