{"additions": 2840, "auther_ref": "hgcal-emul_and_unpacker-13_1_X", "auther_sha": "1f328e10a04e51a654344b2ea945efa542fbe398", "author": "forthommel", "body": "#### PR description:\r\n\r\nThis PR introduces an unpacker module+algorithm for HGCal. It provides the missing link between the S-link frames cast into FED raw data and the digis collection already introduced since #38538, and allows future developments for the validation of the whole transmission chain.\r\n\r\nAs a way to test this unpacking, a full frame emulator is also provided along this PR. It allows the emulation of S-link, capture block, and ECON-D level payloads to be fed to the unpacker to simulate various boundary conditions. It can recast either realistic frames collected in lab/test beam, or fully \"trivial\" channels content containing the minimal information possible. Along with this emulation, a few metadata objects are introduced for future in-depth validations, when the error handling of the unpacker will be improved.\r\n\r\nVarious tests, defined along with the DPG (see e.g. [this presentation from 12.04](https://indico.cern.ch/event/1274686/contributions/5353145)) are introduced as \"unit tests\", and allow these boundary conditions checks to be performed.\r\n\r\nA few `const`-qualification of the main data formats were introduced, possibly for the thread safety of some of these tests.\r\n\r\nBeside the long development history leading to this PR, it only contains a limited (although >1) number of commits to reflect the various contributions from the experts involved (@pfs, @yulunmiao).\r\n\r\n#### PR validation:\r\n\r\nThis PR is relatively orthogonal to all parts of the validation suite, and only a limited, but successful `runTheMatrix.py` run was performed. As mentioned above, a few unit tests are introduced along with these two components. These can be steered through the standard `scram b runtests`.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for: N/A", "branch": "master", "changed_files": 31, "comments": 17, "commits": 7, "created_at": "1682692132", "deletions": 27, "labels": ["reconstruction-approved", "simulation-approved", "pending-signatures", "tests-approved", "orp-pending", "upgrade-pending", "code-checks-approved"], "milestone": "CMSSW_13_2_X", "number": 41461, "release-notes": [], "review_comments": 4, "state": "open", "title": "HGCal emulator and unpacker", "updated_at": "1684774111", "user": "forthommel"}