{"additions": 3076, "auther_ref": "CMSSW_8_0_X_tau-pog_miniAOD-backport", "auther_sha": "f212de740c21cbcd562f1d9cf34927e2f08c6f49", "author": "cms-tau-pog", "body": "Dear colleagues, \r\nthis is a 1:1 backport of the work we have invested last autumn to provide access to tau-ID and electron discrimination on miniAOD in 81X. The relevant PRs have been:\r\n\r\n * https://github.com/cms-sw/cmssw/pull/15731\r\n * https://github.com/cms-sw/cmssw/pull/15747\r\n * https://github.com/cms-sw/cmssw/pull/15758\r\n * https://github.com/cms-sw/cmssw/pull/15995\r\n * https://github.com/cms-sw/cmssw/pull/16030\r\n\r\nBy that time we had no chance to get these developments backported in time to the 80X release series and had announced that we would like to do this once we are set. We have now prepared the first case where tau-ID and electron-discrimination have indeed been produced and can be applied to analyses based only on miniAOD information! This has been provided for the upcoming analyses of this year. It is consequently done in 80X. \r\n\r\nThe backport introduces necessary additional contents in a few tau-specific DataFormats. No existing contents or members are changed or removed. In standard workflows there is no access to the newly added data members, so the backport does not change standard reconstruction behaviour. It only allows that existing training files may also be accessed from miniAOD in addition to the unchanged standard access from AOD. This project is of great importance for the flexibility of tau analyses in 2016. \r\n\r\nSince only information is added we do not expect any change of the default reconstruction behaviour (see discussion of 81X pull requests). We have made the standard tests that we usually do in preparation of our pull requests to verify that this is the case. The additional features have also been successfully tested with unit-tests that had been introduced by the time of the original pull requests to 81X (and backported accordingly). In addition the whole infrastructure has already been used for the production and extensive validation of new MVA weight files, and their application. A detailed report is planed by Alexander Nehrkorn for the TauPOG meeting during the upcoming CMS week. \r\n\r\nA small set of modifications on top of this pull request (which is a plain backport as said) would follow to give official access to the new weight files, most probably also related to a new Global Tag request. We would highly appreciate if these modifications could make it into a new 80X analysis release if possible. I'm happy to give a report or just to drop a few words of further clarification during the RECO/AT meeting tomorrow. You can put me on the agenda and let me know in case. \r\n\r\nCheers,\r\nRoger", "branch": "CMSSW_8_0_X", "changed_files": 33, "closed_at": "1491455098", "comments": 29, "commits": 7, "created_at": "1485427650", "deletions": 250, "labels": ["analysis-pending", "comparison-available", "hold", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "f048a8e5e662d42fad28ddd95e947920158bd28d", "merged_at": "1491455098", "merged_by": "davidlange6", "milestone": "CMSSW_8_0_X", "number": 17292, "release-notes": [], "review_comments": 10, "state": "closed", "title": "Backport of access to tauID and electron discrimination from miniAOD", "updated_at": "1511441607", "user": "roger-wolf"}