{"additions": 838, "auther_ref": "CSC_Run3_Unpacking_CMSSW_12_4_X", "auther_sha": "881d1c2c738f419172b3b8ba2e0dc072e8ed7d8d", "author": "barvic", "body": "#### PR description:\r\nCSC Run3 data format unpacking/packing update towards Run3 operation:\r\n- based on most recent data format changes from November/December, 2021. \r\n- based on data samples from OTMB/ALCT firmware testing at b904 for MEx1, ME11+GEM in March, 2022. \r\n- current production firmware versions are prepared for loading to MEx1, ME11 chambers at P5 and would awaits validation at P5\r\n- includes support of changes for ALCT fw data format (addition of anode HMT/Shower bits per ALCT bx). Changes for CSCDCCExaminer data consistency examiner and for ALCT data classes. Crucial to add to prevent events data format errors during unpacking with enabled ALCT anode HMT/Shower logic.\r\n- includes support of changes for OTMB MEx1, ME11 fw data format (addition of separate anode and cathode HMT/Shower bits). Changes for OTMB2020 GEM and CCLUT data classes.\r\n- added data packing capabilities for GEM PadClusters trigger data (to OTMB data). Changes to CSCGEMData class\r\n- added data packing capabilities for additional CSCShower/HMT bits (ALCT anodeHMT bits, OTMB anode, cathode HMT bits). Changes for ALCT, OTMB2020, CSCDigiToRaw classes\r\n- enables by default unpacking of GEM, CSCShowers objects (CSCDCCUnpacker)\r\n\r\nNOTE:\r\nSupport unpacking of copper TMB firmware Run3 data format is still needed.\r\nIt depends on the firmware availability (due to old TMB FPGA hardware with limited resources it is still difficult for fw developers to implement Run3 features for it)\r\nIn this update the unpacking assumes that updated copper TMB fw data format would be similar to Run3 MEx1 OTMB2020 CCLUT fw Run3 data format. \r\n\r\n#### PR validation:\r\nCurrent set of validation done:\r\n- based on available data samples from b904 test setups (single MEx1, ME11+GEM chambers with updated OTMB/ALCT fw)\r\n- data unpacking consistency checked with CSC DQM (local and private branch of CMSSW CSC DQM)\r\n- repacking of unpacked real data was checked with data samples for MEx1 and ME11/GEM data from test setups\r\n- additional packing tests would need further discussions with CSC DPG (packing, simulation)\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\nBackports to CMSSW_12_3_X, CMSSW_12_2_X if still possible?\r\n\r\n", "branch": "master", "changed_files": 40, "comments": 31, "commits": 6, "created_at": "1647650979", "deletions": 191, "labels": ["reconstruction-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_12_4_X", "number": 37279, "release-notes": [], "review_comments": 18, "state": "open", "title": "CSC Run3 data format unpacking/packing update (12_4_X)", "updated_at": "1648865685", "user": "barvic"}