{"additions": 61, "auther_ref": "SecondaryInputSourceFixes", "auther_sha": "682c1743fd1bc8a7f5aa784dd718543a4a4b2cd1", "author": "wmtan", "body": "This PR makes several improvements/fixes to the secondary input source.\n1) In \"sequential\" mode (referred to as \"deterministic\" mode by WMAgent), the skipEvents parameter is currently  ignored silently.  This PR implements the initial skipping of events if this parameter is non-zero.\n2) In sequential mode, the secondary source currently will not return any more events after the last event in the last file specified.  This PR implements looping back to the beginning of the first file.\n3) The secondary input source opens a random input file in its ctor.  The random number seed uses getpid() to determine the seed.  Brian Bockelman pointed out that getpid() is deterministic at some sites.  This PR replaces the use of getpid() with /dev/urandom to determine the seed.  Note that linux and OSX both support /dev/urandom.\n4) When the randomization of the first input file was implemented, a bug was introduced in sequential mode such that the sequence of events began with the randomly chosen file, rather than the first file.\nThis bug is fixed by the same change that implements 1).\nNote that 1), and possibly 2), are needed by any reasonable deterministic scheme to avoid duplication of premixed pileup.\n5) The secondary input source unit tests are enhanced to test that the skipEvents parameter is working correctly.\n", "branch": "CMSSW_7_5_X", "changed_files": 5, "closed_at": "1431755261", "comments": 23, "commits": 1, "created_at": "1431619326", "deletions": 13, "labels": ["comparison-available", "core-approved", "fully-signed", "tests-approved"], "merge_commit_sha": "80c5910850abb28429b7ed8f940d7da46ca5e759", "merged_at": "1431755261", "merged_by": "cmsbuild", "milestone": "CMSSW_7_5_X", "number": 9091, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Secondary input source improvements/fixes", "updated_at": "1431968043", "user": "wmtan"}