{"additions": 31, "auther_ref": "from-CMSSW_10_1_0_pre1", "auther_sha": "4cb8ca24993c06bf4dab95b4926241171735b4af", "author": "hvanhaev", "body": "This pull request contains updates for CASTOR reconstruction and simulation.\r\nAfter integration of this in master, the request is that these changes are also allowed to be back ported to the 76X and 80X branches for use with 2015 and 2016 data.\r\n\r\nReconstruction:\r\n* Fix of RecHitCorrector class: \r\n   - this class is not used during default reconstruction sequence, but it is important for analyses, as it can very easily reprocess CASTOR objects on the fly during ntuple steps. \r\n   - the code is updated with: memory leak fix, removal of obsolete factor 2, cleaning up code following comments from a previous PR (https://github.com/cms-sw/cmssw/pull/21860#issuecomment-357963218). \r\n   - I tried to replace the for loops with range-based for loop, but could not figure it out for the line \"for (unsigned int i=0;i<rechits->size();i++)\". If someone can provide an alternative for this then please let me know.\r\n\r\nSimulation:\r\n* A long time ago we discovered a small bug in the CASTOR noise addition (during digi step), which would overestimate the noise, especially in case of pA and AA collisions. Now finally I managed to prepare the code for submission. This change has already been validated within CASTOR group. These classes are used during production whenever the CASTOR simulation is executed/included in the config.", "branch": "master", "changed_files": 5, "closed_at": "1523338894", "comments": 45, "commits": 4, "created_at": "1520001973", "deletions": 88, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "b850be4c469c8627059682650bac4b6473f79bbb", "merged_at": "1523338894", "merged_by": "cmsbuild", "milestone": "CMSSW_10_2_X", "number": 22424, "release-notes": [], "review_comments": 2, "state": "closed", "title": "CASTOR reconstruction and simulation updates", "updated_at": "1523338894", "user": "hvanhaev"}