{"additions": 1867, "auther_ref": "HLTGenValidation", "auther_sha": "f58997d1e82ce3fe7217997f710906b4000a62c3", "author": "finnlabe", "body": "#### PR description:\r\n\r\nThis PR adds a validation module that produces trigger efficiency histograms as function of generator-level particle properties. It will be used to get a generic, very quick and easy look at the HLT output to check if any new release or change to the HLT introduced issues. Information on the module is gathered in [this Twiki page](https://twiki.cern.ch/twiki/bin/view/CMS/WebBasedHLTValidation). \r\n\r\nTwo modules are included, the `HLTGenValSource` which produces histograms before and after trigger filter application, and a `HLTGenValClient` module, creating efficiency histograms from the sources outputs.\r\n\r\nThe module is standalone, should not change any other unrelated modules and does not rely on external code or other PRs. Development has happened within the STEAM subgroup of the TSG, overseen by @Sam-Harper and Lisa Benato. Aside from the other required review steps, the module is still awaiting review by the TSG experts, including Sam.\r\n\r\n#### PR validation:\r\n\r\nThe code and its outputs have been tested offline. Additionally, the steps described in the [Workflow for pull requests to CMSSW](http://cms-sw.github.io/PRWorkflow.html) document were performed and the code should hopefully be readable and fulfill the CMS coding requirements - if not I'd be happy to make any required changes.\r\n\r\nThe PR is targeting to be included in the next possible release.\r\n", "branch": "master", "changed_files": 13, "closed_at": "1661793435", "comments": 31, "commits": 10, "created_at": "1656938699", "deletions": 0, "labels": ["dqm-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "a6ce3a201c90acb639b2e5158106fa6681f36bcd", "merged_at": "1661793435", "merged_by": "cmsbuild", "milestone": "CMSSW_12_6_X", "number": 38593, "release-notes": [], "review_comments": 27, "state": "closed", "title": "Hlt gen validation", "updated_at": "1661793436", "user": "finnlabe"}