{"additions": 3912, "auther_ref": "RestoreFEDErrorTreatmentForPhase0", "auther_sha": "d8401191e5014e55a869f14ea8702ccf11cdc6d8", "author": "veszpv", "body": "#### PR description:\r\n\r\nThe FED raw data format for phase 0 and phase 1 detectors are essentially the same with small differences for the bit-packing of the pixel hit information in layer 1. There is a difference also in the error assignment by the front-end (*). The former case has been treated in the PixelDataFormatter by setting the 'phase1' variable through python configuration files. The error decoding class, called ErrorChecker, however was not made aware of the difference, instead, was just simply updated to phase 1. \r\nThis PR fixes that: a base class is defined for the ErrorChecker, the present default code is kept with the same name deriving from this base, and a new derived class ErrorCheckerPhase0 is introduced to restore the phase 0 treatment. The proper error checker is instantiated by the PixelDataFormatter based on the value of 'phase1', so no change needs to be made in the python configurations.\r\n\r\nFED error 25: in phase 1, FED error type 25 has been reinterpreted and used by the FED firmware to signal \"dead\" links. It is used to flag stuck TBMs. This error has a totally different meaning in phase 0. In this PR, the special treatment of this error type by raw-to-digi and digi-to-raw is cancelled for phase 0. \r\n\r\n(*) Few error codes have different interpretation; and in phase 0 FPix, the error association with detId is ambiguous. \r\n\r\n#### PR validation:\r\n\r\nDuring the reconstruction of phase 0 data, when a rare type 25 error was encountered, the tracking code crashed. This PR fixes that. The FED25 error packing in simulation, and unpacking in simulation and data for phase 1 should be unchanged, are being validated by @tsusa. \r\n\r\n@tsusa @mmusich @dkotlins ", "branch": "master", "changed_files": 15, "closed_at": "1557211195", "comments": 17, "commits": 8, "created_at": "1556883142", "deletions": 2890, "labels": ["code-checks-approved", "comparison-available", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-approved"], "milestone": "CMSSW_10_6_X", "number": 26606, "release-notes": [], "review_comments": 35, "state": "closed", "title": "Restore FED error treatment for phase0 (required for UL Rereco of 2016)", "updated_at": "1557211196", "user": "veszpv"}