{"additions": 42, "auther_ref": "clonewars", "auther_sha": "a85d0ce401eb6b6a2d77c442aadc9c6ff77a16bd", "author": "dmitrijus", "body": "Previously, DQMStore would implicitly create a number of TH1 copies:\n\n```\n  func DQMStore::mergeAndResetMEsRunSummaryCache:\n    ...\n    MonitorElement global_me(*i); <- constructor makes an internal copy of th1 (fixed: 1)\n    global_me.globalize()\n    ...\n    gme = data_.insert(global_me) <- insert calls the same copy constructor (fixed: 2)\n```\n\n  global_me is used as a key (in a set) to find an actual object to work on.\n  It is not used outside that and once the actual object is found,\n  global_me is just left to be destroyed at the end of the loop.\n\n  This is not a leak, but the TH1::Clone is just useless,\n  since the key comparison does not depend on it.\n\nSo I've implemented:\n1. Special tagged constructor which does not clone the internal th1 object,\n   and just sets it to nullptr (perfect for searching in a set).\n2. Special move constructor which will move the TH1 object.\n   The old object will have TH1 unset.\n   This makes std::set::insert not to make a clone of TH1 internally\n   when inserting a transient (on the stack) object.\n3. Disabled the assignment operator to avoid confusion/complexity.\n   It was never actually used and move-constructor is complex enough already.\n\nResult: running 25.0 (with 1000 events) on 8 threads:\n- ~300mb less memory (peak rss)\n- 60s faster (5%)\n\nThe code runs at end of the job, so in theory, the number of events does not matter.\nOnly the number of streams used (it shouldn't improve anything on a single stream job).\n\nPlease test before accepting, I am not that familiar with all the newest c++ stuff.\nI will also ask someone to review the code today.\n\nDmitrijus\n", "branch": "CMSSW_7_5_X", "changed_files": 3, "closed_at": "1432046113", "comments": 11, "commits": 2, "created_at": "1431477629", "deletions": 34, "labels": ["comparison-available", "dqm-approved", "fully-signed", "tests-approved"], "merge_commit_sha": "87596a02b4e660521b9f4948a11c5c06636ec3b3", "merged_at": "1432046113", "merged_by": "cmsbuild", "milestone": "CMSSW_7_5_X", "number": 9066, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Do less cloning of TH1 objects in the DQMStore.", "updated_at": "1432046113", "user": "dmitrijus"}