{"additions": 62, "auther_ref": "from-CMSSW_11_1_X_2020-04-03-1100", "auther_sha": "4516b9362b8d90e855dd5c0fffbdd6ac9c3f8c13", "author": "luigicalligaris", "body": "Change the PSet parameters in the DTCCablingMapProducer, so the user can choose to provide the elink and gbt ids, provide the gbt id and generate a dummy sequential elink id, or generate both\r\n\r\n#### PR description:\r\n\r\nFollowing feature request 29390 (https://github.com/cms-sw/cmssw/issues/29390) the producer code was changed, such that the user can choose three operating modes:\r\n\r\n- gbtlink id and elink id are provided in the csv\r\n- only gbtlink id is provided in the csv, the elink id is sequentially assigned dummy values to detectors as they are encountered in the same gbt id\r\n- both gbtlink id and elink id are sequentially assigned with dummy values\r\n\r\nThe parameter choosing the mode is implemented as a string, and the corresponding state flag is implemented as an int type (enum) for performance reasons.\r\n\r\nDue to the increased risk of the user choosing the wrong mode or column configuration, and due to the cryptic message resulting from an out-of-bound access to a vector when using operator[], bound checks have been activated replacing operator[] with at() \r\n\r\nNo other changes to the code were introduced, and the formatting style was kept the same.\r\nNo dependence on external PRs.\r\n\r\n#### PR validation:\r\n\r\nValidated on the DTC cabling map payload production, retrieve and dump PSets\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nNot a backport.", "branch": "master", "changed_files": 2, "closed_at": "1587365679", "comments": 38, "commits": 6, "created_at": "1586438359", "deletions": 33, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "86965c1df186334e1d0207b82add881e69e78f3d", "merged_at": "1587365679", "merged_by": "cmsbuild", "milestone": "CMSSW_11_1_X", "number": 29443, "release-notes": [], "review_comments": 6, "state": "closed", "title": "Add possibility to specify GBT Id only to DTC cabling map producer", "updated_at": "1587365680", "user": "luigicalligaris"}