{"additions": 410, "auther_ref": "mm_dev_DST_phase2_from_15_0_0_pre3", "auther_sha": "82f4c196ad2fa569bd217bf060a222ee12bb7c27", "author": "cms-ngt-hlt", "body": "#### PR description:\r\n\r\nThe NGT project aims to complement the HLT event filtering approach in the Phase-2 HLT farm by performing offline-like full event reconstruction. This approach goes beyond traditional event selection by adopting a \"scouting\"-like strategy, processing the full L1Accept input and producing a lightweight nanoAOD-like output format. More details on the NGT project's methodology can be found [here](https://indico.cern.ch/event/1495242/contributions/6298629/attachments/3000689/5287723/20250122_NGT_TSG%20.pdf).\r\n\r\n![image](https://github.com/user-attachments/assets/5118aa99-7045-478d-86a6-7bcd53a84978)\r\n\r\nThis PR introduces a new `NGTScouting` Phase-2 HLT menu, which runs a single `DST_PFScouting` path. This path performs full HLT event reconstruction without any HLT filtering, processing the entire set of events passing the logical OR of all available L1T seeds in the Phase-2 L1T reduced menu. The implementation serves as a foundational step towards creating a path that outputs the entire L1Accept bandwidth in `nanoAOD` format. The necessary infrastructure to finalize this output format will be addressed in a follow-up PR.\r\n\r\nFurthermore, this PR adds a new family of `runTheMatrix` workflows, identified by the .77 modifier, to facilitate testing of the `NGTScouting` menu. These workflows will enable comprehensive validation and performance checks, ensuring the new path operates as expected.\r\n\r\n#### PR validation:\r\n\r\nRun successfully the workflow: `runTheMatrix.py -l 29634.77 -t 4 -j 8`.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNot a backport, no backport needed.\r\n\r\nCc: @rovere", "branch": "master", "changed_files": 6, "comments": 3, "commits": 4, "created_at": "1740412268", "deletions": 2, "labels": ["hlt-pending", "pending-signatures", "tests-pending", "orp-pending", "pdmv-pending", "upgrade-pending", "code-checks-approved", "ngt"], "milestone": "CMSSW_15_1_X", "number": 47434, "release-notes": [], "review_comments": 0, "state": "open", "title": "[NGT] Add a novel `NGTScouting` Phase-2 HLT menu that runs a single \"scouting\"-like path on the whole L1Accept", "updated_at": "1740412384", "user": "mmusich"}