{"additions": 406, "auther_ref": "emptyPortableCollection", "auther_sha": "e4d2b5343f939259247ead48d68c9c2754724d23", "author": "makortel", "body": "#### PR description:\r\n\r\nThe HCAL CUDA->Alpaka porting work by @kakwok demonstrated bad behavior with default-constructed PortableCollection, so I added some tests to demonstrate those (at one point the HCAL work seemed to point to some strange behavior also for zero-sized PortableCollection, but I was not able to replicate that, and the strange behavior also didn't repeat later with the HCAL Alpaka code).\r\n\r\nA default-constructed PortableCollection is in a state where it has no buffer. The PortableCollection interface does not provide a way to check the state, and therefore a caller has no way to know if `PortableCollection::buffer()` leads to defined or undefined behavior (because [`std::optional<T>::operator*()` leads to undefined behavior if the `optional` does not contain value](https://en.cppreference.com/w/cpp/utility/optional/operator*)). This PR takes one attempt to add a function `PortableCollection::isValid()` that allows checking the validity, and adds `assert()`s to all accessors (plus `size()` to be able to access the SoA size without the `assert()`. I'm not sure if this the behavior we really want, but at least it is a starting point for a discussion.\r\n\r\nThe tests for 0-size SoA Layout and PortableCollection are for ensuring valid behavior when the SoA has also scalars in addition to columns. (and now I'm wondering what should be the behavior of a 0-size PortableCollection for a SoA that has only columns?)\r\n\r\nThe PortableObject and PortableMultiCollection should also be treated consistently, but I wanted to get feedback first on the direction we want to go first.\r\n\r\n#### PR validation:\r\n\r\nUnit tests pass\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nPossibly to be backported to 14_0_X", "branch": "master", "changed_files": 15, "comments": 19, "commits": 4, "created_at": "1713988289", "deletions": 37, "labels": ["reconstruction-pending", "core-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-rejected", "heterogeneous-pending", "trk"], "milestone": "CMSSW_14_2_X", "number": 44844, "release-notes": [], "review_comments": 8, "state": "open", "title": "[RFC] Add tests and rudimentary protections for default-constructed PortableCollections", "updated_at": "1725307657", "user": "makortel"}