{"additions": 12068, "auther_ref": "pfcluster_rebuild", "auther_sha": "14f8a818695ca376b171abb9703975d5aef6eaea", "author": "lgray", "body": "Built on top of CMSSW_7_1_X_2014-03-05-0200.\nFor testing on top of pre3 use the branch: pfcluster_rebuild_onpre3.\n\nThis PR is a complete rewrite of PFRecHit and PFCluster Producers/Algos.\nThe rewrite focuses on making the clustering and rechit building modular and easy to adapt to using new detector information.\n\nNOTE: PFRootEvent is removed from the release, it is likely to come back in some form later.\n\nExpected changes:\n- Timing improvements to PFRecHit and PFCluster producers across the board \n  - Some large, esp. preshower rechits\n- Changes per-cluster in energy and position assignment in some small cases where we have corrected the navigation topology. ECAL and HCAL are affected here.\n  - Previously it was sometimes the case that a was 'a' neighbor of 'b' but 'b' was not of 'a' in ecal endcap.\n  - We no longer use the CaloTower det ID navigation, this causes some churn in the HCAL clusters.\n- Some very minor churn (one in few million clusters) for HO/HF/Preshower from fast_log / fast_expf\n- Churn in Jet and MET responses per-event due to cluster changes, but no change in the resulting distribution Mean/RMS/Tails.\n\nAdditional comments from Michalis (reproduced up here to pull everything together):\n- Also let me comment that the (almost transient) PF DataFormats on RecHits and Clusters have been changed to accomodate the new changes. Since they didnt allow to assign navigation for more complicated geometries [i.e 3D ] \n- A quality cut in the HO is removed since the photodetectors are being replaced with SiPMs. We expect an increase in HO clusters and rechits in rings 1/2. This is seen in antons' analysis.\n  - This quality cut will be added back now in this PR.\n", "branch": "CMSSW_7_1_X", "changed_files": 211, "closed_at": "1394785305", "comments": 137, "commits": 61, "created_at": "1394025578", "deletions": 32096, "labels": ["fully-signed", "hlt-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "99c5f91dca440aa65b1cbf36aab6d6224c28f70e", "merged_at": "1394785305", "merged_by": "ktf", "milestone": "CMSSW_7_1_0_pre5", "number": 2730, "release-notes": [], "review_comments": 41, "state": "closed", "title": "Rewrite and Improvements for PFRecHit and PFCluster Producers", "updated_at": "1403333792", "user": "lgray"}