{"additions": 173, "auther_ref": "matchingCleaning_from-CMSSW_13_0_0_pre1", "auther_sha": "bee64f2073c9e6f0535a7e65374ae0f69b5a6b89", "author": "swertz", "body": "#### PR description:\r\n\r\nFill in a few gaps in the matching between collections in Nano:\r\n- boostedTaus were not used in the matching at all, resulting in the existing branch `boostedTau_jetIdx` to be always `-1`\r\n- add matching between secondary vertices and other objects (only store indices to SVs in the other objects, the SV table is not modified)\r\n- add the following matching cases (matching done by common PF cands) and corresponding index branches:\r\n    - jets with boostedTaus (no boostedTau index branch added to the jets, but `boostedTau_jetIdx` is now usable)\r\n    - jets with SVs (2 indices + nSV stored in jets)\r\n    - lowPtElectrons with photons (photon index stored in lowPtElectrons)\r\n    - taus with electrons (electron index stored in taus)\r\n    - taus with muons (muon index stored in taus)\r\n    - taus with SVs (2 indices + nSV stored in taus)\r\n    - electrons with SVs (SV index stored in electrons)\r\n    - muons with SVs (SV index stored in muons)\r\n\r\nAlso remove the object `cleanmask` branches because they weren't useful in practice as cross-cleaning is heavily analysis-dependent (depends on the object selection). The cleaning can always be done easily a posteriori using the cross-matching indices stored. The cross-cleaning module is kept in place in case people want to use it in private productions.\r\n\r\nNanoAOD file size increase from these changes is 0.02 kb/event.\r\n\r\n#### PR validation:\r\n\r\nRan with `runTheMatrix.py --what nano --site \"\" -l 2500.601`", "branch": "master", "changed_files": 11, "comments": 32, "commits": 14, "created_at": "1669572714", "deletions": 73, "labels": ["reconstruction-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "xpog-pending"], "milestone": "CMSSW_13_0_X", "number": 40162, "release-notes": [], "review_comments": 0, "state": "open", "title": "Nano: fix and additions to collection matching, remove cross-cleaning", "updated_at": "1669835939", "user": "swertz"}