{"additions": 2761, "auther_ref": "t5_embed_new", "auther_sha": "ab51b65ac18d518bb33b8556b44e155b74a2d7be", "author": "SegmentLinking", "body": "This PR introduces a new method of duplicate removal using fully-connected neural networks to compute low-dimensional embeddings of tracks, creating a learned similarity measure for duplicate track rejection. Two small neural networks are trained to map pLS and T5 track features into a shared 6-dimensional embedding space using a contrastive loss function. Duplicate candidates are then identified by placing cuts on the Euclidean distance between tracks in the learned embedding space, replacing the current T5-T5, T5-pT5, and pLS-T5 delta-R based duplicate removal.\r\n\r\nT5-T5 and pLS-T5 pairs with small angular separation (delta-R squared < 0.02) are used for DNN training. Cuts on the embedding distance introduced by this PR reduce the LST duplicate rate in the barrel by up to 50% and substantially increase displaced track efficiency. Timing differences from the additional embedding DNNs are negligible, in part because embeddings are computed per-track and this method only requires a simple pairwise Euclidean distance calculation between embedding vectors.\r\n\r\nMore details can be found here: [Embed_T5_PLS.pdf](https://github.com/user-attachments/files/20596382/Embed_T5_PLS.pdf)\r\n\r\nThe DNN training notebook is also added to the standalone codebase in this PR, in-line with previous ML-related PR's for LST: https://github.com/cms-sw/cmssw/pull/47618, https://github.com/cms-sw/cmssw/pull/46857, and https://github.com/cms-sw/cmssw/pull/47995.\r\n\r\n<img width=\"285\" alt=\"Screenshot 2025-06-04 at 2 15 49PM\" src=\"https://github.com/user-attachments/assets/8965e14b-a98f-4d9c-ad3e-37fb9ede8b3b\" />\r\n<img width=\"254\" alt=\"Screenshot 2025-06-04 at 2 17 39PM\" src=\"https://github.com/user-attachments/assets/b984f344-e40b-4d1d-8509-c7de103d78f0\" />\r\n\r\n#### PR validation:\r\n\r\nThis PR was tested on CPU and GPU in the standalone configuration and runs without issue.\r\n\r\n@slava77", "branch": "master", "changed_files": 16, "comments": 7, "commits": 1, "created_at": "1749054376", "deletions": 53, "labels": ["reconstruction-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "tracking"], "milestone": "CMSSW_15_1_X", "number": 48249, "release-notes": [], "review_comments": 0, "state": "open", "title": "Track Embeddings for Improved Duplicate Removal in LST", "updated_at": "1749072623", "user": "GNiendorf"}