{"additions": 54, "auther_ref": "CMSSW_9_0_X_tau-pog_LogWarningFix", "auther_sha": "8dd7bd36d5a80d9e816b73e507370f186c4ac31a", "author": "cms-tau-pog", "body": "Hi,\r\n\r\nI am citing Michal's comment to this pull request below (*). Matrix tests have been performed and were positive. This is pure technical work that should not touch the physics performance. This is also what our tests indicated. Runtime performance might change e.g. since edm::Warnings are dowgrade to edm::Infos. \r\n\r\nCheers,\r\nRoger\r\n \r\n\r\n(*)\r\nThe following issues are fixed with this PR:\r\n\r\n * Warning messages about null jet area are downgraded in the PFRecoTauDiscriminationAgainstMuon2. In addition settings of the discriminant for boosted tau reconstruction are corrected.\r\n * A selection is added for jets seeding production of JetRegions, TauChargedHadron and PiZero candidates identical to the one used by TauProducer. This avoids production of JetRegions, TauChargedHadrons and PiZeros which are then unused by Tau producer module which is more economical (less products stored in memory, less loops over PFCandidates, etc.)\r\n * Unused configuration parameter is removed from PFRecoTauChargedHadronProducer_cfi.py\r\n * Production of null taus, i.e. jets which are not all compatible with tau, is switched off in RecoTauTag/RecoTau/python/RecoTauCombinatoricProducer_cfi.py\r\n\r\n", "branch": "CMSSW_9_0_X", "changed_files": 13, "closed_at": "1488260717", "comments": 25, "commits": 15, "created_at": "1487864777", "deletions": 23, "labels": ["analysis-pending", "comparison-available", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "b1b816113dbd9b6cfc040e5acef2081c98a3dbd7", "merged_at": "1488260717", "merged_by": "davidlange6", "milestone": "CMSSW_9_0_X", "number": 17620, "release-notes": [], "review_comments": 12, "state": "closed", "title": "Package of several technical changes: downgrade of edm::Warnings to edm::Info, removal of an unused parameter from cfi file, upward move of jet selection for tau seeding, switch off of production of null taus", "updated_at": "1510909318", "user": "roger-wolf"}