{"additions": 1, "auther_ref": "TP_saturation_fix", "auther_sha": "5f80c2546ac35b7f91f9af22767c4099c6c3c0cc", "author": "TaeunKwon", "body": "#### PR description:\r\n\r\nThis PR updates the HCAL Trigger Primitive(TP) reconstruction algorithm to fix the effect that TP energy in HE with |ieta| >= 21 saturated at 64 GeV for PFA1/PFA1' pille-up mitigation scheme, while 128 GeV is expected. This effect results from the phi segmentation of towers in this particular region. In |ieta|  21 with phi segmentation of 10 degrees, TP energy in each time sample in each tower(after sums over depths) is divided by 2 to mimic phi segmentation of 5 degrees in other regions. And because the HCAL TP algorithm checks a saturation of TS in each tower just before this division by 2, the actual saturation check in |ieta|  21 in HE is at 64 GeV for each TS for now. \r\n\r\nTo fix the unexpected low saturation threshold in |ieta|  21 in HE, the saturation check, which is the second check among 3 saturation checks in the algorithm and turned out to be redundant, is removed. A brief explanation of the old and new algorithm, and the performance test after applying this PR can be found on [Presentation by Taeun Kwon](https://indico.cern.ch/event/1132179/contributions/4764839/attachments/2402243/4108534/Comissioning_1TS_Scheme_4Mar22.pdf).\r\n\r\n\r\n#### PR validation:\r\n\r\nA basic technical test was performed: runTheMatrix.py -l limited -i all --ibeos\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nThis PR is not a backport.\r\n", "branch": "master", "changed_files": 1, "comments": 2, "commits": 1, "created_at": "1646923156", "deletions": 3, "labels": ["l1-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_12_3_X", "number": 37196, "release-notes": [], "review_comments": 0, "state": "open", "title": "HCAL: fix on HCAL TP saturation algorithm to recover a saturation threshold for HE with |ieta| >= 21", "updated_at": "1646923641", "user": "TaeunKwon"}