{"additions": 5403, "auther_ref": "mfgb-to-dd4hep-for-pr", "auther_sha": "e6cb3afbe6b6a69f1120303610432b2b8a749e8c", "author": "cvuosalo", "body": "#### PR description:\r\n\r\nMigrate the magnetic field geometry builder to DD4hep, except for reading from the DB. Code has been migrated as-is with very minimal changes. The existing code could be rewritten and revised, but that task is not within the scope of this PR. The principles of this PR:\r\n* Continue to support the old DD, along with the new DD4hep\r\n* Keep changes to old code to the bare minimum\r\n* Share as much code between the old and new DD methods as possible\r\n\r\nMigration of reading the magnetic field from the DB with DD4hep will be done in a subsequent PR.\r\n\r\nNote that the need for the pseudo-trapezoid shape is uncertain at this time. Its final status will be resolved in a later PR.\r\n\r\nThis PR includes fixes to the new DDShapes that may be needed by other developers.\r\n\r\nThis PR should not change the behavior of current workflows.\r\n\r\n#### PR validation:\r\n\r\nA unit test is included in this PR, and it thoroughly tests the geometry builder. This test was run for the old DD and the new DD4hep version, and the results were the same. Regression tests for the old DD and new DD4hep also produced matching results. Other units tests and matrix tests were also successful.", "branch": "master", "changed_files": 264, "closed_at": "1566929885", "comments": 97, "commits": 181, "created_at": "1564689136", "deletions": 2706, "labels": ["reconstruction-pending", "simulation-pending", "dqm-pending", "l1-pending", "hlt-pending", "core-pending", "alca-pending", "daq-pending", "db-pending", "generators-pending", "operations-pending", "geometry-rejected", "pending-signatures", "tests-pending", "orp-pending", "pdmv-pending", "upgrade-pending", "code-checks-approved", "xpog-pending"], "milestone": "CMSSW_11_0_X", "number": 27674, "release-notes": [], "review_comments": 93, "state": "closed", "title": "Magnetic field geometry builder migration to DD4hep", "updated_at": "1647886302", "user": "cvuosalo"}