{"additions": 1313, "auther_ref": "muonValidation_15_1_0_pre1", "auther_sha": "589e1f9cea9943b32b62c03d5f638b6c9cb8f7ce", "author": "Parsifal-2045", "body": "#### PR description:\r\n\r\nThis PR deals with some general fixes and improvements for Muon validation targeting both HLT and Offline for Phase 1 and Phase 2:\r\n- Fix DQM plots filling for quantities vs dR (now active when exactly two signal `TP`s are present), for dimuon studies. This also required to extend the interface of the `TrackingParticleSelector` class with a few more getters, including `isSignalOnly()`\r\n- Fix plots for quantities separated in barrel, overlap, and endcap regions (e.g. efficiency_vs_phi_barrel) which should now be filled with the correct information in each region. \r\n- Implement summary plots (efficiency vs muon collection and fake rate vs muon collection) for both HLT and Offline validation\r\n- Slightly rework validation code to make summary plots creation possible: now there is a single `MuonMultiTrackValidator` for HLT and a few for Offline (one per group: standard, displaced, refit, ...) \r\n- The new `MuonMultiTrackValidator` takes as input vectors of `labels`, `associators`, and `muonHistoParameters`. These are supposed to be of the same size (runtime check, with an exception thrown if not) and in the same order (no check at the moment, could be an item for further development)\r\n- Remove some outdated and not used validation sequences in `HLTriggerOffline` dealing with muon collections that are no longer produced under tracking\r\n- Simplify muon association / validation sequences for HLT and Offline\r\n\r\n[Full talk](https://indico.cern.ch/event/1530334/contributions/6438878/subcontributions/540396/attachments/3038713/5366920/2025-03-24%20-%20Muon%20POG%20validation%20update.pdf) discussing these changes presented at the HLT Upgrade on 25/03/2025.\r\nNo physics changes are expected. DQM outputs should also remain largely the same, with the notable exclusions of plots vs dR, plots for separate regions, and the removal of outdated and always-empty plots produced by the previously mentioned sequence under `HLTriggerOffline`.\r\n\r\n#### PR validation:\r\n\r\nI've run the usual battery of tests locally and produced a DQM output comparison for two different ZMM workflows: one for Run 3 and one for Phase 2. The DQM comparison output is available [here](https://cernbox.cern.ch/s/6RukcqF3s6OG3rF) and was obtained using the `compareHistograms.py` utility of CMSSW.", "branch": "master", "changed_files": 15, "comments": 8, "commits": 9, "created_at": "1742921786", "deletions": 972, "labels": ["simulation-pending", "dqm-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved", "trk", "ngt"], "milestone": "CMSSW_15_1_X", "number": 47692, "release-notes": [], "review_comments": 0, "state": "open", "title": "[NGT] Fix some Muon validation plots, allow for summary plots creation ", "updated_at": "1743014702", "user": "Parsifal-2045"}