{"additions": 47, "auther_ref": "backportFastSim_10_2_X", "auther_sha": "aa2c3502529d4f514ec321171e32c5f7b6393401", "author": "cericeci", "body": "#### PR description:\r\n\r\nBackport of  #36122 and #36324 for preUL 2018 FastSim production. Full functionality of both, without the code formatting. Please check #36352 (backport to UL branch) first\r\n\r\nThis fixes a bug which would invalidate simulation for long-lived and a fraction of prompt signals (and luckily was introduced very recently, so most of the previous production is safe). Our understanding is that this case doesn't go against the no-change policy.\r\n\r\nOriginal PR description: Jaebak found that some b- and d-mesons produced in the decays of exotic particles, which cross the beam pipe radius, have their decay performed twice, with sim hits created for each copy. This causes problems for some high-pT b-jets, as well as the MET in events that contain such jets. A few lines are added to ParticleManager.cc which results in FastSim deciding to not decay such particles further, and rather take only the original generator-determined decay trees. FastSim will still propagate these particles and create secondaries/material interactions, but it won't decay them.\r\n\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\n#36122 and #36324, needed for preUL 2018 MC production (most notably pMSSM scan)", "branch": "CMSSW_10_2_X", "changed_files": 7, "closed_at": "1642538039", "comments": 14, "commits": 7, "created_at": "1638548910", "deletions": 24, "labels": ["fastsim-approved", "operations-approved", "fully-signed", "tests-approved", "orp-approved"], "merge_commit_sha": "5869142cb6dabd13eb0294747bfb9c15e7ebf1b1", "merged_at": "1642538038", "merged_by": "cmsbuild", "milestone": "CMSSW_10_2_X", "number": 36353, "release-notes": [], "review_comments": 1, "state": "closed", "title": "Backport of \"Fix for FastSim decays of exotic-descendent SM particles decaying outside pipe\" to 10_2_X", "updated_at": "1642538039", "user": "cericeci"}