{"additions": 2579, "auther_ref": "phase1pixeldqm-third", "auther_sha": "3c4593964ff3a5935445405996d7c7cf3f67fd25", "author": "schneiml", "body": "This is a follow up to #14015 and #13798 .\n\nAll commits are rebased to the CMSSW_8_1_CLANG_X_2016-04-24-0000 IB such that #13987 lies below, with fixes to make things actually work.\n\nSome points mentioned in #14015 are still relevant, but everything that I got feedback to is fixed.\n\n@makortel regarding the Certification module, I now remove that in DQMOffline_CRT_cff.py, even though I still don't get how that finds its way into the offline config (cert-stuff is removed in SiPixelOfflineDQM). And, said module crashes due to code like this `float dcsFrac = (iGetter.get(\"Pixel/EventInfo/DCSSummary\"))->getFloatValue();`, though I can't see immediatly which histogram is missing due to my changes (probably all...).\n\n@slava77 I now make the TrackerTopology internal structs visible to the outside. I am not sure whether that is a good idea, but I agree it is better than what we had before.\n\n@smuzaffar there are now 3 new packages, one with shared code and two that use this code for digis and clusters. More packages will come in the future, but I can't tell yet how we will call them.\nUPDATE: now 4. Two for shared code and config, two for the plugins.\n\nOverall, I think this is in a mergeable shape now. Let me know if you think different. Also, chasing IBs and rebasing ~100 commits each time starts to get annoying.\n", "branch": "CMSSW_8_1_X", "changed_files": 28, "closed_at": "1463980263", "comments": 52, "commits": 99, "created_at": "1461573066", "deletions": 47, "labels": ["comparison-available", "dqm-approved", "new-package-pending", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-approved"], "milestone": "Next CMSSW_8_1_X", "number": 14230, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Phase 1 Pixel DQM (number 3, final?)", "updated_at": "1463980263", "user": "schneiml"}