{"additions": 1576, "auther_ref": "egamma_tensorflow_pfid", "auther_sha": "035207b9f7333b02939ef45b6e84e43e1a454ffb", "author": "valsdav", "body": "#### PR description:\r\n\r\nThis PR introduces the DNN based Egamma particle flow ID evaluation based on the Tensorflow internal support.\r\nTwo helper classes, ElectronDNNEstimator and PhotonDNNEstimator, are included to handle the loading and evaluation of the DNN models for GsfElectron and GEDPhotons candidates. \r\n\r\nMultiple models are evaluated for electrons and photons in different detector and energy regions. Batch evaluation is implemented to call each Tensorflow session only 1 time for event.  The evaluation of the DNN models is configurable from python config and txt files:  the list of variables to be used, their scaling parameters, the model files can be changed without changes to the code.  \r\n\r\nThe DNNs are evaluated before the electron and photons candidates pass through the PFEgammaFilters, where the DNN values are available in the candidates to be used for the selection. Thresholds configuration for the PFid have been added to the PFEGammaFilter producer.\r\n\r\nIn the PR, the DNN based PFid has been activated by default and default models files have been included for the testing. Final model file will be provided in a separate PR after the finalization on the CMSSW_12_0  samples.  \r\n\r\n- Further details can be found in this set of slides.  https://cernbox.cern.ch/index.php/s/xy9GoRRi955eN4p\r\n- Egamma Run3 developments: https://indico.cern.ch/event/1076372/contributions/4531423/attachments/2311646/3934035/EGM_RECO_Run3.pdf\r\n- PF meeting talk: https://indico.cern.ch/event/1074938/#10-particle-flow-egamma-id-for\r\n\r\n#### PR validation:\r\n\r\nValidation from the PF group on the private branch is ongoing. \r\n\r\n", "branch": "master", "changed_files": 41, "comments": 0, "commits": 42, "created_at": "1632483017", "deletions": 107, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending"], "milestone": "CMSSW_12_1_X", "number": 35403, "release-notes": [], "review_comments": 0, "state": "open", "title": "Egamma PFID based on Tensorflow DNNs ", "updated_at": "1632483121", "user": "valsdav"}