{"additions": 31, "auther_ref": "CMSSW_12_0_0_SmearMETFix_short_rebased", "auther_sha": "ff49d87e58866f7c4579c6e8f861eddc00640e97", "author": "michaelwassmer", "body": "This PR is in reference to an older PR (https://github.com/cms-sw/cmssw/pull/36165).\r\nIt basically does the same thing, however with a lot less new lines of code.\r\n\r\n**PR description:**\r\n\r\nThis pull request fixes the incorrect calculation of the nominal smeared missing transverse energy (MET). The underyling problem is the application of the JER correction factors. These factors are applied in PhysicsTools/PatUtils/interface/SmearedJetProducerT.h but later not considered when reverting to the uncorrected jets in JetMETCorrections/Type1MET/interface/PFJetMETcorrInputProducerT.h.\r\nThis results in the problem that the JER correction factors in the smeared MET calculation effectively cancels and therefore the smeared MET is basically the same as the regular type1-corrected MET. After the changes shown below, the nominal smeared MET distributions from MiniAOD are similar to the ones obtained from NanoAOD.\r\n\r\nFinally, there is also a mistake when saving the JERup and JERdown varied smearedMET. The different contributions of the nominal smeared MET correction and the JERup and JERdown variations are not separated correctly from one another. After the changes shown below, the varied smeared MET distributions from MiniAOD are similar to the ones obtained from NanoAOD.\r\n\r\nThis pull request includes the following:\r\n\r\nDataFormats/PatCandidates/src/MET.cc\r\n- to get the corrections/deltas for the JER variations of the smeared MET, the calculation now takes the up/down-varied smeared MET (px,py,...) and subtracts the contributions from the nominal smeared MET corrections (ref.dpx(),ref.dpy(),...) as well as the nominal type1-corrected MET (this->px(),this->py(),...)\r\n- the previous implementation is a mystery to me\r\n\r\n JetMETCorrections/Type1MET/interface/PFJetMETcorrInputProducerT.h\r\n- add a template class/functor (AdditionalScalesT) to retrieve additional scales (JER correction factors)\r\n- in generic implementation it only applies 1 as a factor therefore doing nothing\r\n- in case of pat::Jet, see below\r\n\r\n PhysicsTools/PatUtils/plugins/PATPFJetMETcorrInputProducer.cc\r\n- edit pat::Jet template specialization of the already existing RawJetExtractor class to revert all possibly applied correction factors\r\n- pat::Jet template specialization of AdditionalScalesT, which retrieves all previously applied jet scales\r\n\r\n**PR validation:**\r\n\r\n- runTheMatrix.py -l limited -i all' worked besides some workflows which had CMSDAS errors despite a working certificate\r\n- 'scram b runtest' worked\r\n", "branch": "master", "changed_files": 3, "closed_at": "1644183763", "comments": 12, "commits": 1, "created_at": "1643118679", "deletions": 3, "labels": ["reconstruction-approved", "fully-signed", "tests-rejected", "orp-approved", "code-checks-approved"], "merge_commit_sha": "340f6ea4d2b5528a5d62a9160b9fc4461ad3d991", "merged_at": "1644183763", "merged_by": "cmsbuild", "milestone": "CMSSW_12_3_X", "number": 36797, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Fix for smeared MET calculation and its uncertainties.", "updated_at": "1644183763", "user": "michaelwassmer"}