{"additions": 14926, "auther_ref": "fc-simMTD-devel-102X", "auther_sha": "c157f62b75d5f89576909c4e3a5276fafe72fa43", "author": "fabiocos", "body": "This PR is the first step to move from the initial simplified MTD description currently present in the release to a detailed ideal geometry based on detailed volumes for both sensitive and passive materials. The detailed xml description is based on the tkLayout tool, the initial work of @ghugo83 and @lgray, and the contribution of @hardenbr .\r\n\r\nFor the barrel part (BTL) two alternative scenarios are presented for the crystal layout, flat tiles and long bars. The first scenario (labeled here D90 in the geometry configurations) includes a detailed description of the passive materials as provided by T. Tabarelli, the second one (D91) is based on the implementation of @hardenbr according to the design by C. Tully, using a simplified description of the passive material (aluminum plates).\r\nThe interface with the tracker description (currently PhaseII scenario TiltedTracker404) has been agreed with the tracker experts @ghugo83 @boudoul @emiglior , so as to keep the existing tracker description unchanged, but move the Outer Tracker Support Tube into a separate file outside of the Phase2OTBarrel volume. The BTL mother volume is placed in between these two.\r\n\r\nThe endcap (ETL) description is at present that provided by L. Gray, and should be possibly updated according to the latest plans. This volume is placed within the CALO volume.\r\n\r\nNo overlap is internally detected for the BTL scenario D90 and ETL, while scenario D91 contains some residual tiny overlaps (order of 20 nm) to be fixed in a revision. The whole tracker volume (including BTL) has been tested to be free of overlaps, once the support tube is removed from the tracker.xml file as now described separately in the otst.xml file.\r\n\r\nA numbering scheme, based on the volume hierarchy, is provided in the new Geometry/MTDCommonData package, and a test class is also provided, to probe it vs the volume structure (verified to correspond to the wanted design). The present top level DetId (Forward, FastTiming) is kept. The Geant4 interface has been adapted to use this numbering scheme when producing hits (for the rest the interface is unchanged at present).\r\n\r\nThe DIGI and local RECO steps have been adapted by @casarsa to use the new numbering scheme, specializing the digi collections for BTL and ETL. No other change is made at present, keeping updates of the DIGI format and of the algorithms for a next PR. \r\n\r\nThanks to @boudoul the D90 and D91 geometry scenarios have been added to PyReleaseValidation in a similar way as the other PhaseII test scenarios, and single muon workflows 22407 (D90) and 22807 (D91) have been tested to run and produce collections as expected (simple classed to inspect digis and reco hits have been provided, for hits the existing code in SimG4Core/Application/test has been used).", "branch": "master", "changed_files": 91, "closed_at": "1527092869", "comments": 102, "commits": 31, "created_at": "1525340453", "deletions": 44, "labels": ["code-checks-approved", "comparison-available", "geometry-pending", "operations-approved", "orp-approved", "pdmv-approved", "pending-signatures", "reconstruction-pending", "simulation-pending", "tests-approved", "upgrade-approved"], "merge_commit_sha": "6ed8d044da7e3b6cc0a378d803bb5448400347e8", "merged_at": "1527092869", "merged_by": "cmsbuild", "milestone": "CMSSW_10_2_X", "number": 23126, "release-notes": [], "review_comments": 76, "state": "closed", "title": "MTD: ideal geometry based on detailed volume description, numbering scheme, adapt the existing Sim-DIGI-RECO chain to it", "updated_at": "1529300553", "user": "fabiocos"}