{"additions": 196, "auther_ref": "devel_hltFindDuplicates", "auther_sha": "d591c3b2659cce396765a6fbf45fc0cf89a7ed27", "author": "missirol", "body": "The utility `hltFindDuplicates` seems to be broken in recent CMSSW releases (it has not been touched in the last few years, I don't know when it stopped working). This PR aims to introduce minimal updates to make it work again.\r\n\r\nWhile testing, I also noticed that the text files produced as outputs are not fully reproducible, because the labels assigned to the groups of duplicate modules (`hltGroup1`, `hltGroup2`, etc) are not assigned deterministically. In order to avoid this and make outputs reproducible, the group label `hltGroup[0-9]+` is replaced with a string based on the content of the group (the string contains the type of the plugin followed by the label of the first module of the group in alphabetic order).\r\n\r\nA unit test is also added as an attempt to make sure that this utility does not break again in the future. In order to make the unit test fast (a few seconds), the test currently uses only the `PRef` menu (the simplest menu in the release with some duplicate modules).\r\n\r\nMerely technical. No changes expected.\r\n\r\nFYI: @fwyzard (in case Andrea is the one who wrote this script, which is what I would guess based on [CMSHLT-2099](https://its.cern.ch/jira/browse/CMSHLT-2099))\r\n\r\n#### PR validation:\r\n\r\nManual checks, and the new unit test passes.\r\n\r\n#### If this PR is a backport, please specify the original PR and why you need to backport that PR. If this PR will be backported, please specify to which release cycle the backport is meant for:\r\n\r\nN/A\r\n", "branch": "master", "changed_files": 3, "comments": 5, "commits": 1, "created_at": "1704191192", "deletions": 66, "labels": ["hlt-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_14_0_X", "number": 43644, "release-notes": [], "review_comments": 4, "state": "open", "title": "make `hltFindDuplicates` work again", "updated_at": "1704204015", "user": "missirol"}