{"additions": 138, "auther_ref": "CMSSW_8_1_X_tau-pog_decay-mode-changes", "auther_sha": "0c91fc03a20e0bef61114dae7688dfab29ffdc8e", "author": "cms-tau-pog", "body": "Hi Slava, Carl, \n\nWe have made some changes to the tau decay mode reconstruction. This was in reaction to a significant unexpected efficiency loss in the 1prongNpi0 decay modes after the introduction of the 2prong reconstruction modes. Studies have been presented already quite some time ago (*). The main reason that has been identified is that a significant number of 1prongNpi0 taus were reconstructed in the 2prong reconstruction modes. Due to the reconstruction ordering of the algorithm, which prioritizes Nprong over Mprong for N>M these taus were lost in the 1prong decay modes. This has been counter measured by introducing a pT cut on the prongs for the reconstruction of the 2prong modes. \n\nThis pull request contains the following changes to tau decay mode reconstruction:\n\n (1) an upper cut has been introduced on the prongs for all decay modes irrespective of the correction of the reconstructed tau direction (due to a better determination of ECAL clusters during reconstruction -- called bend corrections in the code; these corrections are additive);\n (2) making bend corrections configurable (but switched on per default for all decay modes -- this is the same behaviour as currently in 81X, but there it is hard coded);\n (3) adding a pT selection of pT>5GeV on the prongs for the reconstruction of the 2prong modes; this reduces unwanted migration effects and brings the efficiency of the 1prongNpi0 decay modes roughly back to the old level;\n (4) the 3prong1pi0 decay mode has been added to the decay mode reconstruction by default; this gives an increase of the efficiency of up to +5%, though at the cost of a higher fakerate. It will still be used for dedicated analyses.\n\nWe have checked that (1) and (2) have minimal to no influence at all on the outcome of the tau Id sequences. (3) has a significant influence on the decay mode reconstruction, which has been checked to be in the right direction. The same is true for (4) but less significant. Validation sequences did not reveal any unexpected behaviour. Matrix tests were inconspicuous. \n\nCheers,\nRoger\n\n(*)\nhttps://indico.cern.ch/event/477580/contributions/1998190/attachments/1209639/1763951/nehrkorn_2016_01_11.pdf\n", "branch": "CMSSW_8_1_X", "changed_files": 7, "closed_at": "1465538297", "comments": 9, "commits": 8, "created_at": "1465287208", "deletions": 19, "labels": ["comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "cad0cb9e28a558ded71541ae6789a5aa21f98348", "merged_at": "1465538297", "merged_by": "cmsbuild", "milestone": "Next CMSSW_8_1_X", "number": 14795, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Changes to tau decay mode reconstruction", "updated_at": "1470654490", "user": "roger-wolf"}