{"additions": 36, "auther_ref": "devel_l1tCICADAScoreBXInfoInL1uGT", "auther_sha": "0155f31e03aa921d6f0a39f02bef789d63b33d8c", "author": "missirol", "body": "#### PR description:\r\n\r\n@rseidita reported that #48037 does not entirely fix the L1-uGT data-emulator discrepancies related to the CICADA seeds which are currently observed in the online DQM. It seems that, after including #48037, there are disagreements of the type \"emulator fired but not data\" in BXs different from the central one.\r\n\r\nFrom a quick look at the L1-uGT emulator, I think this might be related to the L1-uGT emulator itself.\r\n - In #44222, the CICADA score was implemented as a data member of `GlobalBoard` (see `m_cicadaScore`), setting its value to the CICADA score for BX=0.\r\n - While this works for BX=0, I think it leads to computing the emulated CICADA decisions for BX!=0 using the CICADA score for BX=0. This may explain why the emulator fires more often than data for BX!=0 in Roberto's tests.\r\n\r\nThis PR implements the use of CICADA scores from the relevant BXs when evaluating the decisions of CICADA seeds in the L1-uGT emulator.\r\n\r\n#### PR validation:\r\n\r\nNone from my side. Dedicated tests were done by @rseidita (I let him comment on the outcome of his checks).\r\n\r\n#### If this PR is a backport, please specify the original PR and why you need to backport that PR. If this PR will be backported, please specify to which release cycle the backport is meant for:\r\n\r\nTo be backported to `CMSSW_15_0_X` (2025 pp data-taking cycle) to reduce L1-uGT data-emulator mismatches in online DQM.\r\n\r\n_Note_ : the L1-uGT emulator also runs in the HLT jobs, and at T0 (e.g. offline reco), so this PR indirectly touches all those workflows as well.\r\n", "branch": "master", "changed_files": 3, "comments": 4, "commits": 1, "created_at": "1747848292", "deletions": 32, "labels": ["l1-pending", "pending-signatures", "orp-pending", "tests-started", "code-checks-approved"], "milestone": "CMSSW_15_1_X", "number": 48142, "release-notes": [], "review_comments": 0, "state": "open", "title": "use BX info in L1-uGT emulation of CICADA conditions", "updated_at": "1747848596", "user": "missirol"}