{"additions": 219, "auther_ref": "CMSSW_7_4_0/csc-me11A-emulator", "auther_sha": "16b7332a6a2897ec8876820ff7998a2e220e8081", "author": "slava77", "body": "[almost copy-paste of the message of #8664; the code is plain cherry-pick of changes made in 73X; with positive feedback from @ptcox  I'm proceeding ]\n\nThis is supposed to address issues with running CSC (ME11 part) emulator on run2 data (currently broken for ME11a) and for re-emulation applications of run2 MC (currently possible from sim digis, but appears to be less convenient than done from RAW).\nAdditionally, the selective readout for run2 MC was fixed (currently the CSC selective readout emulation is disabled in run2 MC; everything is saved.)\n- extend CLCT processor to cover 7 CFEBs (that's how OTMB works now), this is for current data\n- pick up correct ranges for smartME11ab case for the (MC only at this point) SLHC algorithm\n- updated CLCT processor to also correctly read comparators on MC inputs if configured with unganged ME1a for \"current\" TMB algorithm (that's what we have in current OTMB firmware now)\n- fix CSCTriggerPrimitivesReader (minor, input names got mixed up after getByLabel -> getByToken conversion done last year)\n- added a shift of 4 CFEBs or 128 halfstrips for packed CLCTs and LCTs coming from ME1a (see notes below), they show up in SLHC-OTMB MC algorithm only. [this is the only change that affects output of Run2 MC \"standard\" workflows; note though that the unpacked LCTs and CLCTs are not really used, other than in the limited set of DQM and non-standard validation; if fixes in 74X are no longer possible, we can take this out and live with the ambiguous packing]\n- fixed ME1A pretrigger filling in MC by the CSCTriggerPrimitivesBuilder\n- made the packer aware of pretriggers and ALCTs showing up in ME1A detid with the SLHC-OTMB algorithm (this should make it possible to correctly emulate selective readout during packing; disabled for run2 MC)\n\nAn equivalent of this PR will be made for 75X.\n\nChanges show up only Run2 MC \"standard\" DQM plots like this (me1/1a occupancies are present); there are no changes in regular reco or HLT objects.\n![wf1320_hostripsandwiresandclct](https://cloud.githubusercontent.com/assets/4676718/6990601/505c9aea-da35-11e4-8213-a8e46c787af5.png)\n", "branch": "CMSSW_7_4_X", "changed_files": 9, "closed_at": "1429625037", "comments": 7, "commits": 11, "created_at": "1429103324", "deletions": 118, "labels": ["comparison-available", "l1-pending", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "55238ede401d19ffe3b37c01d3212120f5203aad", "merged_at": "1429625037", "merged_by": "davidlange6", "milestone": "Next CMSSW_7_4_X", "number": 8750, "release-notes": [], "review_comments": 0, "state": "closed", "title": " bug fixes in CSC (ME11) trigger primitives for re-emulation; fix ME11 selective readout (fw port of 73X #8664 )", "updated_at": "1429625037", "user": "slava77"}