{"additions": 46, "auther_ref": "devel_hltSumTag", "auther_sha": "bd80a79410e212a4a6d49f0ad2b0ed1b8e8cacef", "author": "missirol", "body": "#### PR description:\r\n\r\nThis PR provides small improvements to the HLT filters introduced in https://github.com/cms-sw/cmssw/pull/36862 (cc: @rgerosa), including a follow-up to the review comments in https://github.com/cms-sw/cmssw/pull/36862#pullrequestreview-880947093.\r\n\r\nOne change is not merely technical; it concerns the case where `MatchByDeltaR == true`. In the original implementation, every jet is assigned a \"jetTag\" value, and, when there is no valid Delta-R match with a jet in the JetTag map, then the tagValue is set to an arbitrary -1000. In this PR, jets without a valid DR-match are instead skipped; for realistic cuts on \"JetSumTag\", the two approaches should be equivalent from a practical point of view, and I would suggest to use the one in this PR.\r\n\r\nSince the relevant plugins are not run in any central wf, the PR tests are not expected to be sensitive to this PR.\r\n\r\n#### PR validation:\r\n\r\nI manually checked with the recipe provided in https://github.com/cms-data/RecoBTag-Combined/pull/47#issuecomment-1033521156 (plus some edits to the config file, using one instance of the plugin with `MatchByDeltaR=false` and one with `MatchByDeltaR=true`) that the results of the HLT filters, and corresponding trigger objects, are exactly the same for 100 MC events.\r\n\r\n#### If this PR is a backport, please specify the original PR and why you need to backport that PR:\r\n\r\nN/A", "branch": "master", "changed_files": 2, "closed_at": "1645126889", "comments": 7, "commits": 1, "created_at": "1645018187", "deletions": 42, "labels": ["hlt-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "06d877dafcd0732acf486e1af887dc00285ceb56", "merged_at": "1645126889", "merged_by": "cmsbuild", "milestone": "CMSSW_12_3_X", "number": 36981, "release-notes": [], "review_comments": 0, "state": "closed", "title": "small improvements to `HLTSumJetTag`", "updated_at": "1645126890", "user": "missirol"}