{"additions": 164, "auther_ref": "backport80_prs_14138_14441_14754_14844", "auther_sha": "1867b5557701cf0628daa9c8093dd36a21e7883a", "author": "makortel", "body": "This PR backpots PRs #14138, #14441, #14754, and #14844 from CMSSW_8_1_X to CMSSW_8_0_X. Original descriptions by @lgray\n#14138\n\n> Use a quick union algorithm + knowledge of ranges of block element types to speed up PFBlockAlgo.\n> \n> Minor regressions expected due to the order-sensitivity of PFAlgo.\n> \n> Regressions appear as changes in the particle flow candidate list, and so can affect PF-met and PF-jets kinematic observables. Effect is statistical in nature and should be quantifiable using a large stats sample.\n#14441\n\n> This ordering bug was causing crashes in relvals for 810pre4.\n> \n> I have checked in a few cases that the exceptions are no longer thrown.\n> Notably, in these cases more blocks were being created than with the old algorithm.\n> With the bugfix provided here, the old behavior is restored.\n#14754\n\n> Ensure by brute force that all block orderings are taken care of in PFBA and links between objects are never missed.\n> \n> Incurs a minor performance penalty since inner loop for link-finding is larger, minor jittery regressions expected.\n> \n> This fixes the bug reported in Heavy Ions relvals\n#14844\n\n> Quick Union algorithm was not always returning the deepest root available in a connected graph.\n> This is a deficiency in the underlying algorithm, luckily it is easy to patch out (just keep looking for roots of roots).\n> I'll fix the underlying cause in the future, thankfully it's iterlog-N on average.\n> \n> I also added in a clause to skip direct connection tests if two nodes are already connected. Should help with speed. If there is incidental slow down compared to yesterday's IB I will remove it.\n\nTested in 8_0_14, small changes in RECO are expected in quantities that depend on PF.\n\n@fwyzard @gennai @slava77 @lgray \n", "branch": "CMSSW_8_1_X", "changed_files": 2, "closed_at": "1469533113", "comments": 4, "commits": 5, "created_at": "1469532446", "deletions": 98, "labels": ["comparison-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-started"], "milestone": "Next CMSSW_8_1_X", "number": 15286, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Backport of #14138: Speed up PFBlockAlgo (including the fixes from #14441 #14754 #14844)", "updated_at": "1469533147", "user": "makortel"}