{"additions": 755, "auther_ref": "particle-net-trigger-integration", "auther_sha": "797571a87e24a97422cbf0c4d33863636e4752a0", "author": "rgerosa", "body": "This PR implements changes needed in order to evaluate new particle-net models meant to be used at HLT during Run3. New triggers were proposed during the trigger review [0] by the Higgs PAG for HH4b resolved and Hbb boosted topologies that will be based on this PR.\r\n\r\n[0] https://indico.cern.ch/event/1099590/contributions/4626739/attachments/2358674/4025770/TSGHIG_03Dec21.pdf\r\n\r\nHere a more detailed description:\r\n\r\n1. No changes are expected in the outputs of standard test workflows.\r\n2. This PR is needed in order to evaluate the ONNX models that are about to be added as external to CMSSW. The related PR is: https://github.com/cms-data/RecoBTag-Combined/pull/47\r\n3. Changes applied to the DeepBoostedJetTagInfoProducer are needed in order to evaluate/create the specific input features used for the HLT networks that are a bit different from what used by offline PNET modes. A boolean flag is used to switch between online and offline features\r\n4. The new HLTfilters called HLTSumJetTag and HLTSumJetTagWithMatching are needed to implement the proposed triggers in the HLT men. In fact, some of the proposed triggers requires multiple jets in the final state and select interesting events on the basis of an average of the b-tag score of the first Njets. For this reason, we need a SumTag filter module (as far as we know, there is no such filter in release yet).\r\n\r\nThis PR has been tested by implementing HLT triggers (outside confdb) and running the successfully the HLT reconstruction. In addition, we also tested that changes applied to the DeepBoostedJetTagInfoProducer are not creating issues by running the standard runTheMatrix workflow. There is no need for specific unit tests since, once this PR will be merged, we will use the next 12_3_X release to build the final version of the triggers in confdb. These will enter in the v1 HLT menu for Run3.", "branch": "master", "changed_files": 5, "closed_at": "1644860338", "comments": 32, "commits": 13, "created_at": "1643807731", "deletions": 253, "labels": ["hlt-approved", "reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "urgent", "code-checks-approved"], "merge_commit_sha": "24e950159584b8260e4d3ca0085d9c24a31a3101", "merged_at": "1644860338", "merged_by": "cmsbuild", "milestone": "CMSSW_12_3_X", "number": 36862, "release-notes": [], "review_comments": 32, "state": "closed", "title": "HLT Triggers based on ParticleNet for Run3", "updated_at": "1644860339", "user": "rgerosa"}