{"additions": 69, "auther_ref": "noisyGpuValidation_133X", "auther_sha": "6ec2b12513fdf8c604229b4c2254b0b3db826e87", "author": "alejands", "body": "#### PR description:\r\n\r\nAddresses issue https://github.com/cms-sw/cmssw/issues/42720 dealing with multiple missing collection warnings per event coming from the `EcalDQMonitorTask` module using the `ecalMonitorTaskEcalOnly` config in offline relval WFs. The collections fell into one of three groups with each group having a separate reason or set of reasons for the warnings.\r\n\r\n---\r\n\r\nThe `GpuRecHit` collections do not exist (as far as I know this is still the case). RecHit monitoring was switched off for online GPU validation in https://github.com/cms-sw/cmssw/pull/39393, but this was not propagated to offline since RecHits were [enabled by default](https://github.com/cms-sw/cmssw/blob/93e2e3051588c8f931cb559201d76f9edafdb9ec/DQM/EcalMonitorTasks/python/ecalGpuTask_cfi.py#L13) in the ECAL GPU validation module. With this PR, the RecHits will now be switched off by default. The assumed [RecHit input tags](https://github.com/cms-sw/cmssw/blob/93e2e3051588c8f931cb559201d76f9edafdb9ec/DQM/EcalMonitorTasks/python/CollectionTags_cfi.py#L56-L59) are already in place for when the collections are implemented. \r\n\r\nIn addition, there was an oversight of mine in https://github.com/cms-sw/cmssw/pull/39371 while implementing these collection-level switches to be used in exactly this kind of context. This is now corrected in this PR, and unused collections for GPU monitoring are no longer consumed. \r\n\r\n---\r\n\r\nThe `TrigPrimEmulDigi` and `ReducedRecHit` collections are straightforward to explain. They are not being produced in offline DQM `EcalOnly` workflows, and there are already flags in place to switch off running over these collections. The emulated digis were already switched off in the general offline config, but the same was not done for the `EcalOnly` config, as the collection is switched off _after_ cloning the original config. This PR switches these collections off for the offline `EcalOnly` config.\r\n\r\n---\r\n\r\n`EcalRawData` is the trickiest to switch off on the ECAL DQM side since it's used by several modules. This issue is now resolved in https://github.com/cms-sw/cmssw/pull/42844. \r\n\r\nHowever, we simultaneously implemented a bandaid solution on the ECAL DQM side. We added a parameter to `EcalDQMonitorTask` called `skipCollections` that takes in the names of collections to be explicitly removed from the list of collections being run by the ECAL DQM module. \r\n\r\nThe skipping is done as barebones as possible and we decided to purposefully not remove any dependencies that might cause a problem if a collection is not present. This way we can prevent potentially undefined behavior from slipping through the cracks and leaving little to no trace of something being wrong. \r\n\r\nSkipping a collection will lead to the same behavior as having a missing collection if there is a further issue. The difference is that a skipped collection will not be consumed and the ECAL DQM module will not attempt to access the data. This could be useful in the future and not necessarily in the context of a missing collection.\r\n\r\nThe other PR is the ideal solution to the current issue so this isn't going to be used right now, but it doesn't hurt to have the extra customizability option in our toolkit. \r\n\r\n---\r\n\r\n#### PR validation:\r\n\r\nTested with both workflows brought up in issue https://github.com/cms-sw/cmssw/issues/42720. The workflows ran successfully with no warnings.\r\n\r\n```\r\nrunTheMatrix.py --what gpu -l 141.008583\r\nrunTheMatrix.py --what gpu -l 11634.511\r\n```\r\n\r\nAdding `EcalRawData` to the new `skipCollections` parameter works as intended. The warning and exception paths added also run as intended in their relevant scenarios.\r\n\r\n---\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nA backport can be made if needed.", "branch": "master", "changed_files": 8, "comments": 7, "commits": 4, "created_at": "1695434817", "deletions": 15, "labels": ["dqm-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_13_3_X", "number": 42848, "release-notes": [], "review_comments": 0, "state": "open", "title": "Remove noisy missing collection warnings coming from EcalDQMonitorTask", "updated_at": "1695618842", "user": "alejands"}