{"additions": 137, "auther_ref": "demonstrator-tools-optional-tmux-slice-staggering", "auther_sha": "71929b4564e27bb360edc0c6819f2aced23253a8", "author": "linacre", "body": "#### PR description:\r\n\r\nThe PR adds the option to disable staggering of different TMUX slices in buffer text files. Such staggering can lead to a different number of events per output file (depending on the link:board TMUX ratio), and thus a given event can appear in output buffer files with different index numbers. This issue has been discussed [here](https://indico.cern.ch/event/1574976/contributions/6635080/attachments/3113630/5519904/GTT_serenity_010825.pdf) and previous GTT meetings.\r\n\r\nIt also updates `kMaxLinesPerFile` in `GTTInterface.h` from 1024 to 972 = 6 events x 18 BX/event x 9 clock cycles/BX. Using 972 frames, its easier to get the buffers to loop with the right periodicity for continual playback (one less parameter to set in the online SW config).\r\n\r\nA couple of checks related to the number of events per file were added with corresponding warning messages or exceptions:\r\n- Added static member function `BoardDataWriter::checkNumEventsPerFile()` to check a given set of file writers have the same `maxEventsPerFile_`, and use this in `GTTFileWriter::beginJob()`. This generates an exception (`std::runtime_error`) if the check fails for unstaggered buffer files, but only prints a warning (`std::cerr`) in the case of staggered buffer files (because staggered file writers are not expected to have the same `maxEventsPerFile_` when they don't share the same link:board TMUX ratio).\r\n- `BoardDataWriter`: add check for `pendingEvents_` in destructor, so a warning is printed when `flush()` has been forgotten when ending the job in the file writer.\r\n\r\nA minor bug was also fixed:\r\n- `GTTFileWriter`: add missing flush commands for `fileWriterSelectedTracks_` and `fileWriterVertexAssociatedTracks_` \r\n\r\n\r\n#### PR validation:\r\n\r\nThere are no changes in the output when producing staggered buffer files (but a warning message is now printed in case of different values of `maxEventsPerFile_`). The unstaggered buffer files have been confirmed to be produced with the same number of events per file, independent of the link:board TMUX ratio, when the `kMaxLinesPerFile` aka `maxFramesPerFile` parameter is set consistently (if not, an exception is generated with a recommendation on how to correctly set `maxFramesPerFile`). The new warnings and exception have been tested to behave as expected.", "branch": "master", "changed_files": 4, "comments": 2, "commits": 12, "created_at": "1755703101", "deletions": 24, "labels": ["l1-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-rejected"], "milestone": "CMSSW_15_1_X", "number": 48771, "release-notes": [], "review_comments": 0, "state": "open", "title": "Draft: DemonstratorTools: make TMUX slice staggering optional, and disable it in GTTFileWriter", "updated_at": "1755703212", "user": "linacre"}