{"additions": 23, "auther_ref": "LHEMotherIndices_15_0_0pre1", "auther_sha": "44a3d3371c59bd4700a13f60bbcbbfc27f6486bb", "author": "pianonick411", "body": "#### PR description:\r\n\r\nThe indices of a particle's mother are not currently stored in the LHEPart collection. \r\nThis PR would add two lists of indices to the LHEPart collection:\r\n\r\n- LHEPart_firstMotherIdx: The index of an LHE particle's first mother in the LHEPart collection.\r\n- LHEPart_lastMotherIdx: The index of an LHE particle's last mother in the LHEPart collection. \r\n\r\nThe ability to track an LHE particle's ancestry is necessary for performing matrix-element calculations as done in HIG-19-009 and HIG-21-013 for the purposes of reweighting. Future Higgs property measurements in H -> 4l and other channels will require this additional information. \r\n\r\nI have discussed the code of this PR with the following members of the HZZ group: Nicola Amapane (@namapane), and Jeffrey Davis (@jdavis36). \r\n\r\n#### PR validation:\r\nThe code was tested on a sample of ZH, (H -->ZZ-->4l) events from /ZHto2Zto4L_M125_TuneCP5_13p6TeV_powheg2-minlo-HZJ-JHUGenV752-pythia8/Run3Summer22MiniAODv4-130X_mcRun3_2022_realistic_v5-v2/MINIAODSIM in CMSSW_13_3_3. \r\n\r\nA ZH sample was chosen so that the LHE history was sufficiently complex.\r\n\r\nIt was verified that the indices stored in the output nanoAOD file correspond to the same particle in the input miniAOD. \r\n\r\nAccording to the size report, each of the 2 new variables adds 0.1 b/item; in this sample there are in average 14 items/evt, so the total size increase is be 2.8 b/evt, which is a very small addition.\r\n\r\n", "branch": "master", "changed_files": 2, "closed_at": "1736753801", "comments": 13, "commits": 2, "created_at": "1736456361", "deletions": 0, "labels": ["fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "xpog-approved"], "merge_commit_sha": "a3ba3791d7c94ef9484543a28f05b13b15c06bbd", "merged_at": "1736753801", "merged_by": "cmsbuild", "milestone": "CMSSW_15_0_X", "number": 47075, "release-notes": [], "review_comments": 3, "state": "closed", "title": "Add Mother Indices to LHEPart ", "updated_at": "1736753802", "user": "pianonick411"}