{"additions": 138, "auther_ref": "hcal-tp-all-corrections", "auther_sha": "bd9022ac7c0f2fba2aae37765dc8593c8c5f3c89", "author": "christopheralanwest", "body": "This PR makes several changes to the generation of the LUTs for HCAL trigger primitive generation:\r\n\r\n- eta assignment for subcomponents of trigger tower 28 is now based on the different sub-components of the the tower rather than using the average eta of the tower.\r\n- The SiPM nonlinearity correction is made more similar to the offline reconstruction by using an estimate of the full pulse charge rather than a 1 time sample charge\r\n- Estimates for the charge that falls outside the 2-TS sum used in the HBHE trigger primitives is now ET-dependent, replacing the old ET-independent \"Rcalib\" correction.\r\n\r\nThere are also two minor technical changes:\r\n\r\n- SiPM nonlinearity corrections are now not applied for HEP17 TPs in 2017, consistent with the 2017 online usage; this has a negligible effect on any physical quantity\r\n- Changes to the hardcoded conditions used for future MC scenarios where real conditions do not yet exist; with the changes in this PR, there are no longer any \"magic numbers\" associated with HCAL trigger conditions\r\n\r\nNo changes are expected for any quantity that does not use HCAL TPs. In particular, the changes in the pulse shape classes simply provide a different way to initialize the pulse shape information from conditions.\r\n\r\nAt a recent L1 Trigger Primitives meeting [1], the L1 DPG signed off on the HCAL trigger group's plan to modify the LUT generation procedure. More details can be found in the presentation from that meeting.\r\n\r\nFor consistency, the HcalLutMetadata conditions should be changed simultaneously with the code, or else an undesired 13% change in the HBHE TP scale will result. For this reason, I'm requesting the update in the 2018 MC GTs.\r\n\r\n[1] https://indico.cern.ch/event/700828/", "branch": "master", "changed_files": 10, "comments": 28, "commits": 9, "created_at": "1517861538", "deletions": 80, "labels": ["alca-pending", "code-checks-approved", "comparison-pending", "l1-pending", "orp-pending", "pending-signatures", "tests-pending"], "milestone": "CMSSW_10_1_X", "number": 22121, "release-notes": [], "review_comments": 0, "state": "open", "title": "Modifications to HCAL trigger LUTs", "updated_at": "1518181271", "user": "christopheralanwest"}