{"additions": 91, "auther_ref": "system-openssl", "auther_sha": "d9d1c1bb8d9c3094af930893a85174210a38eac4", "author": "amaltaro", "body": "This PR rebuilds the whole SLC7 COMP software stack, removing the dependency on our OpenSSL spec (even though the spec remains here) and relying on the system-based OpenSSL (apparently 1.0.2k-fips), thus requiring our nodes where we run those applications to have the following RPMs installed:\r\n```\r\nopenssl openssl-devel openssl-libs\r\n```\r\n\r\nWith the changes provided in this PR, I managed to build the whole stack of COMP packages, uploaded to my private repo (cmsrep.amaltaro) and successfully ran tests with WMCore/MongoDB/CouchDB central services and submitted/executed jobs with WMAgent as well. So everything seems to be working as expected, but further tests are likely required..\r\n\r\nNOTE 1: when trying to build it myself, build of the `mod_gridsite24.spec` spec fails. If I remove its dependency from the `frontend.spec` everything goes fine. Central services deployed like that work, including the frontend/apache. Build bot does not complain about it though, so the requirement remains there.\r\nNOTE 2: crabtaskworker also failed to be built on my private tests. Hence, I created that patch to manage to build it. Patch has been commented out in this PR because the build BOT does not complain about it\r\nNOTE 3: for the erlang changes, here is one of the sources that had suggestions on how to fix that missing symbol: http://erlang.org/pipermail/erlang-questions/2014-February/076760.html", "branch": "comp_gcc630", "changed_files": 37, "closed_at": "1611299661", "comments": 18, "commits": 9, "created_at": "1606116212", "deletions": 111, "labels": [], "merge_commit_sha": "7de1b9067f605524fb751a00bc1f20b291561e49", "merged_at": "1611299661", "merged_by": "muhammadimranfarooqi", "number": 6440, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Build COMP packages with system-based openssl", "updated_at": "1611299662", "user": "amaltaro"}