{"additions": 50, "auther_ref": "removeOwnVectorTrackingRegion", "auther_sha": "f2ac2b856ff0b6e09be1767214d9eeb9c616015b", "author": "wddgit", "body": "#### PR description:\r\n\r\nThis is part of a campaign to remove code related to OwnVector. This is in preparation for a possible move to RNTuple from TTree as a persistence mechanism. RNTuple does not support OwnVector because it allows polymorphism. Issue https://github.com/cms-sw/cmssw/issues/42734 discusses this in more detail.\r\n\r\nIn this PR, ```OwnVector<TrackingRegion>``` is replaced by ```std::vector<std::unique_ptr<TrackingRegion>>```. This is one of the classes on Matti's list in the issue.\r\n\r\nThe dictionaries are transient so there should be no backward compatibility issues.\r\n\r\nThe output and behavior of the code should be the same as before. There is one producer and 4 modules that consume the product.\r\n\r\n(The code-format utility also modified the spacing in a few lines...)\r\n\r\n#### PR validation:\r\n\r\nrunTheMatrix.py executes most of the modifed code. Test 25.0 runs the producer and 2 of the modules that consume the product. Test 5.1 executes the FastSimulation module that consumes the product and the producer. TrajectorySeedProducer seems to be only run by HLT configurations, but I temporarily forced it to run in test 25.0 (just manually added it). I verified all those tests successfully get past the point where Event::get is called and its succeeds getting the product put by the producer. All the runTheMatrix \"limited\" tests pass.\r\n", "branch": "master", "changed_files": 10, "comments": 6, "commits": 1, "created_at": "1708635702", "deletions": 66, "labels": ["dqm-pending", "fastsim-pending", "reconstruction-approved", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "tracking"], "milestone": "CMSSW_14_1_X", "number": 44063, "release-notes": [], "review_comments": 0, "state": "open", "title": "Migrate away from ```OwnVector<TrackingRegion>```", "updated_at": "1708685876", "user": "wddgit"}