{"additions": 3, "auther_ref": "removedUnusedCodeRelatedToOwnVector", "auther_sha": "021a0e058da3b806aaa0b7d9c20247a3bf974217", "author": "wddgit", "body": "#### PR description:\r\n\r\nRemove unused code related to OwnVector. This is in preparation for a possible move to RNTuple from TTree as a persistence mechanism. RNTuple does not support OwnVector because it allows polymorphism.\r\n\r\nThis PR is just dealing with some of the easiest cases. Code that isn't used anymore (some was maybe never used). Matti initially identified this list in Issue #42734 and this issue also contains more information related to this. These are the \"Clearly unused\" cases on Matti's list. I spent some time with grep and git grep and double checking that they were not used. I tried to delete anything directly related OwnVector or there only to support OwnVector. There probably is more cleanup that could be done in this part of the code. For example, the class FastTrackerCluster appears to be completely unused. I'll delete it also if anyone asks.\r\n\r\nAn example of a typical class in this set of changes, ```edm::OwnVector<SiPixelRecHit>``` was initially committed in 2006 and then replaced by edmNew::DetSetVector in 2007, except the dictionaries were left in the code (maybe for backward compatibility at that time, I don't know) and never cleaned up.\r\n\r\n#### PR validation:\r\n\r\nAs a temporary test I added the following to OwnVector.h, then ran checkdeps, and then ran \"scram b\". It succeeded. This shows nothing uses OwnVector<T> for these types. I did this for CMSSW_14_1_X_2024-02-08-1100 and CMSSW_10_6_39. This should eliminate the possibility anything could produce objects of these types or use them in any way. I guess the only possible weakness of this test is something might read an old file using a View or the code might be different in other releases, but that does not seem likely. \r\n\r\n\r\nI removed this after running the test. It is not in the PR.\r\n```\r\n   class OwnVector {\r\n+    static_assert(!std::is_same_v<T, SiPixelRecHit>,\r\n+        \"foo does not support Bar1\");\r\n+    static_assert(!std::is_same_v<T, SiStripRecHit1D>,\r\n+        \"foo does not support Bar2\");\r\n+    static_assert(!std::is_same_v<T, SiStripRecHit2D>,\r\n+        \"foo does not support Bar3\");\r\n+    static_assert(!std::is_same_v<T, SiTrackerMultiRecHit>,\r\n+        \"foo does not support Bar4\");\r\n+    static_assert(!std::is_same_v<T, MTDTrackingRecHit>,\r\n+        \"foo does not support Bar5\");\r\n+    static_assert(!std::is_same_v<T, FastTrackerCluster>,\r\n+        \"foo does not support Bar6\");\r\n+    static_assert(!std::is_same_v<T, CSCStripHit>,\r\n+        \"foo does not support Bar7\");\r\n```\r\n", "branch": "master", "changed_files": 10, "comments": 1, "commits": 1, "created_at": "1707513215", "deletions": 109, "labels": ["reconstruction-pending", "fastsim-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending", "tracking"], "milestone": "CMSSW_14_1_X", "number": 43931, "release-notes": [], "review_comments": 0, "state": "open", "title": "Removed unused code related to OwnVector", "updated_at": "1707513239", "user": "wddgit"}