{"additions": 22, "auther_ref": "from-CMSSW_12_5_X_2022-07-20-2300", "auther_sha": "4436737f6d6b3a28771dae419c0d53b584292dbc", "author": "sbein", "body": "This PR creates an option to enable the FastSim decayer functionality, which was previously enabled without an option. The decayer has been found to have been responsible for considerable mismodeling in the missing ET, a known issue with a heavy-handed correction procedure developed by and adopted by the SUS PAG. The impact of the FastSim decayer on physics was recently studied and presented in the simulation meeting [1]. \r\n\r\n\r\n[1] https://indico.cern.ch/event/1182398/contributions/4967736/attachments/2480801/4258724/Sim15July2022_Decayer.pdf\r\n\r\nAdopting the GEN decays has many advantages, including the guaranteed synchronization of decay modes btw the generator and simulation steps, the universal ability to allow for the decays of exotic particles without analyzing the family tree of every particle, and avoiding any unforeseen consequences of switching generators, e.g., from Pythia8 to Herwig. Most importantly, defaulting to the GEN decays was seen to improve the modeling of MET and other observables in FastSim significantly, while any bad impacts are for the most part minor [2][3]\r\n\r\n\r\n\r\nThe SUSY-derived FastSim MET correction may no longer be necessary, but it is up to PAGs to assess any treatment/uncertainties they think are appropriate for their analyses. It would also be advisable to backport this default behavior to the Run 2 UL release, CMSSW_10_6_X for any future campaigns. \r\n\r\n#### PR validation:\r\n\r\n[ALT_0] is the new FastSim:\r\n[2] https://www.desy.de/~beinsam/FastSim/Nano/6July2022/TTbar_12_2_XDev/index.html\r\n[3] https://www.desy.de/~beinsam/FastSim/Nano/6July2022/T1tttt_12_2_XDev/index.html\r\n", "branch": "master", "changed_files": 4, "closed_at": "1658680650", "comments": 11, "commits": 2, "created_at": "1658398985", "deletions": 12, "labels": ["fastsim-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "e98751d3d2fe79f3d86cafb498d16a346f5ead28", "merged_at": "1658680650", "merged_by": "cmsbuild", "milestone": "CMSSW_12_5_X", "number": 38813, "release-notes": [], "review_comments": 0, "state": "closed", "title": "adding option to enable FastSim decayer functionality", "updated_at": "1658680650", "user": "sbein"}