{"additions": 3094, "auther_ref": "devel_HLTDQM_validHLTPaths_1100pre13", "auther_sha": "fc0d5e804b847118f2ad9af2dd8d6e6b2ff1c777", "author": "missirol", "body": "#### PR description:\r\n\r\nThis PR propagates the check on valid HLT paths (originally introduced in #27772) to more plugins of the HLT Offline DQM; specifically, the feature is added to the plugins that make use of the `GenericTriggerEventFlag` class.\r\n\r\nThe changes here are limited to the package `DQMOffline/Trigger`, so they only apply to the (HLT) DQM step (and not the Validation step).\r\n\r\nWhile implementing this, it became apparent that several plugins contained exact copies of the same methods (e.g. `setMETitle`); luckily, many of these basic methods were already part of the class `TriggerDQMBase`, so to minimize redundant code, many plugins have been updated to inherit from `TriggerDQMBase` (as was/is done for the most recent plugins in this same package).\r\n\r\nThe changes, in terms of lines of code, turned out to be fairly extensive, but they are in principle straightforward; aside from the addition of the \"valid HLT paths\" functionality and the inheritance from `TriggerDQMBase`, some polishing of the code was done while going through the different plugins (removal of unnecessary `#include`s, etc), but without changes to functionalities nor outputs.\r\n\r\nThe idea of this PR would be to first run the comparisons to verify that there are no unexpected differences, and then change the default of `requireValidHLTPaths` from `False` to `True` for all possible plugins (this could be done here, or in a separate PR; my preference would be to do it here after the first set of comparisons is understood), to check how many (empty) DQM histograms are removed after doing this (to be clear, these would be DQM outputs that are currently produced in the different workflows, but inevitably empty because associated to HLT paths not present in the HLT Menu in the input). I ran one check on a 2018 MC file and, there, switching to `requireValidHLTPaths = True` resulted in ~3500 less (HLT-)DQM histograms.\r\n\r\nOther small changes include moving `TriggerDQMBase.*` out of `plugins/` (since it's not a plugin), and removing `plugins/TopMonitor.h` (moving the relevant code to `plugins/TopMonitor.cc`).\r\n\r\nThere is one change expected in the comparisons (even with `requireValidHLTPaths = False`): after inheriting from `TriggerDQMBase`, the plugin `NoBPTXMonitor` will produce a few more histograms under `EXO/NoBPTX/*`, because the booking routines in that plugin were slightly different from those it now inherits from `TriggerDQMBase`.\r\n\r\n#### PR validation:\r\n\r\nSuccessfully ran a few standard workflows (for example, `runTheMatrix.py -l 11634.0`).\r\n\r\n#### if this PR is a backport please specify the original PR:\r\n\r\nNot a backport, and no backport of this is planned.", "branch": "master", "changed_files": 57, "closed_at": "1578596770", "comments": 75, "commits": 13, "created_at": "1576484480", "deletions": 5002, "labels": ["code-checks-approved", "comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "5072f868eb7bf1c3e55dce92b91ddbae5bd65291", "merged_at": "1578596769", "merged_by": "cmsbuild", "milestone": "CMSSW_11_1_X", "number": 28627, "release-notes": [], "review_comments": 3, "state": "closed", "title": "[DQMOffline/Trigger] added \"requireValidHLTPaths\" flag to plugins using GenericTriggerEventFlag", "updated_at": "1578596770", "user": "missirol"}