{"additions": 88, "auther_ref": "ParT_DataFormats_from-CMSSW_13_0_0_pre3", "auther_sha": "6cd9a6ce1844ab8abfe2e8c97373304053a4c347", "author": "AnnikaStein", "body": "#### PR description:\r\n\r\nA new jet flavour tagging algorithm (RobustParTAK4) is to be integrated soon, and relevant DataFormats need to be modified to handle more input variables (e.g. more features for charged / neutral candidates, as well as for secondary vertices). While we have a first full integration in our private recipes, we aim to integrate the respective producers and the inference part at a later time to implement improvements to the timing of the new modules with dynamic input sizes, which is a work-in-progress. This PR is for the data structure only, to meet the POG updates deadline.\r\n\r\nSome relevant links to meetings where these developments have been discussed in BTV: https://indico.cern.ch/event/1218499/#5-adversarial-training-for-par and https://indico.cern.ch/event/1218501/#4-adversarial-training-for-par\r\nAnd a short summary of the activities and milestones related to this project was part of the roundtable (https://indico.cern.ch/event/1236178/#4-general-status-and-feedback)\r\n\r\n#### PR validation:\r\n\r\nBasic set of code checks / code-format only (more dedicated tests will be added as part of the full integration, of which one can view a preview here: https://github.com/cms-sw/cmssw/compare/master...AnnikaStein:cmssw:from-CMSSW_13_0_0_pre3 where we tested the new inputs and outputs for the AOD to MiniAOD step, followed by mini to nano). More tests to follow in a not as time critical follow-up PR related to validation of inputs and outputs, which are however independent of the minimal changes introduced in this PR. With the present PR, we only create the necessary data structure (and will therefore not have to patch these in later, in line with https://twiki.cern.ch/twiki/bin/viewauth/CMS/ReleaseSchedule#Notes_on_Patch_Releases_formalis).\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNot a backport\r\n", "branch": "master", "changed_files": 7, "closed_at": "1675840852", "comments": 27, "commits": 7, "created_at": "1675697812", "deletions": 4, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "btv"], "merge_commit_sha": "320cc9416698aa0b489ee74c4ff08ad37d54e160", "merged_at": "1675840852", "merged_by": "cmsbuild", "milestone": "CMSSW_13_0_X", "number": 40706, "release-notes": [], "review_comments": 12, "state": "closed", "title": "RobustParticleTransformer in `DataFormats/BTauReco`", "updated_at": "1676212701", "user": "AnnikaStein"}