{"additions": 245, "auther_ref": "ps-overlap-fix", "auther_sha": "6715f407814f3b3c45c144b2b7072960c631c072", "author": "cvuosalo", "body": "The ECal preshower showed overlaps of about 1 mm between volumes `SFAbsNPbLOutAl` and `SFAbsNPbLinPb`. These volumes are created by the preshower algorithm. The algorithm was also creating a few unneeded solids and volumes.\r\n\r\nIt turns out that the `SFAbsNPbLOutAl` volume was being built incorrectly. With old DD, this volume is heavily nested, while with DD4hep it was missing some components. This PR  changes the code so that this volume gets the same structure in DD4hep as in the old DD. To add to the confusion, there were two different components both named `SFAbsNPbLOutAl`, and this PR changes the name of the volume to `SFAbsNPbLOutAlVol` to distinguish it from the like-named Tube.\r\n\r\nThe fix in this PR is complicated because the old DD code was using the capability of the old DD to create objects before they are fully defined. Old DD places the `SFAbsNPbLOutAl` volume before fully defining it and filling it with solids. That is not possible with DD4hep. To get around this problem, this PR adds a new loop where in the first iteration the necessary components are built and in the second iteration they are placed. The resulting code is even more complex than the original. It would be good to rewrite all this code to more clearly adapt it to the DD4hep paradigm where all components have to be defined before use, but we are trying to merge this PR for 12_0_0_pre2, and there is not time for such an extensive rewrite.\r\n\r\nThis PR removes uneeded solids and volumes and re-names a few components in cases where two different components had identical names.\r\n\r\n#### PR validation:\r\n\r\nThe overlap checker, `SimG4Core/PrintGeomInfo/test/python/g4OverlapCheck_dd4hep_cfg.py`, was run before and after this change to show that the overlaps were fixed. Also, all solids were compared between old DD and DD4hep and found to be the same for the preshower (ignoring the new assemblies).\r\n\r\nA backport is probably not necessary.", "branch": "master", "changed_files": 1, "closed_at": "1622025036", "comments": 14, "commits": 2, "created_at": "1621977331", "deletions": 236, "labels": ["code-checks-approved", "fully-signed", "geometry-approved", "orp-approved", "tests-approved", "urgent"], "merge_commit_sha": "2c737cdbe7e360cae86ece878609a706c3411218", "merged_at": "1622025036", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 33840, "release-notes": [], "review_comments": 0, "state": "closed", "title": "[DD4hep] Fix last of preshower overlaps", "updated_at": "1622025036", "user": "cvuosalo"}