{"additions": 335, "auther_ref": "EGL1S1ToS2Migration800p1", "auther_sha": "630556ecb3096c7e89b69dc84604001e78f4074b", "author": "Sam-Harper", "body": "@gpasztor \n\nThis is the E/gamma migration from stage-1 to stage-2. A lot of the work was also done by Gabriella Pasztor, her work was the base I started from. Because my gitfoo is not strong, I ended up having to lose her commits (it was easier just to copy over the 2 new files and the 2 modified files.\n\nModules accessing L1 actually in the menu:\n\nHLTEgammaL1MatchFilterRegional:\n- replaced by HLTEgammaL1TMatchFilterRegion\n\nHLTEcalRecHitInAllL1RegionsProducer \n- templated the new stage-2 objects in\n\nEgammaHLTCaloTowerProducer\n- it is my understanding that L1 team will label their collections therefore no code update is strictly necessary.\n- I dont have access to that pull request so in my tests paths with this module failed\n- it will however loop twice on the e/gamma objects which is a  bit pointless, will fix in the next update\n- if the L1 team is not going to label their objects, we can provide a new version of this class which works just for the stage-2\n\nModules not in menu which use L1 info:\n\nHLTEgammaL1MatchFilterPairs:\n- I personally see no use for this module, its not been used in RunII (and possibly most of RunI) so I think we should depreciate it. I would like to actually delete the module but at the very least, we should only update it when people have a use case\n\nHLTRechitInRegionsProducer:\n- this is completely superseeded by HLTRecHitInAllL1RegionsProducer since the start of RunII and has not been used in any RunII menu so depreciate\n### Configuration changes needed to work the new menu:\n- all instances of cms.Input('hltCaloStage2Digis','Isolated') and cms.Input('hltCaloStage2Digis','NonIsolated') should be changed to cms.Input('hltCaloStage2Digis','EGamma'), assuming L1 names the Egamma collection EGamma\n-  hltRechitInRegionsECAL and hltRechitInRegionsES need to have their matching parameters updated. For both l1InputRegions should be (taking into account that the Jet and Egamma collection tags will change)\n\n```\nl1InputRegions = cms.VPSet( \n      cms.PSet(  maxEt = cms.double( 999.0 ),\n        regionEtaMargin = cms.double( 0.4 ),\n        minEt = cms.double( 5.0 ),\n        regionPhiMargin = cms.double( 0.5 ),\n        inputColl = cms.InputTag( 'hltCaloStage2Digis' ),\n        type = cms.string( \"EGamma\" )\n      ),\n      cms.PSet(  maxEt = cms.double( 999.0 ),\n        regionEtaMargin = cms.double( 0.4 ),\n        minEt = cms.double( 200.0 ),\n        regionPhiMargin = cms.double( 0.5 ),\n        inputColl = cms.InputTag( 'hltCaloStage2Digis' ),\n       type = cms.string( \"Jet\" )\n      )\n    ),\n\n```\n### Future updates:\n\nWe tried to have minimal changes as requested. But we would like to rename the input parameters of HLTEgammaL1MatchFilterRegional to take into account that the L1EGs are not seperated in non-isolated, isolated. We also have to study the new matching requirements at L1. Right now its probably overly large. \n", "branch": "CMSSW_8_0_X", "changed_files": 4, "closed_at": "1458030226", "comments": 8, "commits": 1, "created_at": "1456936303", "deletions": 9, "labels": ["comparison-available", "fully-signed", "hlt-approved", "orp-approved", "tests-approved"], "merge_commit_sha": "1fb8404347d5b7c1b50182fe08daab1aef0a3214", "merged_at": "1458030226", "merged_by": "cmsbuild", "milestone": "CMSSW_8_0_X", "number": 13558, "release-notes": [], "review_comments": 0, "state": "closed", "title": "EG L1S1 to L1S2 migration", "updated_at": "1458030227", "user": "Sam-Harper"}