{"additions": 12, "auther_ref": "ProperlyUpdateEmptyProcessHistoryID", "auther_sha": "7b10bfee38e5fcbf26060547d43de74690149515", "author": "wmtan", "body": "This is a fix for a bug that has been in place since CMSSW_6_2_0, and another bug that was introduced by the first attempt at fixing this bug.\nThe original problem was hit by Erik Butz when he tried to read a file written with CMSSW_3_2_5.\nFor files written in CMSSW_5_0_0 and later, actual FED raw data is recorded as having been created in a process called \"LHC\" with a module label of \"rawDataCollector\". If a file written prior to CMSSW_5_0_0 is read in CMSSW_5_0_0 or later, this \"LHC\" process is added retroactively, which affects the process history. The process history must then be retroactively modified.\nThis worked fine until CMSSW_6_2_0, when a bug was introduced. There is a map used to map the old process history to the new. In 6_2_0, the entry for an empty old process history was incorrectly omitted from the map. Real raw data prior to CMSSW_5_0_0 had an empty process history. So, the process history ID for real raw data was not found in the map. and a fatal assert fired.\nThe fix is to simply add the missing entry to the map.\nThe second problem was introduced a few days ago by an incorrect attempt to fix the above problem.\nThe second problem caused the failure of two relvals (4.6 and 144.6) and one other test (read312RV).\nThe fix for the second problem is just to back out the bad fix.  That commit is also included in this pull request.\n", "branch": "CMSSW_7_1_X", "changed_files": 2, "closed_at": "1392932137", "comments": 1, "commits": 2, "created_at": "1392932091", "deletions": 15, "labels": ["comparison-pending", "core-pending", "orp-pending", "pending-signatures", "tests-pending"], "merge_commit_sha": "7934298eddfe0a327fd86849cbf86315c27bfe14", "merged_at": "1392932137", "merged_by": "ktf", "milestone": "CMSSW_7_1_0_pre9", "number": 2569, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Properly update empty process history", "updated_at": "1401194221", "user": "wmtan"}