{"additions": 642, "auther_ref": "EgammaElectronAlgos_pure_functions", "auther_sha": "68d3b63f22a91a995944474f54c47daccdfc80d1", "author": "guitargeek", "body": "#### PR description:\r\n\r\nThis is one of the occasional PRs to make the EGamma algos follow a bit more a functional paradigm for better multithread-friendlieness and code readability.\r\n\r\nI propose to convert the member functions of all the classes in `EgammaElectronAlgos` that don't have member variables into free functions that should all live in the same namespce (I suggest here the name `electronAlgos`, I think one namespace for each former class would be a bit excessive, but I don't think CMS has any guidelines for that so that's maybe a thing to discuss). Functions that were previously private are simply not declared in the public header file.\r\n\r\nAll these functions were then adapted such that they are pure, i.e. they don't mutate their inputs and always have an output of a defined type. This means that when the GsfElectrons are created, they are actually only mutated in the GsfElectronAlgo itself and never in the various helper functions that it calls.\r\n\r\nOptimally, the formerly private functions should live in the anonymous namespace, but I was a bit reluctant to do that because it would cause huge chunks of code to shift indentation without actual changes. Is there maybe a way to put functions in the anonymous namespace without enclosing them with `namespace { }` and therefore causing an additional layer of indentation?\r\n\r\nThis PR does not clash with https://github.com/cms-sw/cmssw/pull/28262.\r\n\r\n#### PR validation:\r\n\r\nCMSSW compiles and local matrix tests pass.\r\n\r\n#### if this PR is a backport please specify the original PR:\r\n\r\nNo backport intended.\r\n", "branch": "master", "changed_files": 16, "closed_at": "1572551790", "comments": 34, "commits": 5, "created_at": "1572038868", "deletions": 837, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "bc9bded52598086ae798300efab19d4c7e389612", "merged_at": "1572551790", "merged_by": "cmsbuild", "milestone": "CMSSW_11_0_X", "number": 28282, "release-notes": [], "review_comments": 5, "state": "closed", "title": "Many classes in EgammaElectronAlgos turned into pure functions", "updated_at": "1572551790", "user": "guitargeek"}