{"additions": 264, "auther_ref": "mergeChangesToCommonAlignment920p2", "auther_sha": "b157d48efbf066237ab443bf19615fbd8ef05ddd", "author": "usarica", "body": "Motivation:\r\n- Surface deformations were not propagated to the geometry after alignment.\r\n- If the database does not contain a surface deformation record previously, alignment did not place one.\r\n- We also observed precision issues during comparison of ySplit in TwoBowedSurfaceDeformation\r\n- We also include here changes to trackselectionRefitting.py, which\r\n1) Adds support for a wider range of dimuon constraints\r\n2) Applies the constraint only to the track refitter with the common source (constaint was previously assigned to all track refitter regardless of common source)\r\n3) Fixes process path in the presence of a constraint\r\n4) Includes basic J/psi->mumu common selection support\r\n\r\nChecks:\r\n- Checks were done running different alignments with the pixel and strips at module, module unit or higher level alignments as part of the (ongoing) tracker alignment campaign.\r\n- See these slides for a quick overview of items implemented and checks done: \r\nhttps://indico.cern.ch/event/624094/contributions/2627981/attachments/1476471/2287406/20170614.pdf\r\nhttps://indico.cern.ch/event/624094/contributions/2627967/attachments/1476540/2287679/hpvalidation.pdf\r\n\r\nNotes:\r\n- Rebased on top of the commits in PR #19541, which fixes KF fitter and smoother classes to allow TwoBodyDecay trackParameter constraint to work again.\r\n- A separate PR is being prepared for the follow-up changes in the HIPAlignmentAlgorithm (re-applying most of the commits reverted by the last commit in this PR)\r\n", "branch": "master", "changed_files": 15, "closed_at": "1499787672", "comments": 17, "commits": 52, "created_at": "1499335713", "deletions": 105, "labels": ["alca-pending", "comparison-available", "geometry-pending", "orp-pending", "pending-signatures", "reconstruction-rejected", "tests-rejected"], "milestone": "CMSSW_9_3_X", "number": 19583, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Merge surface deformations changes from May 2017 tracker alignment campaign for pixel alignment", "updated_at": "1499787672", "user": "usarica"}