{"additions": 66, "auther_ref": "disable_LErecovery_750p2", "auther_sha": "cabf698758630250ce480209874c4e82395d9986", "author": "emanueledimarco", "body": "- This change disables the leading edge recovery for saturated hits. The method is in place since long time, it works nicely in the simulation, but unfortunately it cannot work on data due to a recently discovered slew-rate limit of the MGPA pre-amplifier that introduces strong non-linearities in the correlation between the 4th sample of the pulse shape and the real energy of the hit. \n- More information can be found in the presentation at the last ECAL DPG meeting [1]. \n- The expected effect of this change is to worsen the resolution of the clusters which include a saturated hit (typically the seed) on simulation, but improve the data-MC agreement in such cases, since the algorithm was giving a pretty random estimate of the energy on data.\n- The change should be in principle back-ported to 7.4.X because we would like to have in the RunII Digi-Reco campaign, but we know that there are strong time constraints (discussed at the PPD coord. meeting yesterday [2])\n  - in this case the change should be back-ported to 7.3.X sample to make the flat photon gun sample needed for the high ET cluster corrections\n\n@argiro @cerminar @pierinim @ferriff @crovelli @paramatti please also follow this. \n\n[1] https://indico.cern.ch/event/380957/contribution/1/material/slides/0.pdf\n[2] http://goo.gl/OViFni\n", "branch": "CMSSW_7_5_X", "changed_files": 5, "closed_at": "1429482421", "comments": 34, "commits": 4, "created_at": "1428991095", "deletions": 110, "labels": ["comparison-available", "fully-signed", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "f7081935c69bf2c89823ae9031a3411ae1b9eeca", "merged_at": "1429482421", "merged_by": "cmsbuild", "milestone": "CMSSW_7_5_X", "number": 8717, "release-notes": [], "review_comments": 6, "state": "closed", "title": "Disable Not Working leading edge recovery for saturated ECAL RecHits", "updated_at": "1434460620", "user": "emanueledimarco"}