{"additions": 614, "auther_ref": "AMv2.3", "auther_sha": "d64ece336fbfeef86c5daf5886f5d66d342abaa4", "author": "jfernan2", "body": "#### PR description:\r\n\r\nThis PR implements recent changes with bug fixes and upgrades in the L1T DT Trigger Phase-2 emulator:\r\n\r\n- Fix to DT Digis plugin from Karol Bunkowski ( @kbunkow ) which prevents crashes due to pointers to local variables stored in vectors, and then these vectors (so also the pointers) were used outside those methods \r\n\r\n- Removed t0 Phi replacement in theta Digis at the ThetaMatching filter to preserve original t0 for the Barrel Filter objects pairing\r\n\r\n- New DataFormat collection for DT Phase Phi-Theta matched pairs L1Phase2MuDTExtPhiThetaPair and its container L1Phase2MuDTExtPhiThetaPairContainer to be used by the Phase2 Barrel Filter \r\n\r\n- Create new plugin DTTrigPhase2PairsProd which takes Phi and Theta DT Phase-2 digi Extended collections[1] and creates a new class container of the 4 best closest Phi-Theta digi pairs per DT chamber based on the time-position phase-space distance and ordered by Phi quality. For those cases where there is no Phi/Theta partner, 4 best quality single Phi/Theta digis are saved and counterpart in pair is set to default values of the constructor digi class (quality = -1, positions = 0). \r\n[1] Requires df_extended>0 in L1Trigger/DTTriggerPhase2/plugins/DTTrigPhase2Prod.cc\r\n\r\n- Add DT Phase-2 Digi pair production to the standard L1 Trigger sequence\r\n\r\n- Add DT Phase-2 Digi and Digi pair collections to the L1 Trigger default Event Content\r\n\r\n- General cleaning of the code\r\n\r\n[Link ](https://indico.cern.ch/event/1639762/#sc-2-35-dt-phi-theta-pair-matc)to the presentation in the Phase-2 L1T Muon Subsystem group meeting on 22/01/2026\r\n\r\n#### PR validation:\r\n\r\nLocal validation within CMSSW and w.r.t. firmware (w.i.p.)\r\n", "branch": "master", "changed_files": 16, "comments": 24, "commits": 19, "created_at": "1765359715", "deletions": 26, "labels": ["l1-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "changes-dataformats"], "milestone": "CMSSW_16_1_X", "number": 49589, "release-notes": [], "review_comments": 7, "state": "open", "title": "[L1T] DT Trigger Phase-2 Analytical Method (AM) v2.3", "updated_at": "1770905579", "user": "jfernan2"}