{"additions": 537, "auther_ref": "TritonRaggedBatching130X", "auther_sha": "570a966bba73d860bc55be433e54d60718b9237b", "author": "kpedro88", "body": "#### PR description:\r\n\r\nTriton finally added a client-side friendly interface for ragged batching (processing requests with different shapes together). This PR adapts SonicTriton internally to switch between rectangular batching and ragged batching automatically, depending on how shapes are specified, without the user (module developer) having to worry about it. An option to switch manually is also provided. The changes are backwards-compatible: new functionality is available, but existing code that does not use the new functionality will continue to work as before. The README is updated to explain these different cases and the new features. The default Triton server image is also moved to a newer version. This PR may resolve several of the occasional IB failures (etc.) that have been noted in past months; these will be rechecked once it is merged.\r\n\r\nTechnical details: in Triton, a \"request\" consists of data that all have the same shape. Therefore, to send multiple inputs with different shapes at the same time, multiple requests must be created. Triton now provides `InferMulti()` and `AsyncInferMulti()` interfaces that take a vector of requests and loop over them, in order to handle this more general case.\r\n\r\nContingent details: this interface was actually implemented in Summer 2022, specifically intended to be used with ParticleNet (where we currently pad all inputs to achieve a uniform shape). However, because of various limitations in both PyTorch and ONNX, the performance in the ParticleNet case currently does not improve when using ragged batching. We expect this will eventually be resolved. In the meantime, we want to merge this updated interface so further development can continue on top of these rather involved changes.\r\n\r\n#### PR validation:\r\n\r\n* SonicTriton unit tests pass (including new unit test specifically for ragged batching functionality)\r\n* DRN unit test passes\r\n* DRN matrix workflow 10805.31 passes\r\n", "branch": "master", "changed_files": 14, "closed_at": "1677769524", "comments": 22, "commits": 31, "created_at": "1676658718", "deletions": 239, "labels": ["fully-signed", "tests-approved", "orp-approved", "requires-external", "code-checks-approved", "heterogeneous-approved"], "merge_commit_sha": "b833bfe6ab3e63a4eee9744672682c3cac7da104", "merged_at": "1677769524", "merged_by": "cmsbuild", "milestone": "CMSSW_13_1_X", "number": 40814, "release-notes": [], "review_comments": 15, "state": "closed", "title": "Ragged batching interface for SonicTriton", "updated_at": "1677769524", "user": "kpedro88"}