{"additions": 184, "auther_ref": "APVSimulation_PR_master", "auther_sha": "d27d19d0442a8fb305a674646efe9b5ce24878ca", "author": "EmyrClement", "body": "#### PR description:\r\n\r\nInclude a simulation of the APV dynamic gain in TIB and TOB, aiming to improve description of 2016 data before the VFP setting was changed part way through the year.  This improvement is targeting the 2016 UL campaign.\r\n\r\n- A set of APV baseline distributions, which represent the charge accumulated on a strip over several bunch crossings, are provided as an input\r\n  - These are stored as text files in SimTracker/SiStripDigitizer/data/\r\n  - Are read in a similar way to the APV pulse shape\r\n  - These are provided per layer, and in bins of PU and z within a layer, and are \"unrolled\" as one long array of numbers in the text files.\r\n- Each time a charge is deposited on a strip, the APV response is simulated.  This is linear for low APV baselines (little charge remaining on strip from previous interactions), but becomes non-linear for high APV baselines.\r\n  - The end effect reduces the charge that is effectively deposited/read out from a strip\r\n- The dynamic gain simulation is currently turned off in this PR\r\n\r\n#### PR validation:\r\n\r\n- Validation is still ongoing, but an improved description of the shapes of the cluster charge distribution and cluster multiplicity is seen with these changes.\r\n", "branch": "master", "changed_files": 6, "closed_at": "1568614815", "comments": 52, "commits": 4, "created_at": "1566477825", "deletions": 17, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "requires-external", "simulation-approved", "tests-approved"], "merge_commit_sha": "d2ccb12c2ece0d6bbad0c19a70cc719dd35f2c63", "merged_at": "1568614815", "merged_by": "cmsbuild", "milestone": "CMSSW_11_0_X", "number": 27823, "release-notes": [], "review_comments": 31, "state": "closed", "title": "Simulation of APV dynamic gain", "updated_at": "1568614815", "user": "EmyrClement"}