{"additions": 1, "auther_ref": "fix_emission_veto_bb4l", "auther_sha": "05ab98442c6276b47c225f0669953e55e62dc3ba", "author": "lauridsj", "body": "#### PR description:\r\n\r\nThis PR fixes a bug in the Pythia showering hook specific to the bb4l generator, described in #40459.\r\nbb4l generates up to three real emissions at the LHE level - one from the initial state, and one each from two possible top quarks. This requires a special shower hook to handle, implemented in CMSSW in PowhegHooksBB4L.h. The showering is set up in such a way that emissions that are outside a resonance, i.e. do not come from top quarks, are handled by the normal EmissionVetoHook1.cc hook, while PowhegHooksBB4L.h handles emissions that are inside a resonance.\r\n\r\nLooking at the single changed line, it can be clearly seen that the condition in the code needs to be changed for this to happen correctly - if the emission is in resonance, the EmissionVetoHook should not consider it (i.e. return false to not proceed to the actual vetoing), and leave it up to PowhegHooksBB4L.\r\n\r\nDue to the second part of the if condition, it is clear that only bb4l is affected.\r\n\r\n#### PR validation:\r\n\r\nI tested this change against a standalone pythia setup that uses a hook provided by the bb4l authors. Changes are only minimal, and only in variables that are very sensitive to FSR. There is a small change due to the fix in the number of jets, seen [here](https://www.desy.de/~lauridsj/bb4l_evhook/CMS_2018_I1703993_d187-x01-y01.pdf) as well as angular variables between jets, e.g. dR of the first two light jets [here](https://www.desy.de/~lauridsj/bb4l_evhook/MC_TTBAR_twolep_jetl_1_jetl_2_dR.pdf). In both cases the fixed version agrees with the standalone setup. Lepton observables seem unaffected.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR will need to be backported to CMSSW 10 for UL event generation and, eventually, to CMSSW 12 for Run 3 event generation.\r\n", "branch": "master", "changed_files": 1, "closed_at": "1690693798", "comments": 8, "commits": 1, "created_at": "1689325432", "deletions": 1, "labels": ["generators-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "ab7d1b3e49a1804aea165bdd40a633ed6a0a63b4", "merged_at": "1690693798", "merged_by": "cmsbuild", "milestone": "CMSSW_13_3_X", "number": 42264, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Fix EmissionVetoHook for BB4L", "updated_at": "1690693798", "user": "lauridsj"}