{"additions": 220, "auther_ref": "MG_millepedeRootBinaries", "auther_sha": "3f1981a54e200db347b3c223ea614d309f14a067", "author": "goblirsc", "body": "#### PR description:\r\n\r\nThis PR enables optional support for ROOT-based Millepede binaries in alignment jobs.\r\nRequires an up-to-date (V04-19-00 or later) Millepede-II installation, and deactivated by default. \r\nThe new binaries can be enabled by specifying the keyword `useRootIO` in the `alignment_config.ini`, with any value. \r\nIf enabled, ROOT binaries and tree files will be read directly from EOS using xrootd, and no files will be locally staged to the `pede` runner node. This allows to avoid disk quota limitations. \r\n\r\nThe PR also adds a second new option to the `alignment_config` - `millepedeLocation` allows to specify a custom Millepede-II installation to use. This removes the need to copy locally modified run scripts / configs to use the MKL-capable local Millepede on the CAF. \r\n\r\nChanges should leave output fully invariant, regardless of the `useRootIO` setting.  \r\n\r\n#### PR validation:\r\n\r\nTested by running an alignment campaign without and with the modified code, with and without ROOT I/O, and obtaining identical output in all cases. \r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR may need to be backported to CMSSW_15_0_X for use in Run 3 alignment if so desired. \r\n\r\n<!-- Please replace this text with any link to the master PR, or the intended backport release cycle numbers -->\r\n\r\nBefore submitting your pull requests, make sure you followed this checklist:\r\n- verify that the PR is really intended for the chosen branch\r\n- verify that changes follow [CMS Naming, Coding, And Style Rules](http://cms-sw.github.io/cms_coding_rules.html)\r\n- verify that the PR passes the basic test procedure suggested in the [CMSSW PR instructions](https://cms-sw.github.io/PRWorkflow.html)\r\n\r\nTest still in progress, currently marking as \"Draft\" \r\n\r\n<!-- Please delete the text above after you verified all points of the checklist  -->\r\n", "branch": "master", "changed_files": 16, "comments": 3, "commits": 3, "created_at": "1765277801", "deletions": 102, "labels": ["alca-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-rejected", "trk"], "milestone": "CMSSW_16_0_X", "number": 49579, "release-notes": [], "review_comments": 0, "state": "open", "title": "Draft: allow using ROOT I/O in Millepede alignment jobs", "updated_at": "1765279304", "user": "goblirsc"}