{"additions": 219, "auther_ref": "MG_millepedeRootBinaries", "auther_sha": "1cfa61f63cc92531021caa2ce905fafd94f53437", "author": "goblirsc", "body": "#### PR description:\r\n\r\nThis PR enables optional support for ROOT-based Millepede binaries in alignment jobs.\r\nRequires an up-to-date (V04-19-00 or later) Millepede-II installation, and deactivated by default. \r\nThe new binaries can be enabled by specifying the keyword `useRootIO` in the `alignment_config.ini`, with any value. \r\nIf enabled, ROOT binaries and tree files will be read directly from EOS using xrootd, and no files will be locally staged to the `pede` runner node. This allows to avoid disk quota limitations. \r\n\r\nThe PR also adds a second new option to the `alignment_config` - `millepedeLocation` allows to specify a custom Millepede-II installation to use. This removes the need to copy locally modified run scripts / configs to use the MKL-capable local Millepede on the CAF. \r\n\r\nChanges leave output fully invariant, regardless of the `useRootIO` setting.  \r\n\r\n#### PR validation:\r\n\r\n- Tested running an alignment campaign with the modified code and the \"new\" V04-19 series Millepede - standard binaires\r\n- Tested running an alignment campaign with the modified code and the \"new\" V04-19 series Millepede - ROOT binaires with xrootd I/O \r\n- Testing running an alignment campaign with the modified code and the \"old\" V04-16 series Millepede (only supports standard binaries)\r\n\r\nIdentical outputs, residuals, and fit metrics in all cases, and all three match the result obtained in the original campaign with production CMSSW and V04-16 Millepede. \r\n\r\nOngoing test:\r\n- Large campaign with long run-time to quantify performance impact\r\n\r\nMR marked as `Draft` until these two finish. In case of success, no further code changes foreseen.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNo backport is foreseen to be needed. \r\n\r\nBefore submitting your pull requests, make sure you followed this checklist :heavy_check_mark: \r\n\r\n", "branch": "master", "changed_files": 16, "comments": 8, "commits": 4, "created_at": "1765277801", "deletions": 101, "labels": ["alca-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "trk"], "milestone": "CMSSW_16_0_X", "number": 49579, "release-notes": [], "review_comments": 0, "state": "open", "title": "Draft: allow using ROOT I/O in Millepede alignment jobs", "updated_at": "1765294575", "user": "goblirsc"}