{"additions": 289, "auther_ref": "phase1pixeldqm-booking-and-markers", "auther_sha": "9a65c7bdba7bf2eabeaf7bb06b4c26efb6067553", "author": "schneiml", "body": "This PR contains a number of different changes that accumulated over time.\n- The main one is a slight restructuring in the booking process. This allows correctly computing the axis ranges for many more 2D plots (main application are 2D maps per layer, where ladder counts vary per layer). I am not happy with what the code looks like now, but it seems unlikely there is a simpler solution.\n- With this change,  it also makes sense to add ROCs to the booking process. No real usages now, but 2D maps with ROC granularity will come. Main drawback here is that it slows down the booking process 4x. But if we figure out it is to slow, there is loads of low-hanging fruit to make it faster.\n- There was a problem with how plugins were declared in the SiPixelPhase1Common package. It was pure luck that this worked before, it should be fixed now.\n- There is an experimental version of a plot that was recently added to the Phase0 DQM. Not really useful yet, but it uncovered above problem.\n- The CMSSW side support for adding blue layer/shell/etc. separator lines to the DQM gui is finally added here. To work, this needs support in the DQM GUI, which is merged already and should appear with the September release. W/o this support, the plot labels will look  bit messed up, but by the time this code makes it to the RelVals the GUI should also have it. \n\n(also @fioriNTU @davidcarbonis @lunik1 )\n", "branch": "CMSSW_8_1_X", "changed_files": 11, "closed_at": "1473171347", "comments": 7, "commits": 6, "created_at": "1472924598", "deletions": 107, "labels": ["comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "239108b39af69a4376def1940e7ab38d6d3295b1", "merged_at": "1473171347", "merged_by": "cmsbuild", "milestone": "Next CMSSW_8_1_X", "number": 15719, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Phase1 Pixel DQM Booking changes and GUI markers", "updated_at": "1473171348", "user": "schneiml"}