{"additions": 14, "auther_ref": "from-CMSSW_12_2_X_2021-11-14-0000", "auther_sha": "2fe14d6b98fa4c99cf0ecd947dd9614d7507a2f0", "author": "sbein", "body": "\r\n#### PR description:\r\n\r\nThis PR fixes a bug creating a problem first identified in \r\n\r\nhttps://hypernews.cern.ch/HyperNews/CMS/get/famos/765.html\r\n\r\nJaebak found that some b- and d-mesons produced in the decays of exotic particles, which cross the beam pipe radius, have their decay performed twice, with sim hits created for each copy. This causes problems for some high-pT b-jets, as well as the MET in events that contain such jets. A few lines are added to ParticleManager.cc which results in FastSim deciding to not decay such particles further, and rather take only the original generator-determined decay trees. FastSim will still propagate these particles and create secondaries/material interactions, but it won't decay them. \r\n\r\n#### PR validation:\r\n\r\nThis issue was also seen in signal events of a Bulk Graviton model G->HH, H->bb, where G has a mass > 1 TeV and H is the SM Higgs boson. The bug fix in this PR results in a stark improvement of the jet response at high pT:\r\n\r\nhttps://www.desy.de/~mrowietm/fastsimplots/graviton_exotic/fastsim_comparison/comparison.png\r\n\r\nBy construction, neither the original problem or these changes will affect purely SM events. \r\n\r\nThis PR will need to be backported to any and all production releases that may be used for BSM signal MC production. \r\n", "branch": "master", "changed_files": 2, "closed_at": "1638359859", "comments": 17, "commits": 4, "created_at": "1636922662", "deletions": 5, "labels": ["fastsim-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "f0fde9d28801295713095f7be0c45ea1f2ef6429", "merged_at": "1638359859", "merged_by": "cmsbuild", "milestone": "CMSSW_12_2_X", "number": 36122, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Fix for FastSim decays of exotic-descendent SM particles decaying outside pipe", "updated_at": "1638359859", "user": "sbein"}