{"additions": 6, "auther_ref": "patch-2", "auther_sha": "9b57d8ca610b764a1820526ffa1c5a50fd91f061", "author": "kbunkow", "body": "L1Trigger/L1TMuonOverlapPhase1/python/simOmtfDigis_cfi.py: added parameters configXMLFile and patternsXMLFile corresponding to the 2024 OMTF firmware to the stage2L1Trigger_2024 era modifier. This is needed since there are problems with uploading the 2024 OMTF params to the condDB.\r\n\r\nThe files\r\nL1Trigger/L1TMuon/data/omtf_config/hwToLogicLayer_0x0009.xml\r\nL1Trigger/L1TMuon/data/omtf_config/Patterns_ExtraplMB1nadMB2SimplifiedFP_t17_classProb17_recalib2_minDP0_v3.xml\r\nare in the CMSSW_DATA.\r\n\r\n#### PR description:\r\nUp to now, the OMTF emulator configuration parameters were stored in the condDB. The new parameters were uploaded to the condDB with the use of the \"manual o2o\" procedure. Unfortunately, the knowledge of how to execute this procedure was lost, and despite a few trials, the upload of the OMTF params corresponding to the firmware deployed at P5 in March of 2024 was unsuccessful. Therefore, with this PR, the emulator will be configured from the appropriate XML files, provided the Era Run3_2024 is defined for the job.\r\nThis will fix the data-emulator mismatches present in the DQM since the beginning of the 2024 pp run. Besides, will ensure the upcoming 2024 MC production will use the 2024 OMTF algorithm version.\r\n\r\n#### PR validation:\r\n\r\nThe PR was validated by running the L1T DQM on one file from run 385422. The data-to-emulator mismatches for the OMTF are at the level of 0.5%, which is the expected level when the OMTF is properly configured.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is a backport of https://github.com/cms-sw/cmssw/pull/45984.\r\n", "branch": "CMSSW_14_0_X", "changed_files": 1, "comments": 4, "commits": 1, "created_at": "1726558346", "deletions": 0, "labels": ["l1-pending", "pending-signatures", "orp-pending", "tests-started", "backport-ok"], "milestone": "CMSSW_14_0_X", "number": 46013, "release-notes": [], "review_comments": 0, "state": "open", "title": "Added Era_Run3_2024 modifier to simOmtfDigis, to use OMTF 2024 config (14_0_X)", "updated_at": "1726559350", "user": "kbunkow"}