{"additions": 318, "auther_ref": "CMSSW_15_1_X", "auther_sha": "9daabf3beaf6d815d7ffbcf5f133118fa5be7b15", "author": "lrobertshaw", "body": "#### PR description:\r\n\r\nAdded logic for calculating jet mass in simulation where no approximations are made. Also added logic for firmware emulation which is bit-accurate to firmware implementation and makes a number of approximations for firmware efficiency. To integrate this work with the various taggers, a number of changes were made to the datatypes which the jet mass is read out to.\r\n\r\n#### PR validation:\r\n\r\nResolution plots produced and compared with existing algorithms which already calculate mass (AK8) to check that the mass is similar. Simulation and emulation checked to match up well. Emulator and firmware match validated by GitLab CI pipelines in CMS-cactus repository and via running tests locally.\r\n\r\n#### Edit: extra context added after PR was opened:\r\nBelow are two links for the slides from the two talks I gave on this, the first one contains the resolution plots comparing the SC8 PUPPI jet mass to AK8 PUPPI jet and AK8 gen jets without low pT constituents. I have also attached plots showing the performance of a hypothetical jet pT OR jet mass trigger, one plot being as a function of generator jet pT and the other as a function of generator jet mass. The takeaway is that at a fixed rate of 60 kHz, you increase the level-1 acceptance from 73.5% to 81.0% on a sample containing hypothetical Higgs bosons of masses 20, 40, 60 and 80 GeV, decaying to merged jets. How this extra level-1 acceptance should be utilised upstream is not yet decided - this trigger slightly boosts the offline acceptance (by a few %) of the existing pT seed, but an offline seed based on mass would gain more.\r\n\r\n![image](https://github.com/user-attachments/assets/f038ab00-d7a5-49aa-b9c1-827cdf2d0095)\r\n![image](https://github.com/user-attachments/assets/75fce87b-7c7f-456d-bd25-861c11f5869a)\r\n[jet_tagging_2.pdf](https://github.com/user-attachments/files/19956393/jet_tagging_2.pdf)\r\n[jet_tagging_1.pdf](https://github.com/user-attachments/files/19956394/jet_tagging_1.pdf)\r\n\r\n\r\nCommits squashed into one for the PR, below are all commit messages:\r\n\r\n- Adding another commit to squash ahead of PR\r\n- Squashing 38 previous commits relating to jet mass ahead of opening pull request\r\n- added logic for calculating jet mass and added this mass to the jet mass value, values printed to screen to ensure they are being set but currently mass not present in ntuples - default value of 0 present\r\n- changes for calculating jet mass in SW imp\r\n- Added code to use external seeds for SW implementation\r\n- removed printing for debug info\r\n- modified SC jet emulator header file to support jet mass inside l1ct jet type, then changed jet producer plugin to fill the EDM jet with this mass and also changed jet emulator src code makeJet_HW function so it calculates something, though its not correctly the jet mass\r\n- added mass calculation to emulator following same method as firmware imp, but without LUTs\r\n- pt_t doesnt have good enough precision for squared values - changed to use floats for now\r\n- converted eta/phi to from global to relative for jet mass calculation\r\n- changed emulator imp to use fixed types which give same precision as float with as few bits as possible\r\n- changed code to use LUTs as implemented in firmware instead of using cpp math functions\r\n- added code to sort and truncate constituents before passing to jet mass function, uses identical types to firmware\r\n- introduced preprocessing steps to jet mass function to replicate the format that constituents are received as in firmware\r\n- Fix eta/phi fiducial check for charged PUPPI candidates\r\n- Replace the isFiducial(hwEta, hwPhi) call for charged PUPPI candidates to use hwVtxEta and hwVtxPhi instead of hwEta and hwPhi.\r\n- modified datatypes and methods to handle jet mass\r\n- Use seed passed in to makeJet_HW as starting point for jet axis.\r\n- fixes after rebase\r\n- Cleaning up code and synchronising with p2l1pfp CMSSW fork\r\n- restored L1CaloTrigger package\r\n- added SC8 sim jets to the emulator chain\r\n- fixed a bug with calculating sim jet mass\r\n- cleaned up how LUTs are produced and synchronised with how it is done in firmware\r\n- removed old commented out code\r\n- added floatMass method to gt namespace\r\n- code-format and code-checks stylistic modifications\r\n- Fix handling of phi wrap around.\r\n- changed gt jet equality operator to also check mass\r\n- populate edmJet using GT jet mass\r\n- changes for testing using mass2\r\n- Put jet mass on second jet word.  Add helper function for unpacking two-word jets.\r\n- made changes to use second word to store jet mass squared, instead of first word for jet mass\r\n- just code-checks and code-formats changes\r\n- store unsorted parts not truncated, sorted sparse parts as causes segfault\r\n- trying to fix seg fault\r\n- increasing bit width to allow for second word in l1ct::jets\r\n- fixed bug with LUTs due to compiler dependent rounding vs truncation order\r\n- Set mass to 17 bits and replace b tag score so that the CT jet is 64 bits.\r\n- code-checks and code-format\r\n- added sc8 corrected just to python config\r\n- Define separate GT Jet format for wide cone jets.\r\n- removed old commented out code", "branch": "master", "changed_files": 10, "closed_at": "1746678579", "comments": 40, "commits": 11, "created_at": "1743751903", "deletions": 51, "labels": ["l1-approved", "fully-signed", "tests-approved", "orp-approved", "upgrade-approved", "code-checks-approved", "changes-dataformats"], "merge_commit_sha": "c9fa67229c98ba3291f301551098beb1d4ee68a8", "merged_at": "1746678579", "merged_by": "cmsbuild", "milestone": "CMSSW_15_1_X", "number": 47792, "release-notes": [], "review_comments": 26, "state": "closed", "title": "[L1T] PR containing simulation and emulation related to jet mass reconstruction (Phase-2)", "updated_at": "1746678581", "user": "lrobertshaw"}