{"additions": 2414, "auther_ref": "cq-btlv4-20250204", "auther_sha": "0e9e960ac212b7acef372ff304463404a921fa3b", "author": "cquarant", "body": "#### PR description:\r\n\r\nThis PR is the re-implementation of PR [#46977](https://github.com/cms-sw/cmssw/pull/46977), that was reverted by the following PR [#47115](https://github.com/cms-sw/cmssw/pull/47115) because of the backward compatibility issue described in detail in PR [#47114](https://github.com/cms-sw/cmssw/issues/47114).\r\n\r\nThe new implementation of the BTLDetId class and corresponding BTLNumberingScheme features two numbering schemes that coexist. The first is identical to the old one, and it is used when running simulation in BTL geometry scenarios v2 and v3 (geometry v1 is deprecated and not available anymore), the second is the new BTLDetId, used in v4 geometry, whose features are described in PR [#46977](https://github.com/cms-sw/cmssw/pull/46977). From the geometric layout point of view, v4 is identical to v3, and is used just to cleanly separate the use of old and new numbering scheme.\r\n\r\nThe two versions of BTLDetIds have two different explicit constructors. A dedicated bit of the BTLDetId itself identify which version of the id is used. All methods implemented to derive the id number of a BTL partition (crystal, sensor module, detector module, readout unit, tray) work in all scenarios. The mapping of these elements are described in two separate DNs for the two cases:\r\n[DN-23-006](https://icms.cern.ch/tools/publications/notes/entries/DN/2023/006) for geometry v2-v3, and  [DN-24-014](https://icms.cern.ch/tools/publications/notes/entries/DN/2024/014) for v4.\r\n\r\nThe new numbering scheme also introduces a mapping for the electronic components of BTL, as described in [DN-24-014](https://icms.cern.ch/tools/publications/notes/entries/DN/2024/014), valid only for the updated version of the BTLDetId and in geometry v4.\r\n\r\n\r\n#### PR validation:\r\n\r\nAll unit tests are functional, with new reference files provided for scenario D110 to account for a minor change in the top level volume in the MTDNumberingBuilder part, and of the revised meaning of RU identifier. Extensive tests have been done on SingleMu samples, showing that the old and new numbering scheme provide consistent results. The BTLDetId ordering affects the digitization, although with no physical meaning and impact, therefore identity should not be expected , just statistical consistency.\r\n", "branch": "master", "changed_files": 35, "comments": 23, "commits": 22, "created_at": "1739540473", "deletions": 233, "labels": ["reconstruction-pending", "simulation-pending", "geometry-pending", "operations-pending", "pending-signatures", "tests-pending", "orp-pending", "pdmv-pending", "upgrade-pending", "code-checks-approved", "tracking"], "milestone": "CMSSW_15_1_X", "number": 47353, "release-notes": [], "review_comments": 10, "state": "open", "title": "MTD Geometry - BTL numbering scheme update with correction for backward compatibility", "updated_at": "1740404773", "user": "cquarant"}