{"additions": 0, "auther_ref": "jetCorrectorMigrationHcalCalibAlgos", "auther_sha": "70424d51d9b97a40aa39a2520b902b8bf82a9962", "author": "wddgit", "body": "#### PR description:\r\n\r\nPlease let me know if you want me to approach this migration in a different way. I am not an expert on this area of the code and am open to suggestions.\r\n\r\nThis is part of an effort to finish the migration from ::JetCorrector to reco::JetCorrector that started in 2014, ::JetCorrector has been deprecated since then. This is related to calling consumes for data that we need to get. The goal is to delete the header JetMETCorrections/Objects/interface/JetCorrector.h in the near future. \r\n\r\nThe approach in the current version of this PR deletes all the relevant files. I am proposing this approach because I noticed the following:\r\n\r\n- These test modules are old (years) and there is no recent development other than generic maintenance\r\n- The files deleted by this PR are the only files in CMSSW that reference the two modules that are deleted.\r\n- There are no tests that run in the IBs for these modules.\r\n- The test configurations deleted have input that is very old\r\n- I have some suspicions that the deleted configurations would fail for other reasons.\r\n\r\nSome other alternatives:\r\n\r\n- Spend the development time and effort to migrate the modules to use reco::JetCorrector instead of ::JetCorrector. If these modules are important, I could try to do this if it does not take too long.\r\n- Comment out the JetCorrector part, add an assert that will cause it to obviously fail, and add a comment that someone needs to fix this in the future. It could be fixed if and when someone needs it or a Calibration expert could take care of it when it is convenient.\r\n- If a Calibration expert is available and has the time to deal with this soon, then I'd be happy to close this PR and let that expert take care of this.\r\n- Something else. I am open to suggestions.\r\n\r\n#### PR validation:\r\n\r\nNothing uses this other than the test configurations which are also deleted. I do not think there are any tests in CMSSW that run the deleted modules.\r\n\r\nFYI @makortel @Dr15Jones \r\n", "branch": "master", "changed_files": 10, "comments": 15, "commits": 1, "created_at": "1666296092", "deletions": 4394, "labels": ["alca-pending", "pending-signatures", "tests-approved", "orp-pending", "hold", "code-checks-approved"], "milestone": "CMSSW_12_6_X", "number": 39804, "release-notes": [], "review_comments": 0, "state": "open", "title": "JetCorrector migration, Calibration/HcalCalibAlgos", "updated_at": "1669125245", "user": "wddgit"}