{"additions": 26, "auther_ref": "eta-window-errorcheck_14_1_X", "auther_sha": "716095303756a329ebd496da5489e556d9b111f1", "author": "nabrandman", "body": "#### PR description:\r\n\r\nChecks the eta windows as they are read in from the menu to ensure that the lower bound is in fact less than or equal to the upper bound. If the lower bound is larger than the upper bound, prevents this eta window from being used as a condition and propagates an error message.\r\nWhen testing menu L1Menu_Collisions2024_v1_0_0 mismatches where found between firmware and emulator for displaced dimuon seeds (as discussed in this JIRA ticket: [https://its.cern.ch/jira/browse/CMSLITDPG-1221](https://its.cern.ch/jira/browse/CMSLITDPG-1221)), it was eventually discovered that the source of the mismatches was an eta window where the minimum and maximum values had been switched. This PR should help ensure that in the event that this happens again it can be caught and rectified far more quickly.\r\n\r\nNo changes to the output are expected.\r\nThis PR does not depend on any other PRs or externals.\r\n<!-- Please replace this text with a description of the feature proposed or problem addressed, specifying:\r\n  - what changes are expected in the output if any, \r\n  - what other PRs or externals it depends upon if any,\r\n  - link to any additional material useful to provide a documentation for this PR (slides, JIRA tickets, related pull requestes, hypernews, TWiki or Indico pages)  -->\r\n\r\n#### PR validation:\r\n\r\nPerformed runTheMatrix with -l 11634.0, passed 5 out of 5 tests.\r\nTest vector code was in agreement with firmware for both the original menu with the faulty eta cuts, and for an updated menu with corrected eta cuts.\r\n\r\nChanges were checked against \"scram build code-format\" to ensure they followed CMS Naming, Coding and Style Rules.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport.", "branch": "master", "changed_files": 1, "comments": 10, "commits": 1, "created_at": "1724846447", "deletions": 4, "labels": ["l1-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_14_2_X", "number": 45827, "release-notes": [], "review_comments": 3, "state": "open", "title": "Checks eta windows from the L1Trigger menu to ensure minimum <= maximum", "updated_at": "1726247557", "user": "nabrandman"}