{"additions": 901, "auther_ref": "CaloParticleFromGraphs", "auther_sha": "96cd3e6ce6134e3086f5c2e0d9f979d2b6b2c371", "author": "rovere", "body": "While doing work on HGCAL, I stumbled upon the CaloParticles several times. In order to \"learn&understand\" what they are and how they are produced, I took a look at the CaloTruthAccumulator, which is the package responsible for their creation. I found the code to be rather convoluted and overly complicated. I decided to rewrite it from scratch, keeping the same functionalities (ie the ones I could reverse engineer from the code itself and from the many printouts I added), using graphs, since particle decays are \"naturally\" described by graph (and their algorithms).\r\n\r\nThis is what I came up with: I believe this code is more compact, clean and understandable with respect to the original one.\r\n\r\nI slightly changed the meaning of the embedded simClusters for CaloParticles that decay within a certain distance from HGCAL, since in the previous implementation all children were artificially collapsed under the original particle, while now they are added one-by-one as children with their own simClusters.\r\n\r\nBesides this change, from quick tests on single particle guns (mu, e, pi), I did not notice any difference. While I trust the algorithm I wrote, I'm not sure the old one was fully capturing all simClusters at all levels of the decay chain. So I do not exclude that there won't be any regression.\r\n\r\nFrom the performance point of view, I noticed no difference in terms both of CPU and memory (on a limited number of samples, no PU, 10 events each).\r\n\r\n", "branch": "master", "changed_files": 5, "comments": 34, "commits": 24, "created_at": "1513171689", "deletions": 539, "labels": ["code-checks-approved", "comparison-pending", "new-package-pending", "orp-pending", "pending-signatures", "simulation-pending", "tests-pending", "upgrade-pending"], "milestone": "CMSSW_10_0_X", "number": 21701, "release-notes": [], "review_comments": 19, "state": "open", "title": "Calo particle from graphs", "updated_at": "1513672969", "user": "rovere"}