{"additions": 713, "auther_ref": "fix_MuonTrackProducer_and_muonHLTvalidation", "auther_sha": "709db16fb329d9f3283008c96a4b96a7c389c9e3", "author": "abbiendi", "body": "This PR is meant to fix the muon HLT validation, which has not been running as wished for the new HLT reconstruction (few validation modules not working) . To do so an extension of the MuonTrackProducer is needed, to deal correctly with the various kinds of muon tracks, which can have muon/tracker/mu+tracker hits. Validation of L2Muons is also recovered as it used to be there as an essential step in the chain.\r\nTaking this occasion the offline validation is also completed, adding the highest-level reco::Muon objects to the standard validation: PF, TuneP, and All muons which were still missing it. \r\nThe customization for the Run3 and Phase2 scenarios has been modified to bring Run3 to the complete validation sequence, while still keeping Phase2 with a reduced sequence.\r\n\r\nA bug has been fixed in the logic of the MuonTrackProducer which is now used for the new modules (not affecting already existing workflows, that's why perhaps it went unobserved from 740 to now).\r\n\r\nA flat-P (total momentum) particle gun generator has been added, which has already been widely used within the Muon POG, particularly useful for studying the performance of high-momentum muons. \r\n\r\n#### PR validation:\r\n\r\nTested on CMSSW_11_0_0_pre3 RelVals for ZMM_14TeV RelVals for 2021 scenario with and without PU:\r\n- rerunning step2+step3+step4 for no-pileup  (hence testing all the new features)\r\n- rerunning step3+step4 for 2021 PU scenario\r\n- also on few events from single muon gun with pt=100 and the new flat-P gun\r\nAll the new results make sense.\r\nThe PR can be tested simply with the standard matrix test.\r\nNone of the existing validation modules will change.\r\n", "branch": "master", "changed_files": 8, "closed_at": "1579021342", "comments": 37, "commits": 8, "created_at": "1576794591", "deletions": 371, "labels": ["code-checks-approved", "comparison-available", "dqm-approved", "fully-signed", "generators-approved", "orp-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "c487ee83547a2ab31ddbfb8d43243a4f2d0223ec", "merged_at": "1579021342", "merged_by": "cmsbuild", "milestone": "CMSSW_11_1_X", "number": 28662, "release-notes": [], "review_comments": 5, "state": "closed", "title": "Fix muon track producer and muon hl tvalidation", "updated_at": "1579021343", "user": "abbiendi"}