{"additions": 269, "auther_ref": "mm_dev_beamspot_checker", "auther_sha": "8f9313e751991951e4bae3eb103bf2cefbb86480", "author": "mmusich", "body": "#### PR description:\r\n\r\nPR https://github.com/cms-sw/cmssw/pull/45589 introduced `BeamSpotCompatibilityChecker` an `edm::global::EDAnalyzer` designed to compare the Beam Spot payload in the Database with the one (potentially) available as a collection in the input data.\r\nThis is useful when e.g. refitting tracks from file and using a `GlobalTag` (too much) different from the one used for the original processing. This would allow the user to catch the configuration mistake and correct it.\r\nAs per internal discussion with the alignment conveners I add this module to *all* the the cmssw paths present in the configuration files related to the alignment offline validation package. This should allow to catch early on during the validation procedure if the configuration used for the validation is inconsistent (the users can still allow to use stale beam spot conditions via the all-in-one meta configuration language be it `yaml` or `json`).\r\nUnit tests of the package are changed in order to allow them to pass automatic execution.\r\nFinally commit ac940687a2eaa65259835d3aa168c85a1d9c420e adds the `offlineBeamSpot` collection to the `TkAlZMuMu` and `TkAlDiMuonAndVertex` data-tiers. \r\nThis is useful in order to apply the same sort of checks also to the resonant di-muon based validations. The increase in data volume should be negligible. \r\n\r\n#### PR validation:\r\n\r\n`scram b runtests` runs fine.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNot a backport, could be backported if there is interest.\r\n\r\nFYI: @henriettepetersen @TomasKello ", "branch": "master", "changed_files": 21, "comments": 5, "commits": 3, "created_at": "1736150154", "deletions": 61, "labels": ["reconstruction-pending", "alca-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending", "tracking", "trk"], "milestone": "CMSSW_15_0_X", "number": 47044, "release-notes": [], "review_comments": 10, "state": "open", "title": "Add `BeamSpotCompatibilityChecker` to all alignment offline validation configuration files", "updated_at": "1736176280", "user": "mmusich"}