{"additions": 816, "auther_ref": "ape-parallel-features", "auther_sha": "1d4589385fe873b1a4c2c8ed23a25cb0065830b9", "author": "mteroerd", "body": "All of the updated and newly added code incorporates the python print migration.\r\n\r\nThis PR consists of three commits:\r\n1. 92b8f88 fixes a small typo in one of the rarely used macros for validation plots.\r\n\r\n2. 9072dbb consists of an update to the SkimProducer and AlignmentTrackSelector on one hand to ease the configuration of skims. On the other hand, a new python script startSkim.py was created to use alternatively to skimProducer.bash. This new script enables parallel execution of skims as well as automatic renaming of the output files (from *00N.root to *_(N+1).root which is the input name format needed for the APE measurements) and moving of the skimmed files to a target directory.\r\n\r\n3. 7323657 adds additional optional input parameters to the central _cfg.py files used for a measurement. When using the standard workflow, these parameters are unused and nothing changes. However, the commit also includes a new folder autoSubmitter which includes a script to configure and submit multiple measurements at the same time in order to be able to do multiple measurements at once using only one CMSSW-environment. \r\nAll changes allow for the use of the old workflow which is detailed in the TWiki ( https://twiki.cern.ch/twiki/bin/view/CMSPublic/SWGuideAlignmentPositionErrorEstimator ), however now APE objects are no long written to and read from hists/apeObjects but instead hists/workingArea/apeObjects (see 2dcad6d and 1d45893 ).", "branch": "master", "changed_files": 12, "closed_at": "1533708252", "comments": 12, "commits": 5, "created_at": "1533290566", "deletions": 161, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "07a3c4c35fd53b66a8decfd56089084b79b7f52e", "merged_at": "1533708252", "merged_by": "cmsbuild", "milestone": "CMSSW_10_3_X", "number": 24192, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Ape parallel features", "updated_at": "1533708252", "user": "mteroerd"}