{"additions": 12790, "auther_ref": "mtd_geometries_part1", "auther_sha": "b2af0d92111f86adc47f37d06471e69253ad516a", "author": "lgray", "body": "This pull request introduces all necessary changes to automatically generate MTD Topology, Geometry, and DetLayerGeometry necessary for digitization and tracking. It also introduces the notion of a FTLTrackingRecHit in its first revision, which will evolve in Part 2. I chose the present breakpoint since the number of packages to recompile was starting to become rather large, it would be good to introduce these changes into CMSSW so that further development can be faster and more focused.\r\n\r\nThe MTDGeometry is implemented similar to the phase 2 tracker geometry, with a geography up to the modules being described in detail, and then individual descriptions of varying module types indicating the pixel topology in rows, columns, and ROCs.\r\n\r\nThe GlobalTrackingGeometry class is extended to understand that the MTD exists.\r\n\r\nPart 2 to begin to address the extensions of the track class, and implement the proper navigation and hit assignment mechanisms.\r\n\r\n@fabiocos The one thing that remains for the BTL part of the geometry is to write the mapping between the crystal number in the det id and the row/column and ROC number as it is done in the Pixel Topologies. This should be quick.\r\n\r\n@fabiocos @bendavid @casarsa", "branch": "master", "changed_files": 211, "closed_at": "1536298588", "comments": 114, "commits": 1, "created_at": "1534259114", "deletions": 559, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "db-approved", "fully-signed", "geometry-approved", "orp-approved", "reconstruction-approved", "simulation-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "bb805a54741f20befc4a63bb72760c70b00247f8", "merged_at": "1536298588", "merged_by": "cmsbuild", "milestone": "CMSSW_10_3_X", "number": 24285, "release-notes": [], "review_comments": 157, "state": "closed", "title": "MTD Tracking Part 1 - Topology, Geometry, and Tracking Geometry", "updated_at": "1536298588", "user": "lgray"}