{"additions": 243, "auther_ref": "cmsTritonBugFixes", "auther_sha": "ec8dda148e52b0e963f525a8638ea5c238f21602", "author": "kpedro88", "body": "#### PR description:\r\n\r\nRollup of several pending bug fixes and improvements, primarily aimed at the `cmsTriton` server management script:\r\n1. Some relval jobs have been seeing timeouts when starting the local fallback server if the server image (hosted on `/cvms/unpacked.cern.ch`) is not already loaded in the worker node's cache. It does not appear to be possible for a non-privileged user to check if something is in the cvmfs cache or not, so the default server start timeout is just extended to minimize these failures.\r\n2. Thread control settings for the local fallback server are only used in the CPU case, not the GPU case.\r\n3. The OSG apptainer version is used by default if available. This avoids the need to propagate updated apptainer versions through a slew of different containers.\r\n4. The SONIC special workflows are extended to 14 TeV processes for Run 3.\r\n5. The `TritonService` will print the local fallback server log if the process is terminated because of an exception that could be related to the local fallback server. (This is denoted by a third argument in the `TRITON_THROW_IF_ERROR` macro.) During inference requests, which can be retried, an exception does not necessarily lead to process termination, so the notification to the `TritonService` can be undone in that case.\r\n6. The unit of the inference request timeout can now be selected. (This was useful for testing the above feature.)\r\n7. More granular verbosity control in the unit test script is now available; clients, the fallback server, and the `TritonService` itself can all be targeted separately.\r\n8. The unit test script is migrated from `VarParsing` to `argparse`, now that the latter works properly with `cmsRun`.\r\n9. The GPU driver check is skipped if the local fallback server is not using GPU.\r\n10. Fix handling of symbolic links in `checksum` and `versioncheck` modes of `cmsTritonConfigTool`\r\n11. Avoid throwing exceptions in `TritonMemResource` destructors (addresses #38260)\r\n\r\n#### PR validation:\r\n\r\nUnit tests pass.\r\n\r\nThe following command was used to test item 5:\r\n```\r\ncmsRun test/tritonTest_cfg.py --modules TritonGraphProducer --maxEvents 10 --timeout 1 --timeoutUnit microseconds --verboseService --device CPU --noShm\r\n```\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNot intended to be backported.\r\n", "branch": "master", "changed_files": 18, "comments": 22, "commits": 19, "created_at": "1706627146", "deletions": 142, "labels": ["pending-signatures", "tests-pending", "orp-pending", "pdmv-pending", "upgrade-pending", "code-checks-pending", "heterogeneous-pending"], "milestone": "CMSSW_14_1_X", "number": 43814, "release-notes": [], "review_comments": 10, "state": "open", "title": "cmsTriton bug fixes and improvements", "updated_at": "1707259677", "user": "kpedro88"}