{"additions": 269, "auther_ref": "pfclusteralgo_stability", "auther_sha": "f88a2d938b71e5c9f46a96871bc246241cfac750", "author": "lgray", "body": "Require that the sum of rechit fractions be of reasonable size to be sure you're not adding some rechit that is far away any cluster position.\n\nAn example case of the instability is as follows:\nsome rechit is, at closest, ~7-8 crystals away from any cluster position. This means that the largest rechit fraction is going to be ~1e-23. The smaller fractions from clusters even farther away can be ~1e-50, which is outside of double precision when you add them together. The resulting fraction can then randomly be one or very very slightly less than one.\n\nThe means that when the fractions are normalized a rechit that is very far away from any cluster can be randomly added _in its entirety_ to a cluster it simply doesn't belong to, and it can vanish for no reason when doing the position fit in PFClusterAlgo. This makes the algorithm convergence unstable.\n\nRequiring the rechit fraction sum to be larger than 1e-20 fixes this issue, since it ensures that at least one cluster is within about 10 shower-sigmas of the rechit. The only exception to this case are the rechit seeds, which shouldn't move very from from the cluster position on average.\n\nNote: this can change the final positions and energies of PFClusters (especially low-energy clusters) in all sub-detectors, but should not affect higher-level physics objects.\n", "branch": "CMSSW_7_1_X", "changed_files": 5, "closed_at": "1393058953", "comments": 29, "commits": 4, "created_at": "1392583842", "deletions": 4, "labels": ["fully-signed", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "61d2f4724daeec68e5215ef2163339de6f9214d0", "merged_at": "1393058953", "merged_by": "ktf", "milestone": "CMSSW_7_1_0_pre5", "number": 2490, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Protection to stabilize the behavior of PFClusterAlgo", "updated_at": "1394439765", "user": "lgray"}