{"additions": 504, "auther_ref": "ecalpfcluscorfull_74x", "auther_sha": "0ca306eff7b741f2bb6609517ce814b7e01d36b2", "author": "bendavid", "body": "Adapt PFCluster energy correction code to use new regression weights in the conditions database (current implementation is using ESPrefer until this is available in a GT)\n\nThe PFAlgo also needed to be modified since it was still using hardcoded inlined corrections (taking the old corrections) instead of taking the corrected energy filled by the more modular correction scheme which @lgray added a while back.\n\nThe DataFormat change to CaloCluster adds just an additional float to store the uncertainty associated with the corrected energy (which is a new feature of the regression-based corrections which is not currently used anywhere, but intended to be used as input to the higher level electron and photon corrections)\n\nTwo caveats:\n1) The dataformat change introduces some potential issues with checksum and class version divergences and incompatibility once we try to backport this to 73x.  See https://hypernews.cern.ch/HyperNews/CMS/get/edmFramework/3433/1.html\n\n2) I am still running some internal closure tests against the standalone validation code for the regression training (to make sure there are no trivial mistakes like variables being defined in a way which doesn't match the training, or passed in the wrong order to the BDT's in the CMSSW class).  Assuming that these checks will be positive, physics checks of this pull request can already start in principle.  (but would maybe hold off merging it until the outcome of those tests is confirmed)\n", "branch": "CMSSW_7_4_X", "changed_files": 11, "closed_at": "1423168441", "comments": 80, "commits": 6, "created_at": "1423061486", "deletions": 106, "labels": ["comparison-available", "fully-signed", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "5a4c208c8ba1ac2beca07af75813ae415efb1b8a", "merged_at": "1423168441", "merged_by": "cmsbuild", "milestone": "Next CMSSW_7_4_X", "number": 7558, "release-notes": [], "review_comments": 11, "state": "closed", "title": "Ecal PFCluster corrections (74x)", "updated_at": "1423224847", "user": "bendavid"}