{"additions": 579, "auther_ref": "from-CMSSW_12_0_0_pre3-CSC-TPG-update-Run2", "auther_sha": "9da85734a578d6053724436975e0c708721981a0", "author": "dildick", "body": "#### PR description:\r\n\r\nThis PR is a collection of updates for Run-3 CSC trigger primitives (actually Phase-2 which we're moving forward by several years).\r\n* The functions in CSCCathodeLCTProcessor to separately read out ME1/ and ME1/b were removed. The readout for ME1/1 will remain unified throughout Run-3 \r\n* The class CSCMotherboardME11 which was originally designed for ME1/1 with a split readout for ME1/ and ME1/b was fully incorporated into the standard class CSCMotherboard. In phase-2 algorithms. Ultimately the only things that were different were (1) whether CLCTs could be re-used and (2) if the ALCT should only be matched to the first CLCT.\r\n* The LCTContainer that was introduced for Phase-2 studies OTMBs should actually also be in the CSCMotherboard. We've found this out by studying the old TMB firmware in more detail\r\n* The ALCT-CLCT matching is now done based on preferential CLCT delta BX [0,-1,1,-2,2,-3,3]. This is also how it has been done in the firmware since Run-1. Fortunately, for low pileup conditions this change has no effect. I checked this on the ZeroBias data.\r\n* A selectLCTs function was also added to the CSCMotherboard to select the best two LCTs in each BX with the new LCTContainer\r\n* The LCT and CLCT readout functions were made simpler. It is now more clear that the readout is centered around the LCT and CLCT central bunch crossings. Previously there was a disconnect between the \"early time bins\" and the central BX. The CLCT readout function was actually off by -1 BX, but because the data I analyzed had very low pileup or no pileup, it does not matter.\r\n* An upgrade that we had planned for Phase-2, i.e. increasing the number of CLCTs/LCTs that are read out, was rolled back. This is not in the firmware for Run-3. We only read out the first two CLCTs/LCTs.\r\n* CSC showers are only kept for Run-3\r\n* CSC DQM was equipped with a simple analysis of pre-triggers (by default turned off)\r\n* Documentation was added here and there for functions\r\n\r\n#### PR validation:\r\n\r\nCode was tested on 10k events of B904 cosmic data (to test Run-3 algorithm), and on 26k events of 2018D ZeroBias data Run 322022 (to test Run-2 algorithm). Chambers ME+1/1/9, ME+1/1/10 and ME+1/1/11 were excluded in this comparison because we had loaded prototype Phase-2 firmware on those chambers.\r\n\r\nPlots are added below. \r\n\r\n* Data vs emulator for B904 data: [DataVsEmulatorComparison_June2021.pdf](https://github.com/cms-sw/cmssw/files/6718580/DataVsEmulatorComparison_June2021.pdf)\r\n\r\n* Data vs emulator for ZeroBias data: [CSC_dataVsEmul_CMS_Run_322022.pdf](https://github.com/cms-sw/cmssw/files/6712905/CSC_dataVsEmul_CMS_Run_322022.pdf)\r\n\r\nAn improvement is seen for the B904 data. No change is seen for the 2018D ZeroBias data.\r\n\r\nThere are minor discrepancies in the ZeroBias data I'm still trying to understand. Second attached PDF file.\r\na) fewer ALCTs in emulation for ME1/1. It's about 1 every 1000 ALCTs (see page 11)\r\nb) emulation seems to be promoting 4- and 5-layer ALCTs to 6-layer (see page 2)\r\nc) fewer CLCTs in emulation. Also about in every 1000 CLCTs (see page 29)\r\n \r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nN/A\r\n\r\nBefore submitting your pull requests, make sure you followed this checklist:\r\n- verify that the PR is really intended for the chosen branch\r\n- verify that changes follow [CMS Naming, Coding, And Style Rules](http://cms-sw.github.io/cms_coding_rules.html)\r\n- verify that the PR passes the basic test procedure suggested in the [CMSSW PR instructions](https://cms-sw.github.io/PRWorkflow.html)\r\n", "branch": "master", "changed_files": 27, "closed_at": "1625005258", "comments": 21, "commits": 23, "created_at": "1624577290", "deletions": 947, "labels": ["code-checks-approved", "dqm-approved", "fully-signed", "l1-approved", "orp-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "53e949892749eac9b49d24cc65df5e144323fa66", "merged_at": "1625005258", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 34245, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Updates for Run-3 CSC trigger primitives", "updated_at": "1625104300", "user": "dildick"}