{"additions": 4, "auther_ref": "hcal-tp-11bit-depth-sum", "auther_sha": "7014935fe73c7922212293b6c8d7fe05849986cd", "author": "christopheralanwest", "body": "Quick summary: \r\n\r\nThis PR fixes an edge case in the emulation of HCAL TPs in the upgraded HE. Potentially these changes could have an effect on 2018 MC workflows in the PR comparison tests, but likely statistics are too low in these tests to see an effect.\r\n\r\nDetailed summary:\r\n\r\nTP ET mismatches have been seen in the TP correlation plot of the online DQM: \r\n\r\nhttp://cmsonline.cern.ch/cms-elog/1038548\r\n\r\nThe mismatches only occur for TPs from the 10-degree segmentation region of HE. In this region, the physical segmentation of HE is 10 degrees but, for the convenience of the trigger, the uHTR divides the energy into two TPs to mimic 5-degree segmentation. The computation of TPs proceeds as follows:\r\n\r\ninput (linearization) LUT -> summing of depths -> (divide-by-two) -> summing of time slices -> compression LUT\r\n\r\nwhere the divide-by-two is only relevant in the 10-degree segmentation region. \r\n\r\nThe firmware has the following widths:\r\n\r\n- input LUT 8->10 bits\r\n- summing of depths 10->11 bits\r\n- summing of timeslices 11->11 bits\r\n- compression 11->8 bits\r\n\r\nThe emulation uses the same LSB as the uHTR in the summing of the depths, but currently does not constrain the sum to be less than the firmware's 11-bit maximum of 0x7FF. This results in the emulated TP ET being larger than the data TP ET. In the 5-degree segmentation region, this would automatically result in a saturated TP. In contrast, in the 10-degree segmentation region, the divide-by-two reduces the ET so that it may fall in the region 64 < ET < 128 GeV, which does not necessarily result in a saturated TP after the sum of the two samples.\r\n\r\nConstraining the depth sum to only 11 bits in the emulation resolves the discrepancies, as shown in the table below. These plots use run 315420 of the JetHT dataset. Though the HcalNZS dataset is normally used for TP emulation tests to avoid spurious mismatches between data and emulation as a result of zero suppression, the statistics are too low for this comparison because of the additional prescale of 4096 for NZS events. In these plots, the variable \"soi\" indicates the compressed ET in the sample of interest, and is equal to 2*ET with the current compression scheme. The features in abs(ieta)=21-28 disappear. There are additional mismatches at abs(ieta)=15-16 for reasons associated with zero-suppression, which are purely an artifact of using zero-suppressed data in the TP emulation, and are not relevant for this PR.\r\n\r\nBefore change | After change \r\n-------------- | --------------\r\n![soi_emul_vs_soi_run315420_before_fix](https://user-images.githubusercontent.com/6534323/39543632-65e18bf2-4e11-11e8-9c91-d82eca9635f5.png) | ![soi_emul_vs_soi_run315420](https://user-images.githubusercontent.com/6534323/39543643-6cd62080-4e11-11e8-906b-f49c2ec11aa7.png)\r\n![et_vs_ieta_run315420_before_fix](https://user-images.githubusercontent.com/6534323/39543671-78d6bdf4-4e11-11e8-94db-3936dac59fb5.png) | ![et_vs_ieta_run315420](https://user-images.githubusercontent.com/6534323/39543688-839c0866-4e11-11e8-8594-7ee5e96f1f1a.png)\r\n\r\n\r\n\r\n\r\n\r\n", "branch": "master", "changed_files": 1, "closed_at": "1525842054", "comments": 26, "commits": 1, "created_at": "1525280730", "deletions": 2, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "l1-approved", "orp-approved", "tests-approved"], "merge_commit_sha": "eac3e0c7caf292fb8ba8d3122d01c2f49986f949", "merged_at": "1525842054", "merged_by": "cmsbuild", "milestone": "CMSSW_10_2_X", "number": 23117, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Constrain HE TP depth sums to use only 11 bits", "updated_at": "1525842054", "user": "christopheralanwest"}