{"additions": 279, "auther_ref": "uGT_DQM_BoardComparisons_101X", "auther_sha": "8dfa951dd9c570fd97165ca47f546fd2eec3919a", "author": "mzarucki", "body": "This is the backport to 10_1_X of the following 10_2_X PR: https://github.com/cms-sw/cmssw/pull/23686\r\n\r\nOnline L1T DQM code used to compare and to ensure that all 6 uGT boards receive the same input data from uGMT and CaloLayer2. The request is summarised in the following JIRA ticket: https://its.cern.ch/jira/browse/CMSLITDPG-329\r\n\r\nThe code allows for the comparison of the corresponding standard BX collections: Muon, EGamma, EtSum, Jet and Tau, with those that are appended by an index ranging from 2-6, corresponding to the board number.\r\n\r\nThe code re-uses the existing L1TStage2MuonComp and L1TStage2uGTCaloLayer2Comp L1T DQM modules, so the major change is the addition of a L1TStage2uGTBoardComp_cff.py configuration file fragment. For the CaloLayer2Comp module, minor changes were implemented to generalise the parameter names that are taken as input. It has no effect on the histograms produced for the CaloLayer2 output vs uGT input comparisons (apart from the histogram title).\r\n\r\nThis additional data is read-out for validation events only, so the DQM module runs in the validation sequence only.\r\n\r\nRelevant to this PR is the update to the uGT and CaloLayer2 unpackers, which was required to unpack this new data and fill the relevant object collections: https://github.com/cms-sw/cmssw/pull/23257 (Backport to 10_1_X: https://github.com/cms-sw/cmssw/pull/23628)", "branch": "CMSSW_10_1_X", "changed_files": 6, "closed_at": "1536584121", "comments": 12, "commits": 1, "created_at": "1530101892", "deletions": 168, "labels": ["backport-ok", "comparison-available", "dqm-approved", "fully-signed", "orp-pending", "tests-approved"], "milestone": "CMSSW_10_1_X", "number": 23695, "release-notes": [], "review_comments": 0, "state": "closed", "title": "DQM code for comparison of Muon and CaloLayer2 input collections between 6 uGT boards", "updated_at": "1536584128", "user": "mzarucki"}