{"additions": 1225, "auther_ref": "fc-detlayers-dev", "auther_sha": "a3c185c6ed839ed50de730d781f8d5e70c47d9a2", "author": "fabiocos", "body": "#### PR description:\r\n\r\nThis PR is built on top of #31710 (here fully embedded), where the new ETL geometries implemented by @icosivi are integrated, and needs #31654 to provide physically meaningful results. Its full scrutiny will benefit from the updated MTD validation for 2-discs ETL prepared by @gsorrentino18 which will be presented in a separate PR.\r\n\r\nTo complete the basic geometry definition in view of the reconstruction, the logical partitioning of LGADs encoded in the MTD topology (from ```mtdParameters.xml```) is updated to the TDR scenario of 2 ROCs per LGAD, 16x32 pixels of 1.3x1.3 mm**2. \r\n\r\nThe heart of the PR is the full update of ```RecoMTD/DetLayers``` package to add, in parallel to the existing ring-based layer, a sector-based layer suitable to describe both scenario D72 (4 sectors per disc face) and D73 (2 sectors per disc face). A parallel set of classes is built, and the choice of which layer geometry to build is made based on the ```MTDTopologyMode``` parameter provided by the topology ES. In order to describe the sector, which is a bounded disc sector, the existing classes developed for the tracker are used, and moved outside the ```RecoTracker/TkDetLayers``` area into the more standard ```DataFormats/GeometrySurface``` package (where other similar objects are stored).\r\n\r\nSince at present this code must simultaneously describe two different detector designs, the strategy chosen to search for ```compatibleDets``` within a sector is kept simple, without and optimized navigation of the module matrix for the time being. As it cannot exploit existing geometrical ordering strategies (as for rings, concentring rings ordered in radius with modules ordered in phi), the numerical sorting of modules within a sectors by ```ETLDetId``` provides an approximate ordering of modules (same module number, different types corresponding to left/right side of a modules' strip). This ordering would be pair-wide lexicographic in a x,y matrix of modules, but for the fact that the left and right number of modules does not fully match, as can be seen from a geometry display for one of the D73 discs.\r\n\r\n![image](https://user-images.githubusercontent.com/4058194/95835662-cccc3300-0d3e-11eb-9268-03f2c15929da.png)\r\n\r\nWhen the module of closest approach to the track extrapolation onto the sector surface is identified in a loop probing the distance of all modules, a range of modules around the closest one is explored to search for possible other compatibilities. In order to limit the CPU time taken by the search, a fixed-range window of modules is defined around the closest one, and modules are sorted according to distances are sorted just in that range (and not on the whole sector), so the sorting involves at most 100 elements (in the present implementation), based on the geometry of the setups and observed behaviour.\r\n\r\n#### PR validation:\r\n\r\nThe standard benchmark workflows for scenarios D72 and D73 , defined already in #31710, are activated in this PR to allow tests to systematically probe also this new code. They have been verified to smoothly run on 100 events. A refreshed dedicated test code is provided in the test area of ```RecoMTD/DetLayers```, it has been used to check the structure of layers and behaviour of the search code, and can be easily turned into a unit test like those running already for the ```Geometry/MTD*``` packages. A preliminary check with the updated MTD DQM performed by @gsorrentino18 on a late development stage of this PR showed reasonable results (to be reverified).", "branch": "master", "changed_files": 48, "closed_at": "1603986472", "comments": 148, "commits": 28, "created_at": "1602570606", "deletions": 131, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "geometry-approved", "operations-approved", "orp-approved", "pdmv-approved", "reconstruction-approved", "simulation-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "902f68653d5b5cf8e878fec32a89969bc40bdd6e", "merged_at": "1603986472", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 31765, "release-notes": [], "review_comments": 51, "state": "closed", "title": "MTD geometry/reconstruction: define new ETL reco layer geometry, update LGAD pixel structure, activate workflows for scenarios D72 and D73", "updated_at": "1603986472", "user": "fabiocos"}