{"additions": 118, "auther_ref": "devel_HIDQM", "auther_sha": "92aa361c4a6fa8d2cf96739ebc00e1feda994090", "author": "missirol", "body": "use `HIDQM*` streams in online-DQM clients if `runType==hi_run`\r\n\r\n#### PR description:\r\n\r\nAs discussed in [CMSHLT-2884](https://its.cern.ch/jira/browse/CMSHLT-2884) and [CMSHLT-2923](https://its.cern.ch/jira/browse/CMSHLT-2923), the online-DQM clients currently expect the names of the streamer files produced at HLT to be the same during pp and heavy-ion (HI) data-taking alike.\r\n\r\nOn the other hand, the content of most of these DQM streams is different (in both event content and trigger selection) going from the pp to the HI menu. Because of this, during the development of the HLT menus for data-taking, TSG maintains separate DQM streams for the pp (`GRun`) and HI (`HIon`) menus in the HLT \"combined table\" in ConfDB. For example, the offline HI menu contains the streams `HIDQM` (main DQM stream, counterpart of the stream `DQM` in the pp menu), `HIDQMOnlineBeamspot` (counterpart of `DQMOnlineBeamspot`), `HIDQMEventDisplay` (counterpart of `DQMEventDisplay`), and `HIDQMGPUvsCPU` (counterpart of `DQMGPUvsCPU`). Right before deploying online an HI menu for real data-taking, TSG/STORM renames those streams to their \"pp names\" (removing the `HI`) to comply with what the online-DQM clients expect.\r\n\r\nThis PR tries to update all the online-DQM clients such that, when used for HI data-taking (`runType==hi_run`), the \"HI names\" of the DQM streamer files will be used instead, so that TSG will not have to do the manual renaming described above any longer. TSG and DQM agreed on this in [CMSHLT-2884](https://its.cern.ch/jira/browse/CMSHLT-2884).\r\n\r\nFor reference, the DQM streams of the HIon menu are currently as follows (`DQMCalibration` does not need a \"HI\" prefix, because it is exactly the same in the pp and HI menus).\r\n```\r\nDQMCalibration\r\nHIDQM\r\nHIDQMEventDisplay\r\nHIDQMGPUvsCPU\r\nHIDQMOnlineBeamspot\r\n```\r\n\r\nMerely technical. No changes expected.\r\n\r\nFYI: @cms-sw/hlt-l2 @syuvivida\r\n\r\n#### PR validation:\r\n\r\nExisting unit tests pass, but I guess dedicated checks by DQM should be done. If streamer files from the 2023 HI run are available, maybe one option is to make a copy of them and rename them using the \"HI names\" (e.g. `*_streamDQM_*` -> `*_streamHIDQM_*`), then use those streamer files to test the online-DQM clients with `runType=hi_run` (and with this PR).\r\n\r\n#### If this PR is a backport, please specify the original PR and why you need to backport that PR. If this PR will be backported, please specify to which release cycle the backport is meant for:\r\n\r\nN/A\r\n", "branch": "master", "changed_files": 13, "comments": 1, "commits": 1, "created_at": "1704191860", "deletions": 94, "labels": ["dqm-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending"], "milestone": "CMSSW_14_0_X", "number": 43645, "release-notes": [], "review_comments": 0, "state": "open", "title": "use `HIDQM*` streams in online-DQM clients if `runType==hi_run`", "updated_at": "1704191889", "user": "missirol"}