{"additions": 1326, "auther_ref": "hcalfb_unpacker_13_1_0_pre1", "auther_sha": "9968a15d27953d2dba9de5d6c459f2ffedbf6d6a", "author": "hftsoi", "body": "#### PR description:\r\n\r\nThis PR is to modify CaloLayer1 unpacker for proper readout from new fw version at CaloLayer1 about additional HCAL FB implementation. Previously the CaloLayer1 payload data contain only the first FB (FB0) from HCAL, now there is a new fw version that extends the payload data format to contain all other FB (FB1-5), so the unpacker is modified to unpack them. For flexibility there is a flag in the payload header to tell if the additional HCAL FB is implemented or not, therefore two new unpackers (one with UCTCTP7RawData_HCALFB.h for normal event unpacker, another with UCTCTP7RawData5BX_HCALFB.h for fat event unpacker) are added to be used when this flag is set, otherwise the usual unpackers (not for additional HCAL FB implementation) are used and no modification is made to them in this PR. DQM is also modified for these HCAL FB monitoring.\r\n\r\n#### PR validation:\r\n\r\nOffline DQM was run on past commissioning runs, expected DQM elements are added and properly filled. Several P5 tests (included in online DQM P5 tags already) were also done together with the new CaloLayer1 fw loaded during CRUZET, where HCAL sent feature bit patterns which could all be read out properly by CaloLayer1, and the output LLP bits were observed to be consistent with the logic. The P5 tests of modifications included in this PR were successful and this is to make it permanent in production system.", "branch": "master", "changed_files": 7, "closed_at": "1679001178", "comments": 17, "commits": 1, "created_at": "1678468070", "deletions": 81, "labels": ["dqm-approved", "l1-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "hcal", "l1t"], "merge_commit_sha": "b847cb15ce810ed4063ce6136030a22384b8d704", "merged_at": "1679001178", "merged_by": "cmsbuild", "milestone": "CMSSW_13_1_X", "number": 41028, "release-notes": [], "review_comments": 4, "state": "closed", "title": "Layer1 unpacker and DQM modified for HCALFB", "updated_at": "1679001178", "user": "hftsoi"}