{"additions": 2, "auther_ref": "trackAssociationFix", "auther_sha": "5cad1f68559bb907d775cf668bc9987fa5068408", "author": "makortel", "body": "In case SimToRecoCollection (RecoToSimCollection) has more than 1 track associated to a TrackingParticle (vice versa), in the collection returned by QuickTrackAssociatorHitsByImpl these tracks (TPs) are not sorted by the matching quality. However, edm::Event::put() calls the AssociatorMap::post_insert() (which does the sorting) when a product is inserted to Event. This behaviour can create a subtle difference in cases where the SimToRecoCollection/RecoToSimCollection is read from an Event and where they are produced on the fly.\n\nThis PR makes the return values of QuickTrackAssociatorHitsByImpl to be always sorted (the association wrt. TrajectorySeed was already sorted, and that is also the behaviour in other TrackAssociators). I deliberately fixed only the new-style associator, as I intend to clean up the old-style associators in a separate PR.\n\nTested in 750pre1 with 9k RelValTTbar events. Tiny changes are expected in DQM plots utilizing the track-TP associations such that something from the value of the association is plotted. Couple of examples from MultiTrackValidator for all tracks (black old, red new):\n![image](https://cloud.githubusercontent.com/assets/33993/6843443/53628634-d3a3-11e4-9b41-e16165d4ee82.png)\n![image](https://cloud.githubusercontent.com/assets/33993/6843463/a437120a-d3a3-11e4-9106-9341abdcd34a.png)\n\nEspecially the efficiencies and fake rates reported by MTV should not be affected, but duplicate rate can be, as demonstrated by this plot from HLT tracks\n![image](https://cloud.githubusercontent.com/assets/33993/6843618/08e8722e-d3a5-11e4-9171-09a90ab67a4b.png)\n\n@rovere @VinInn \n", "branch": "CMSSW_7_5_X", "changed_files": 1, "closed_at": "1427617116", "comments": 6, "commits": 1, "created_at": "1427359940", "deletions": 1, "labels": ["comparison-available", "fully-signed", "simulation-approved", "tests-approved"], "merge_commit_sha": "b2ca0608606c8b9c8a41ed7dedf8915cb5a0303d", "merged_at": "1427617116", "merged_by": "cmsbuild", "milestone": "CMSSW_7_5_X", "number": 8540, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Fix sorting of values in QuickTrackAssociatorHitsByImpl", "updated_at": "1476956273", "user": "makortel"}