{"additions": 348, "auther_ref": "segment_fitter_to_smatrix", "auther_sha": "2061bbf530f8d670d4c336ae592d792bc83929ec", "author": "ptcox", "body": "This is the straight swap of CLHEP matrices by root::SMatrix in the least-squares fitting of CSC segments. Really the code needs a lot of factoring and general clean-up but I don't have the time - a good place to start would be to factor out the segment-fitting. (That would probably also help GEM since I think they also make use of the same code, by cut-and-paste from CSC.) I also fixed what I consider a bug where after manipulations apparently to improve the numerical robustness of covariance matrix handling, the symmetricity of the covariance matrix was not maintained. This leads to ~8% of segments receiving slightly difference local positions and directions.I decided not to change the ME1/1A max rechits in cluster from 24 to 20, as in the other chambers, even though in postls1 the channels are now unganged - it seems that would be more effort than it's worth (would required setting up separate pre- & post-ls1 configs, AND changing HLT configs to match.) Finally, I noticed there is something called a 'yweightPenaltyThreshold' that was not set for ME4/2. I used the same value as set for ME/2 and ME3/2. I made a lot of tests comparing the original code, the new code, the new code with general rather than explicitly symmetric SMatrix, and the old code with the bug-fix enforcing symmetric covariance matrices. Everything seems consistent. First results of modified code presented in CSC Meeting of 20-Aug-2014, https://indico.cern.ch/event/336061/. Since then I have also increased the study samples to 1000 events of run 1 SingleMu, giving 4500 segments, and everything still makes sense. The runTheMatrix reco test ran fine.\n", "branch": "CMSSW_7_2_X", "changed_files": 3, "closed_at": "1410199427", "comments": 6, "commits": 3, "created_at": "1409570745", "deletions": 180, "labels": ["comparison-available", "fully-signed", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "be1c5a23a620b525837f5fb558212b5eab2255e2", "merged_at": "1410199427", "merged_by": "nclopezo", "milestone": "Next CMSSW_7_2_X", "number": 5125, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Replace CLHEP matrices by root::SMatrix in segment fitter", "updated_at": "1410199427", "user": "ptcox"}