{"additions": 213, "auther_ref": "ctpps-timing_dqm_9_2_X_august2017", "auther_sha": "f8c754d16717a09f0ccd340365032d9314f49aaa", "author": "CTPPS", "body": "This PR updates the DQM according to the latest hardware configuration.\r\n9_2_X backport of PR 20270.\r\n\r\n\r\nThe front-end chip (HPTDC) configuration has been optimized during the commissioning of the detector.\r\nThe main modification was the introduction of a delay (digital) for the different channels to temporally align them. This allows a better visualization of the online data: for instance all peaks in the leading edge plots are aligned.\r\nTherefore, it was possible to reduce the acquisition window from 5 clock cycle down to 2. Drastically reducing the possibility of 2 hits in the same event.\r\nOut of those 5 time slices, the one synchronized with the trigger (centralOOT) was moved from 4 to 1 and then to 0 (first acquired slice).\r\nSome parameters require the modification of the DQM code; moreover, the readability of some plots has been improved (showing percentage instead of absolute values) and some new plots have been introduced, as the hit map in the last lumisection to immediately spot problems with the detectors.\r\n\r\nAlso, code has been improved (switch case removed, NULL -> nullptr, histogram binning optimized).\r\n\r\nFinally, this code is compatible with the upcoming geometry update (UFSD implementation).\r\n\r\nNote about urgency: current version of the DQM is enough to understand if the detector is working, but not enough to show its performance online.", "branch": "CMSSW_9_2_X", "changed_files": 2, "closed_at": "1507528154", "comments": 16, "commits": 7, "created_at": "1504011355", "deletions": 167, "labels": ["backport-ok", "comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "342c56b44aa8991297a59e423ee1b4b2e1796098", "merged_at": "1507528154", "merged_by": "cmsbuild", "milestone": "CMSSW_9_2_X", "number": 20299, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Updated DQM after front-end optimization 9_2_X", "updated_at": "1507535396", "user": "nminafra"}