{"additions": 1336, "auther_ref": "cms-l1t-offline-splitX-pr1130", "auther_sha": "ad4c326952967e7d0778b5c33f660b346b1d3551", "author": "NJManganelli", "body": "This PR is a forward port of the FastHisto update in the Phase2 integration branch\r\nhttps://github.com/cms-l1t-offline/cmssw/pull/1130\r\n\r\nThat PR grew overly large. It was refactored from 45 commits to 5, such that this PR can be divided into 3-4 pieces, should that be preferable to review (as separate PRs)\r\n\r\nThe first two commits are focused on reworking the EDM product workflow to match the GTT firmware. This consists of breaking up the \"TrackSelection\" into distinct TrackSelection (TS) and TrackVertexAssociation (TVA) modules. The emulation is updated to follow the firmware architecture, such that TS -> VertexFinding (VF) -> TVA -> TrackJets/MET, with separate configurable producers for VF, TrackJets, and MET. The TrackJets current behavior is retained as much as possible by currently making its TS module act in passthrough mode. Future PRs will update these separate TS/TVA modules with optimized selections from the GTT group. These changes are introduced now to focus the workflow-breaking updates into one (set of consecutive) PRs. Additionally, this fixes some naming of InputTags which were broken by the \"l1t\" naming update in September 2022. To simplify common workflows, common choices are propagated into the VertexProducer configuration, such that most uses can be simplified to ```load``` and add to ```Path/Task```, rather than verbose configuration in all workflows.\r\n* 32ae7bc18023a1de71236937155e801dca00d808 Split TrackSelection and TrackVertexAssociation, Triplicate for GTT, Propagate new workflow to central L1T and GTT configurations, fix l1t broken tags\r\n* 8791748abdd5214e12aff476a2050bff91d45cc9 Propagate the TS and TVA split, new VertexFinder configuration, and updated JetFinding workflow to more L1T workflows\r\n\r\nThis commit is the core/seed of the PR, which change the FastHisto emulation algorithm to match firmware (HDLS GTT firmware version around June 2023). This involves updating the histogram binning to 256, removing track pt truncation, and introducing histogram bin truncation at a late stage. \r\n* 4246b050ebddb84aecd9af5c9e5e50a65024dbf4 FastHisto update to match firmware approximately for June 2023\r\n\r\nThis commit updates the \"l1vertices\" tag to \"L1Vertices,\" to match the convention followed by most L1T products. L1{X} is the most common, followed by \"Level1{X}\" for some TrackTrigger products, and then less common ones.\r\n* 57125f0253d8c5b71c4b64d0d679a71661a41b03 Harmonize l1vertices to L1Vertices\r\n\r\nThis commit adds the new TS and TVA collections to the L1TrackObjectNtupleMaker, and inserts delete calls which have been historically missing. \r\n* c2e029e9dd53aec5e6a8e3923d2df5b793ed9c9a Update L1TrackObjectNtupleMaker\r\n\r\nValidation:\r\nscram b code-checks\r\nscram b code-format\r\nscram b\r\n\r\n```runTheMatrix.py -l limited -i all --ibeos``` passes in the cms-l1t-offline Phase2 integration branch. In central CMSSW,t has the same number of passes/fails as master.\r\n\r\nAdditionally, there was extensive performance testing by GTT, PFL1, and GT experts to ensure changes in performance were as expected.\r\n\r\nPlease let me know of necessary corrections or if this needs to be broken up into 3-4 distinct PRs.", "branch": "master", "changed_files": 37, "closed_at": "1689620312", "comments": 20, "commits": 6, "created_at": "1688001904", "deletions": 361, "labels": ["dqm-approved", "l1-approved", "fully-signed", "tests-approved", "orp-approved", "upgrade-approved", "code-checks-approved"], "merge_commit_sha": "2e9dc3e163d4cebfe5a5e8efafbd922d275c9da9", "merged_at": "1689620312", "merged_by": "cmsbuild", "milestone": "CMSSW_13_2_X", "number": 42129, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Phase 2 forwardport FastHisto PR1130", "updated_at": "1689620312", "user": "NJManganelli"}