{"additions": 54131, "auther_ref": "151X_calodev_v2", "auther_sha": "d29d4100ada0be4b96ae53eb1085eae4bb1ae7cc", "author": "cerminar", "body": "#### PR description:\r\n\r\nThis PR rewrites the Correlator Layer-1 emulator code handling the Calorimeter input objects, enabling more realistic treatment of barrel and endcap data. \r\n\r\nIn particular:\r\n- drop the conversion of the input calorimeter objects to `PFCluster`, moving all needed manipulations (deserialization, calibrations and ID models to the Layer-1 emulator.\r\n   - \"decoded\" calorimeter objects are now built starting from digitized words via unpackers according to most up-to-date interface documents\r\n- write `PFCluster` collections directly from the CTL1 emulator AFTER the decoding storing bit-wise accurate information across the whole calorimenter. This allows acessing data in the final precision for performance studies and ML model training\r\n   - modify the `PFCluster` data-format to store digitized objects in packed format. This allows retrieving quantized quantities in the ntuplization steps\r\n- adds more realistic HGCal decoding (update to more recent interface document)\r\n   - add emulation of new multiclass ID within the HGCal decoding step\r\n- PFCandidate ref to source becomes polymorphic, allowing uniform interface across barrel and endcap \r\n- GCT EM and Hadronic emulated objects are now decoded and calibrated within the emulator\r\n- updated emulator of the barrel \"TDR\" regionizer\r\n- flexible packed binary format of calorimeter and track objects across barrel and edncap to optimize Firmware resource usage\r\n\r\n\r\ne-gamma L1T:\r\n- adds new composite ID model for the barrel cluster to track matching for building TkElectrons\r\n\r\n#### PR validation:\r\n\r\nWe will soon post some comparison plots. \r\n", "branch": "master", "changed_files": 59, "comments": 32, "commits": 39, "created_at": "1746194720", "deletions": 1012, "labels": ["l1-pending", "pending-signatures", "tests-rejected", "orp-pending", "upgrade-pending", "code-checks-approved", "changes-dataformats"], "milestone": "CMSSW_15_1_X", "number": 48002, "release-notes": [], "review_comments": 27, "state": "open", "title": "[L1T] Restructure handling of Calorimeter input to Correlator Layer-1 + new TkElectrons in barrel (Phase-2)", "updated_at": "1748632682", "user": "cerminar"}