{"additions": 377, "auther_ref": "Egamma_Identification_11XY", "auther_sha": "e6519fe184b2666a6b61f346022fbed7e4b915ec", "author": "guitargeek", "body": "#### PR description:\r\n\r\nAs the Egamma MVA infrastructure does not need to compute object specific variables anymore that are not stored in the objects themselves (thanks to https://github.com/cms-sw/cmssw/pull/26486), the `MVAVariableHelper` is now an overly complicated piece of code which should be adapted.\r\n\r\nI also suggest to remove the MultiToken class I introduced last year, as it's not really used much anymore after all the changes in the last months. It was also used in the ElectronIDValueMapProducer, which can now be removed that all the variables are in the object. I also think I made a mistake introducing the MultiToken to begin with. The consumes should be better configured with Python... That makes the MVAValueMapProducer also a bit simpler to use as it's not ambiguous anymore how it can be configured.\r\n\r\nOther changes:\r\n* adapted Electron MVA FWLite python code and test (thanks to the appropriate relvals being available now)\r\n* merge header and source of some plugins in Electron-PhotonIdentification\r\n* put all the plugin template definitions in Electron-PhotonIdentification into plugins.cc file\r\n\r\n\r\n#### PR validation:\r\n\r\nCMSSW compiles and local matrix tests pass.\r\n\r\n#### if this PR is a backport please specify the original PR:\r\n \r\nMaybe the FWLite part should get backported to 10_6_X.", "branch": "master", "changed_files": 33, "closed_at": "1560709193", "comments": 52, "commits": 11, "created_at": "1558037324", "deletions": 842, "labels": ["analysis-approved", "code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved", "xpog-approved"], "merge_commit_sha": "b3864aef5f76bde11db583070526ac87607aea33", "merged_at": "1560709192", "merged_by": "cmsbuild", "milestone": "CMSSW_11_0_X", "number": 26814, "release-notes": [], "review_comments": 3, "state": "closed", "title": "Adapting MVAVariableHelper to new E/gamma UL format and removal of MultiToken", "updated_at": "1560709193", "user": "guitargeek"}