{"additions": 29, "auther_ref": "master-tva94-linkaware-update", "auther_sha": "23bff4c12b566e68b29a0e7da6613823404beb8a", "author": "NJManganelli", "body": "#### PR description:\r\n\r\nThis PR matches the Global Track Trigger's behavior with TrackVertexAssociation in firmware. In the current F/W, there is a restriction of associating at most 94 tracks per input link. \r\n\r\nCurrently, the Track Finding Processors send tracks with eta >= 0 on one link, and negative eta tracks on another. There are 18 links total (2 per processor for each phi Nonant). To the TTTrack class, a method is added to get the GTT link index (0-17) indicating the fiber a track would be sent on in firmware. Additionally, since the firmware behavior can best be likened to 'zeroing' un-selected tracks in the datastream, we must enumerate the tracks as they are 'processed' by the GTTInputConverter, using the added setter method. Once derived collections are processed downstream in the TrackVertexAssociation, the member variable can be checked via the getter to do a simple check on whether the Track could be associated as in the firmware. This is then propagated to the codecs_tracks to centralize the usage of this.\r\n\r\n#### PR validation:\r\n\r\nPasses:\r\nscram b code-checks\r\nscram b code-format\r\nscram b\r\n\r\nGTT test workflow runs as expected; special variant to test the new limits (requires 6-fold duplication of tracks in the test sequence) gets 100% matching with corresponding update to GTT firmware.\r\nhttps://gitlab.cern.ch/GTT/LibHLS/-/merge_requests/30\r\n\r\nThis will need to be backported to the cms-l1t-offline phase2 integration branch ", "branch": "master", "changed_files": 4, "comments": 6, "commits": 4, "created_at": "1691455865", "deletions": 8, "labels": ["l1-pending", "pending-signatures", "tests-pending", "orp-pending", "upgrade-pending", "code-checks-approved"], "milestone": "CMSSW_13_3_X", "number": 42505, "release-notes": [], "review_comments": 9, "state": "open", "title": "Master tva94 linkaware update", "updated_at": "1691521869", "user": "NJManganelli"}