{"additions": 1543, "auther_ref": "param_builder_12_2_X", "auther_sha": "f5f411df52ad9c835d0475bb53b3ce40580eb639", "author": "CMS-ECAL-Trigger-Group", "body": "This is a backport of PR #36446 needed to propagate the changes to the CMSSW version currently available for tests in P5. \r\n\r\n## PR description:\r\n\r\nThe ECALTPGParamBuilder code computes the parameters for the ECAL Trigger Primitives (TP) configuration, including pedestals, weights and transparency calibrations.\r\nThis PR introduces the necessary changes to include the double weights configuration in the configuration scripts.\r\nMoreover the code has been revised to include some additional cross-checks for problematic crystals. The weights configuration can be now read from files and not only computed from the pulse shapes.\r\n\r\nThe necessary OnlineDB, CondDB and trigger emulator changes for the double weights mechanism have been already included in previous PRs : #33220, #33349, #33748\r\n\r\n## PR validation:\r\n\r\nThe full chain of ECAL TP configuration has been tested during the extended MWGR in November. The BEAMV7 key has been created in the OnlineDB by the configuration script and tested in global run.\r\nA description of the double weight mechanism and related DB classes has been given at the Alca meeting and can be found here: https://indico.cern.ch/event/1020767/#16-new-ecal-tpg-db-classes-for", "branch": "CMSSW_12_2_X", "changed_files": 12, "closed_at": "1642898956", "comments": 12, "commits": 2, "created_at": "1642689718", "deletions": 328, "labels": ["alca-approved", "l1-approved", "fully-signed", "tests-rejected", "db-approved", "orp-approved", "backport-ok"], "merge_commit_sha": "0551f571edb7499a73ce03508f0898e65341982f", "merged_at": "1642898956", "merged_by": "cmsbuild", "milestone": "CMSSW_12_2_X", "number": 36760, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Backport to 12_2_X: ECAL TPG Parameter Builder changes for double weights", "updated_at": "1642898956", "user": "valsdav"}