{"additions": 6, "auther_ref": "EcalDrivenEffFix", "auther_sha": "03f5c6a32e256a68f760aea0ce1d83c81c9d8776", "author": "Sam-Harper", "body": "Dear All,\r\n\r\nThe efficiency of an electron to be ECAL driven has been low by 7-10% in 2017 data and this is one of the show stopping issues for the data re-reco. A reminder, electrons can be tracker driven (seeded by tracks) or ecal driven (seeded by pixel hits matched to the supercluster's trajectory). The tracker driven electrons were fine but there were issues with the ecal driven electrons\r\n\r\nThe issue has now been identified and was discussed today in the e/gamma meeting:\r\nhttps://indico.cern.ch/event/604940/contributions/2686772/attachments/1506133/2347059/ecalDrivenFix.pdf\r\n\r\nTo summarise, E/gamma wants to have as input all sensible doublet combinations. This is done by pixelPairElectronSeeds but importantly it is cleaned for previously made pixel seeds, ie a cluster cant be considered for pixelPairElectronSeeds if it was used for a previous seed collection.  A final seed collection, newCombinedSeeds is made out of these seeds and all the previously made pixel seeds for which it was cleaned. This is presumably to reduce timing and is a sensible approach. Unfortunately for phase1 pixels, a rather key set of seeds, pixelPairSeeds, were removed from newCombinedSeeds. \r\n\r\nTo summarise the summary:  [the chap guessed wrong](https://github.com/cms-sw/cmssw/blob/master/RecoTracker/IterativeTracking/python/ElectronSeeds_cff.py#L37)\r\n\r\nI have added them back along with all other seeds which are involved in the cleaning. This covers most of the inefficiency but there remains a 0.5% effect compared to just making the doublets directly without cleaning. I will continue to have a look at this but things are very much improved already so I think its important to have into the release asap.\r\n\r\nTo do:\r\nI want to re-reco all of the DoubleEG dataset of 299480 just to check there are no adverse effects from this (I only re-recoed the failing ecal driven electrons). I expect this to complete tomorrow, grid willing. \r\n\r\nAlso this potentially impacts timing. What is the recommended benchmark job to evaluate this impact? \r\n\r\nFinally this wasnt supposed to be in the MC but given the fix, its weird it isnt there, to be investigated. \r\n\r\n\r\n\r\n\r\n\r\n\r\n", "branch": "master", "changed_files": 1, "closed_at": "1502804572", "comments": 23, "commits": 1, "created_at": "1502299879", "deletions": 1, "labels": ["comparison-available", "fully-signed", "orp-pending", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "74bd0a212ff65508f383421949a5797e54da68ec", "merged_at": "1502804572", "merged_by": "cmsbuild", "milestone": "CMSSW_9_3_X", "number": 20106, "release-notes": [], "review_comments": 3, "state": "closed", "title": "Fixing missing seeds affecting Electron EcalDriven Efficiency", "updated_at": "1502804572", "user": "Sam-Harper"}