{"additions": 550, "auther_ref": "trackCandValidation_15_1_0_pre5", "auther_sha": "1619eedf996a316c742eb85c010fe3b3e051ddab", "author": "AuroraPerego", "body": "#### PR description:\r\n\r\nThis PR introduces the possibility of having multiple tracks within the same `TICLCandidate`, which allows us to save the entire decay chain of tracks left by a particle and its daughters entering HGCAL (instead of the current situation where we serve only the first one).\r\nThis change has already been applied to the `simTICLCandidate`s and `simTrackster`s and considered in the validation, where the track linked to the reconstructed candidate is checked against all the tracks left in the tracker associated with the simulated particle and its daughters. \r\nLater, this will be used in the reconstruction as well, making it \"many(-tracks)-to-many(-tracksters)\", \r\n\r\nIn addition, I added a few plots to the `TICLCandidate` validation:\r\n- number of efficient and fake candidates, a useful metric to look at together with the rate to get an idea of the multiplicity\r\n- number of simulated charged candidates with no reco track associated (tracker inefficiency), with no good track associated (the associated track(s) did not pass the cuts used in the linking algorithm) \r\n- number of simulated candidates with no trackster associated (we did not reconstruct the energy blob in HGCAL)\r\n\r\nThe `TICLDumper` has been updated to save the vector of tracks.\r\n\r\n#### PR validation:\r\n\r\nrun wf of single pion with 0PU and 200PU and looked at the validation plots, available [here (0 PU)](https://aperego.web.cern.ch/trackLinkingWindow/plotsNewValid/) and [here (200PU)](https://aperego.web.cern.ch/trackLinkingWindow/plotsNewValidPU/).\r\ntest it with wfs 29688.207, 29888.207, 29634.203, 29834.203\r\n\r\nFYI @waredjeb @felicepantaleo \r\n", "branch": "master", "changed_files": 15, "comments": 27, "commits": 8, "created_at": "1757331918", "deletions": 234, "labels": ["dqm-pending", "reconstruction-approved", "pending-signatures", "tests-approved", "orp-pending", "upgrade-approved", "requires-external", "code-checks-approved", "changes-dataformats"], "milestone": "CMSSW_16_0_X", "number": 48862, "release-notes": [], "review_comments": 7, "state": "open", "title": "Add vector of tracks to TICL tracksters and candidates and add other validation plots", "updated_at": "1758893561", "user": "AuroraPerego"}