{"additions": 150, "auther_ref": "uGT_DQM_unpackersUpdate_102X", "auther_sha": "d3768b208b3ecc054f9736a5345a37021c5b8b27", "author": "mzarucki", "body": "The readout record of the uGT has been updated to read-out data from all 6 boards for validation (fat) events only. This data is then to be compared using a L1T DQM module, to ensure that all 6 boards receive the same information. This is summarised in the following JIRA ticket: https://its.cern.ch/jira/browse/CMSLITDPG-329\r\n\r\nThe changes in the code allow for the unpacking of this additional data, which is filled into new BX collections that are appended by an index ranging from 2-6, corresponding to the board number. The following CaloLayer2 unpackers have been modified: EGamma, EtSum, Jet, Tau. The changes are analogous to the existing modification of the Muon unpacker, where one defines a 'copy' to be filled, which corresponds to the board number. This copy number is initialised to 0, which refers to the existing collection for the first board. \r\n\r\nThe GTSetup, as well as the CaloCollections, GTCollections and L1TObjectCollections had to be updated to synchronise with these changes.\r\n\r\nIt is important to ensure that these changes have no effect on the original unpacked collections, as well as do not cause any issues downstream. The code has been tested on Run2018A data and a basic comparisons of single hwPt distributions indicate that there are no differences and that the new collections are correctly filled. However, thisdoes not serve as a complete validation of the code. The results of these tests are attached together with the JIRA ticket in the form of slides.\r\n\r\nTherefore, I would kindly requestfor the experts toproceed with validating this code further.\r\n\r\nBackport of this PR to 10_1_X: https://github.com/cms-sw/cmssw/pull/23628", "branch": "master", "changed_files": 13, "closed_at": "1529567011", "comments": 33, "commits": 2, "created_at": "1526724454", "deletions": 75, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "l1-approved", "orp-approved", "tests-approved"], "merge_commit_sha": "34707d603920df9699e9f367ea785b123c06dde7", "merged_at": "1529567011", "merged_by": "cmsbuild", "milestone": "CMSSW_10_2_X", "number": 23257, "release-notes": [], "review_comments": 6, "state": "closed", "title": "Update to uGT and CaloLayer2 unpackers to fill object collections from 6 uGT boards", "updated_at": "1530102270", "user": "mzarucki"}