{"additions": 340, "auther_ref": "mm_dev_phase2IntegrationTests", "auther_sha": "ac502795b54d7718241758d4c85499772fb8172b", "author": "mmusich", "body": "#### PR description:\r\n\r\nAs there has been a recent surge of activities concerning the phase-2 HLT menu, it's important to start engineering some tests to ensure that the basic functionalities of the menu are preserved when configuration updates are introduced. \r\nThe goal of this PR is to propose a initial version of a driver script for Phase-2 HLT integration tests to be discussed with the phase2 HLT upgrade community.\r\nThe `hltIntegrationTests` scripts we do have for the Run-3 menu are not well suited for this use case, due to the structure of the phase-2 menu and the necessity to run the `L1P2GT` step upfront.\r\nThis script:\r\n   * creates the configuration for the phase-2 menu from `cmssw`;\r\n   * for each of the N paths in the menu it creates a copy of the menu with only *that* one path in the schedule;\r\n   * it  runs ten (configurable) `GEN-SIM-DIGI-RAW` TTbar event for the current phase-2 default geometry (as the time of this PR that would be `D110`);\r\n   * runs on those events first the full menu and then N jobs for the N single-path versions;\r\n   * finally it loops over the output N root files and compares for each one of the standalone path outputs the trigger results with the full menu.\r\n\r\nIn case any of the `cmsRun` process fails, the script fails. In case one of the trigger results comparison fail, the script fails.\r\nRun single-threaded takes about 40 minutes on lxplus. I provide options to run multi-threaded, but it might be too demanding in terms of requested resources if there are parallel `cmsRun` executions (4 by default).\r\nI think this kind of test should be able to spot early on the kind of issue that were corrected at https://github.com/cms-sw/cmssw/pull/46019 or https://github.com/cms-sw/cmssw/pull/46054.\r\nAs the execution time is quite long, I would propose to run this test in IBs as we do for the Run-3 menus [here](https://github.com/cms-sw/cms-bot/blob/31e877d0cce5ba760e30cdb40d5f0fa39901e6b6/run-hlt-validation#L40)\r\n\r\n#### PR validation:\r\n\r\nIn a recent CMSSW_14_2_X IB:\r\n```\r\ncd HLTrigger/Configuration/python/HLT_75e33/test/\r\npython3 hltPhase2UpgradeIntegrationTests.py\r\n```\r\nruns.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNot a backport, not meant to be backported.\r\n", "branch": "master", "changed_files": 1, "comments": 7, "commits": 2, "created_at": "1727169514", "deletions": 0, "labels": ["hlt-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_14_2_X", "number": 46110, "release-notes": [], "review_comments": 0, "state": "open", "title": "introduced a python script for Phase-2 HLT integration tests", "updated_at": "1727253426", "user": "mmusich"}