{"additions": 114, "auther_ref": "backport_37281_to_123X", "auther_sha": "3c15c2f59f9fd53a108ee35a0ddf5bd648abeeb3", "author": "missirol", "body": "backport of #37281\r\nbackport of #37398\r\n\r\n#### PR description:\r\n\r\nI open the backport of #37281 and #37398 to `12_3_X` as per TSG's request (see https://github.com/cms-sw/cmssw/pull/37281#issuecomment-1080639025; cc: @silviodonato @Martin-Grunewald).\r\n\r\nThose PRs change the outputs of the HLT pixel reconstruction, and TSG would like to have these updates in `12_3_X` (release cycle to be used at HLT at the start of Run 3).\r\n\r\nBelow, a copy of the description of the original PRs by @VinInn.\r\n\r\nDescription of #37281 (\"Patatrack: introduce pt-clamping in vertex sorting, add #tracks in track SOA\"):\r\n>This PR introduces some long standing improvements in Patatrack that can be useful to POG and PAG using directly SOA products.\r\n>\r\n>  1. Track Pt-clamping is introduced in vertex sorting.\r\n>      This is supposed to mitigate the effect of spurious tracks with large pt due to miss-measurement, resolution or inaccurate calibration/alignment.\r\n>\r\n>The effect has been tested in Z->tau-tau events that are supposed to be among those who most suffer from signal-vertex miss-identification.\r\n>The effect is small if not negligible. see: http://innocent.home.cern.ch/innocent/RelVal/ztt_clamp/plots_selectedPixelVertices/pvtagging.pdf\r\n>where we compare clamping at 20, 75 (the default) and 1000 GeV.\r\n>This is not unexpected given the resolution of HP quadruplets, those used to build vertices, that reaches ~30% at ~70 GeV.\r\n>It may be different with initial calibrations or large inefficiency.\r\n>\r\n>Results for ttbar can be found in\r\n>http://innocent.home.cern.ch/innocent/RelVal/gpuMTVclamp/plots_selectedPixelVertices/pvtagging.pdf\r\n>\r\n>  2. The number of tracks is stored in the track SOA.\r\n>      This should make the use of the SOA more user-friendly.\r\n>\r\n>Default has changed, so expect small regressions.\r\n\r\nExcerpt of the description of #37398 (\"Stabilize Fishbone\"):\r\n>The fishbone has been made deterministic and order independent.\r\n>The main change is (of course) removing the `break` in the combinatorial double loop.\r\n>\r\n>results:\r\n> Timing: negligible effect.\r\n>\r\n> MTV: slight increase of duplicate (as more fishbone cells are created) for Loose tracks. no effect on HP\r\n> http://innocent.home.cern.ch/innocent/RelVal/gpuMTVstableFB/\r\n>\r\n> detailed comparison of reproducibility\r\n> [..]\r\n> In particular with this PR (no break) comparing 10 events at track level\r\n> NO difference in HP quadruplets, only one HP triplet differs.\r\n> the rest are loose triplets (and a couple of loose quadruplets)\r\n> REMINDER:\r\n> loose tracks are in the collection ONLY to be used for seeding or for algorithms that perform some sort of pre-cleaning\r\n> (often a simple association to trimmed-vertices is enough).\r\n>\r\n> Making the various ambiguity solvers deterministic and order independent will be much harder and costly\r\n\r\n#### PR validation:\r\n\r\nRelies on the validation done for the original PRs.\r\n\r\n#### If this PR is a backport, please specify the original PR and why you need to backport that PR:\r\n\r\n#37281\r\n#37398", "branch": "CMSSW_12_3_X", "changed_files": 13, "comments": 16, "commits": 14, "created_at": "1648889693", "deletions": 60, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-pending", "urgent", "backport-ok", "heterogeneous-approved"], "milestone": "CMSSW_12_3_X", "number": 37444, "release-notes": [], "review_comments": 0, "state": "open", "title": "Backport to `12_3_X` of Patatrack pixel-reco updates (pT-clamping in vertex sorting + stabilized Fishbone)", "updated_at": "1649146087", "user": "missirol"}