{"additions": 40, "auther_ref": "concurrentLumis", "auther_sha": "bc6afb57e1c572e0b5172c59871e88691d19c8b7", "author": "makortel", "body": "#### PR description:\r\n\r\nThis PR suggests to enable concurrent lumis by default in cmsDriver.py when at least two streams and threads are requested. More specifically, the default value of `--nConcurrentLumis` is changed to `0`, which is then interpreted as \"2 if number of streams is not 1 or if number of streams is 0 and number of threads is not 1, otherwise 1\".\r\n\r\nConsequently the forcing of concurrent lumis in the specific multi-lumi or concurrent lumi test workflows is removed (and the workflow 158.181 is removed completely because it would be equal to multithreaded 158.0). This change implies that in PR tests the multi-lumi workflows will be run without concurrent lumis, but in IBs the concurrent lumis is enabled. I hope this is acceptable.\r\n\r\nThis PR also adds an option `--nConcurrentIOVs` to cmsDriver.py as a preparatory step for enabling also concurrent IOVs enabled (in reality I enabled concurrent IOVs already, but decided to leave it to a subsequent PR because we may want to limit specific Records to 1 IOV that would need more discussion, I'd like to enable concurrent lumis sooner, and this PR alone could be enough for one discussion).\r\n\r\nIn addition, this PR removes explicit types on setting/overriding `process.options` and `process.maxEvents` that are not needed anymore.\r\n\r\n#### PR validation:\r\n\r\nLimited matrix  + `1302.181,1304.181,1361.181,136.8861,136.8862` runs, and the number of concurrent lumis is set properly in the configuration depending if run with many threads or not.\r\n\r\n@Dr15Jones ", "branch": "master", "changed_files": 5, "closed_at": "1607723068", "comments": 16, "commits": 3, "created_at": "1607365707", "deletions": 44, "labels": ["code-checks-approved", "fully-signed", "operations-approved", "orp-approved", "pdmv-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "3494cdc46e57e84afe6713133db7cfafcbf49ce5", "merged_at": "1607723068", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 32406, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Enable concurrent lumis by default in cmsDriver.py", "updated_at": "1607723068", "user": "makortel"}