{"additions": 154, "auther_ref": "RectangularMTDCleaning", "auther_sha": "82da745a303955b77369a2dba84bc2667a67957e", "author": "parbol", "body": "#### PR description:\r\n\r\nThis PR proposes the following main changes:\r\n\r\n- A cleaning and simplification of the Geometry/MTDGeometryBuilder/interface/RectangularMTDTopology.h class and surrounding classes. The previous code was based on the tracker code and contained many unneeded features for the MTD purposes. These changes by themselves should not affect any output as we have tested locally. \r\n\r\n- Cleaning of the MTDTopology class Geometry/MTDNumberingBuilder/interface/MTDTopology.h, which was essentially unused in the code with the exception of a couple of methods. These changes by themselves should not affect any output as we have tested locally.\r\n  \r\n- We have also inverted the order of the 11th and 12th positions of the ETL vector in mtdParameters.xml in such a way that the 32 pixels are aligned with the long side of the sensor, and the 16 pixels with the short side (It was the other way around before). \r\n\r\n- Addition of new information and methods in the RectangularMTDTopology class to include the non-active interpixel gaps for the ETL and the gaps between the pixels and the sensor borders. This 4 parameters (2 for the x coordinate and 2 for the y coordinate) have been added to mtdParameters.xml. The second 4 positions of the ETL parameters vector have been set to 0 as they are not used anywhere else in the code. This change should slightly change the acceptance of the ETL sensors (since small 50 microns gaps should appear in between pixels and between the pixels and the border of the sendor).\r\n\r\n- Modifications have been made to Geometry/MTDGeometryBuilder/test/MTDDigiGeometryAnalyzer.cc in order to dump the position of the pixels, and also to SimFastTiming/FastTimingCommon/src/ETLDeviceSim.cc in order to discard simhits landing on the gaps.\r\n\r\n#### PR validation:\r\n\r\n- We have checked that the only change in the Digitization is related to the gaps in between the ETL pixels. In this link you can see how the simhits look like with slightly exagerated interpad distances (150 microns in the plots vs. the 50 more realistic gap in the code)\r\n \r\nhttps://cernbox.cern.ch/index.php/s/xweGn88Zs9XN036\r\n\r\n- We have checked that the positions of the pixels in the ETL sensors are as expected.\r\n\r\n", "branch": "master", "changed_files": 17, "closed_at": "1618265398", "comments": 18, "commits": 9, "created_at": "1617710497", "deletions": 1154, "labels": ["code-checks-approved", "fully-signed", "geometry-approved", "orp-approved", "requires-external", "simulation-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "35df19183eef9e34aa4e4113f2313aabb338e690", "merged_at": "1618265398", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 33340, "release-notes": [], "review_comments": 4, "state": "closed", "title": "Rectangular mtd cleaning", "updated_at": "1618265398", "user": "parbol"}