{"additions": 1611, "auther_ref": "exceptionBehaviorBeginEndJobAndStream", "auther_sha": "0a92808f63a065df6f4f25e157f0421978e7db70", "author": "wddgit", "body": "#### PR description:\r\n\r\nImprove the behavior of the Framework after exceptions in beginJob, endJob, beginStream, endStream, beginProcessBlock and endProcessBlock transitions. This is the fourth and final PR in a series of PRs modifying the behavior of the Framework after exceptions so that it more consistently handles exceptions in all the begin/end transitions. The first PR handled stream lumi exceptions (PR #44624). The second PR handled global lumi exceptions (PR #44840). The third PR handled run transitions (PR #45017). The comments at the head of the first PR state the design for the new behavior we are implementing.\r\n\r\nThe intent is that nothing in the output will change if there are not any exceptions. In some cases, ordering of operations may change where that ordering is not supposed to matter. There are some minor differences related to signals.\r\n* PreBeginStream, PostBeginStream, PreEndStream, and PostEndStream signals are newly added. Probably they were inadvertently omitted before.\r\n* The PreBeginJob, PostBeginJob, PreEndJob, and PostEndJob enclose less than before to be more like runs and lumis. Some input source, looper and subprocess signals are no longer enclosed between the higher level Pre and Post signals, but the same module level signals are still enclosed.\r\n* There are functions used by the looper called replaceModule (rarely or possibly never actually used). The module level signals are   not enclosed by transition level signals when called from the replaceModule function. beginStream and beginJob are the module level transitions that are run there when a module is replaced.\r\n\r\nThis work was motivated by discussions related to Issues https://github.com/cms-sw/cmssw/issues/43831 and https://github.com/cms-sw/cmssw/issues/42501.\r\n\r\n#### PR validation:\r\n\r\nAn existing unit test covering exceptions in different transitions is extended to cover the most salient cases. Additional manual testing of many various cases was also done. Existing unit tests pass.\r\n", "branch": "master", "changed_files": 43, "comments": 12, "commits": 1, "created_at": "1720721786", "deletions": 552, "labels": ["simulation-pending", "core-pending", "pending-signatures", "tests-rejected", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_14_1_X", "number": 45434, "release-notes": [], "review_comments": 0, "state": "open", "title": "Improve Framework behavior after exceptions in begin/end transitions (Job, Stream, ProcessBlock)", "updated_at": "1720906170", "user": "wddgit"}