{"additions": 42, "auther_ref": "L1TriggerParameterSetPointerUsage", "auther_sha": "45420cf5a5a39a52ca483ae5e8f832b14a8f8985", "author": "wddgit", "body": "#### PR description:\r\n\r\nIn an effort to reduce memory usage we are attempting to remove pointers into the main ParameterSet held by ProcessDesc from module data members. When that effort is complete, the intent is to submit a separate PR deleting that ParameterSet when beginJob is complete.\r\n\r\nThis PR addresses modules in the L1Trigger subsystems with such a pointer. Below is a summary of the changes.\r\n\r\nCSCTFEfficiency. Pointer is only used in beginJob so it should be OK. Modify the module to set the pointer to null at the end of beginJob. Note this module isn't currently compiled (commented out in BuildFile) and fails compilation for several other reasons if you try to compile it.\r\n\r\nL1MuDTTFConfig.h. The pointer to ParameterSet data member can be deleted by simply passing a ParameterSet reference as an argument to the one function using it.\r\n\r\nL1MuGMTConfig.h No need for the ParameterSet* data member. One can simply use the constructor argument. It is only needed in the constructor. Delete the data member.\r\n\r\nProducerChannelAssignment.cc The easiest fix is to make the data member a ParameterSet instead of a pointer and do a deep copy to it.\r\n\r\nProducerDemonstrator.cc The easiest fix is to make the data member a ParameterSet instead of a pointer and do a deep copy to it.\r\n\r\nDTConfigTraco.h and DTConfigBti.h The pointer is already commented out. I deleted the comments.\r\n\r\n#### PR validation:\r\n\r\nRelies on existing tests.\r\n", "branch": "master", "changed_files": 9, "comments": 3, "commits": 1, "created_at": "1692880721", "deletions": 61, "labels": ["l1-pending", "pending-signatures", "orp-pending", "tests-started", "code-checks-approved", "trk"], "milestone": "CMSSW_13_3_X", "number": 42654, "release-notes": [], "review_comments": 0, "state": "open", "title": "Remove pointers to main ParameterSet in L1Trigger subsystems", "updated_at": "1692881382", "user": "wddgit"}