{"additions": 50, "auther_ref": "hcal-hb_llp_thresholds", "auther_sha": "9a92758653a0ada6e06c633fa7da623f3a715f71", "author": "konpas17", "body": "#### PR description:\r\n\r\nUntil now the thresholds used to set the LLP energy bits in the HB LUTs were hard-coded inside `CalibCalorimetry/HcalTPGAlgos/src/HcaluLUTTPGCoder.cc`. Specifically, the energy thresholds are set per channel, with a choice between a _legacy_ and a _default_ set of values depending on the year (2018 or later) or whether the corresponding cell follows the Plan 1 segmentation. With this update we:\r\n\r\n1. Move this logic to `SimCalorimetry/HcalTrigPrimProducers/python/hcaltpdigi_cff.py`. The choice between the legacy and default values is decided with a Run 3 modifier. This is safe as the LLP bits in the HB LUTs only became a thing in Run 3. The python configuration will serve as the fallback to the new condition-based method.\r\n2. Read the four thresholds from conditions. We repurpose the, until now, unused `auxi2` word of `HcalTPParameters` to store the four thresholds (one per byte). The method falls back to python when the word is empty or when explicitly forced by a dedicated testing switch.\r\n\r\n- No changes are expected in the output at this stage, until the conditions are updated with non-zero values in the auxi2 field of HcalTPParameters.\r\n- This PR is self-contained and does not depend on other PRs or externals.\r\n- Additional documentation: [Indico](https://indico.cern.ch/event/1591849/), [cmshcal#294](https://gitlab.cern.ch/cmshcal/docs/-/issues/294)\r\n\r\nThe changes have been discussed and approved by the HCAL DPG.\r\n\r\n#### PR validation:\r\n\r\n- Code compiles successfully under CMSSW_16_0_X with `scram build code-checks` and `scram build code-format`.\r\n- Tests have been performed locally with `runTheMatrix.py`.\r\n- The LUT generation was tested using `CaloOnlineTools/HcalOnlineDb/test/genLUT.sh`. We tested the energy thresholds for cases where auxi2 is empty, when it is filled, when the switch is open and finally when auxi2 is empty but for a Run 2 GT. LUTs were compared before and after the code updates and were found to be identical in the case of auxi2 being empty and differing only to HB when auxi2 was filled with example values, as expected.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNot a backport. \r\n\r\n@akhukhun @abdoulline @JHiltbrand", "branch": "master", "changed_files": 5, "comments": 8, "commits": 4, "created_at": "1761052272", "deletions": 21, "labels": ["l1-pending", "alca-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending"], "milestone": "CMSSW_16_0_X", "number": 49197, "release-notes": [], "review_comments": 5, "state": "open", "title": "HCAL: Move HB LLP bit energy thresholds to CondDB", "updated_at": "1761153717", "user": "konpas17"}