{"additions": 674, "auther_ref": "hgcsipmontile_dev", "auther_sha": "aeed3f6be3002f5c898cb0a209210a25163732ab", "author": "PFCal-dev", "body": "#### PR description:\r\n\r\nThis PR contains changes in the emulation of realistic conditions for startup and end-of-life scenarios in HGCAL.\r\n\r\n* The bulk of the changes affect the emulation of the SiPM-on-tile sensors. The code used to provide the expected signal, noise, etc. conditions has been refurbished so that it's configured in a way similar to the one used for the Si sensors. Different effects/scalings can be turned on/off by enabling bits in the so called doseMapAlgo in the configuration file. In addition the usage of different SiPM areas is now put in practice when generating events (before it was disabled). These changes enable the generation full realistic scenarios but also scenarios at fixed S/N\r\n\r\n* For Si sensors, the pool of conditions is enlarged to encompass the latest measurements of leakage current and charge collection efficiency performed at CERN. In order to avoid cluttering the baseline configuration file used for digitization with still another set of arrays of numbers, we have introduced an additional auxiliary file with two methods to provide the numbers for leakage current and CCE corresponding to different scenarios. The parameterization of the CCE has also been updated to avoid kinks in the function and extrapolate smoothly to lower fluences: 1-2% differences are expected in the signal yield. This also leads to some changes in the gain choice, in regions where the MIP peak was expected to be falling outside the \"ideal range\" (8-16 ADC counts)\r\n\r\nMost of these changes affect the SimProducers/HGCalSimAlgos (as provider of the expected signal, noise and operation parameters, i.e. gain) and SimProducers/HGCalSimProducers (as consumer of these values).\r\nThe RecoLocalCalo/HGCalRecProducers is also affected due to the introduction of two new parameters used to model the SiPM-on-tile noise. This latter change has been done by @felicepantaleo \r\n\r\n#### PR validation:\r\n\r\nThe impact on standard workflows is expected to be null as these effects are disabled by default in the vanilla productions.\r\nAs such we have validated this PR with:\r\n* standalone production of single muon samples: results presented in\r\n   * https://indico.cern.ch/event/1068378/#7-sipms-in-simulation : slides 8-13 \r\n   * https://indico.cern.ch/event/1079462/#6-sipm-on-tile-calibration-upd  : slides 8,9\r\n* the hgcal dose map validation analyzers under SimProducers/HGCalSimAlgos\r\n* DIGIS produced by runTheMatrix.py -w upgrade -l 23234.103\r\n\r\nA summary of the validation studies for the last two is made in the following slides: [hgcal_prsipmontile_dev_2021Oct21.pdf](https://github.com/cms-sw/cmssw/files/7388256/hgcal_prsipmontile_dev_2021Oct21.pdf)\r\n\r\n\r\n", "branch": "master", "changed_files": 15, "closed_at": "1636174248", "comments": 36, "commits": 27, "created_at": "1634805524", "deletions": 265, "labels": ["reconstruction-approved", "simulation-approved", "fully-signed", "tests-approved", "orp-approved", "upgrade-approved", "code-checks-approved", "hgcal-dpg-approved"], "merge_commit_sha": "7414dd8c7c1f1e410d23914de83462dddad1c478", "merged_at": "1636174248", "merged_by": "cmsbuild", "milestone": "CMSSW_12_2_X", "number": 35763, "release-notes": [], "review_comments": 11, "state": "closed", "title": "Updates to the SiPM-on-tile and Si sensor digitization (end-of-life/realistic startup)", "updated_at": "1636174248", "user": "pfs"}