{"additions": 26, "auther_ref": "ellectronPROMPTMVA_Oct2024_142x", "auther_sha": "42509ad159272b798f58f013681f394d69289391", "author": "Cvico", "body": "#### PR description:\r\n## Brief description\r\nDear reviewers,\r\n\r\nThis PR is to introduce the newest training of the Electron mvaTTH in CMSSW. The training has been performed following what was done already done for Run 2, but using Run 3 MC samples for training and validation.\r\n\r\n## Context of the PR\r\nThe goal for this new training is to be used as a substitute of the current mvaTTH **only in Run 3 MC production**. That is: for Run 2 we still need to keep the current mvaTTH implementation.\r\n\r\n## What this PR includes\r\n**This change should only affect Run 3 production**.  How the mva is evaluated changes a little bit with respect to the previous version: mainly the order in which the variables are parsed to TMVA and also we have added a new additional variable which is `LepGood_pfRelIso03_all`. \r\n\r\n## IMPORTANT REMARK\r\nThe training has been done considering a MiniAOD that has a buggy mvaNoISO variable. Instead of considering the buggy variable, the training has been done with mvaISO (and so it reflects in the config file, the last input variable to the MVA is mvaISO). This will change in the future most likely.\r\n\r\n## Validation\r\nI've performed a local test running a simple `cmsRun` script to see that the mva is loaded and nanoAOD is in fact produced. Below is  the cmsDriver I've used (in a cmssw-el8 container):\r\n\r\n`cmsDriver.py  --python_filename GEN-Run3Summer23NanoAODv12-00146_1_cfg.py --eventcontent NANOEDMAODSIM --customise Configuration/DataProcessing/Utils.addMonitoring --datatier NANOAODSIM --fileout file:GEN-Run3Summer23NanoAODv12-00146.root --conditions 130X_mcRun3_2023_realistic_v14 --step NANO --scenario pp --filein \"dbs:/WZto3LNu_TuneCP5_13p6TeV_powheg-pythia8/Run3Summer23MiniAODv4-130X_mcRun3_2023_realistic_v14-v1/MINIAODSIM\" --era Run3_2023 --no_exec --mc -n 1\r\n`\r\nBelow  there's also a plot comparing the performance of this training vs the current one.\r\n![image](https://github.com/user-attachments/assets/ae3a5a52-3a20-4eb2-8703-438e7465e95d)\r\n\r\n## Other comments\r\nPlease let me know if the proposal is reasonable, and if there's anything else I can do for testing. I'm adding the L2 electron conveners @RSalvatico @afiqaize so they can follow up the PR as well. Feel free to add any other electron convener. I'm also tagging the placeholder PR that Riccardo prepare in the links below (I prefered creating a new one).\r\n\r\n## Linked PRs\r\n- This is the link for the PR that includes the weights in CMS-data: [pull19](https://github.com/cms-data/PhysicsTools-NanoAOD/pull/19).\r\n- Placeholder PR: https://github.com/cms-sw/cmssw/pull/46316", "branch": "master", "changed_files": 1, "comments": 8, "commits": 1, "created_at": "1729686428", "deletions": 2, "labels": ["pending-signatures", "tests-pending", "orp-pending", "requires-external", "code-checks-approved", "xpog-pending", "egamma"], "milestone": "CMSSW_14_2_X", "number": 46492, "release-notes": [], "review_comments": 0, "state": "open", "title": "New mvaTTH weights for Run 3", "updated_at": "1729687193", "user": "Cvico"}