{"additions": 149, "auther_ref": "CR_10_4_0_pre4", "auther_sha": "9265b7fd1a2c5839743ac9c41141b56f80c23bc3", "author": "OzAmram", "body": "This PR is meant to fully implement the new pixel CPE Cluster Repair. \r\nWe are making the changes discussed in the Dec. 14th reco meeting (slides [here](https://indico.cern.ch/event/780022/contributions/3249714/attachments/1771887/2879657/Dec14_reco.pdf)).\r\n\r\nThese changes include:\r\n- Full working version of PixelCPEClusterRepair that will be run in the last fit of tracking, superceding PixelCPETemplate reco\r\n- This new CPE defaults to the same 1D reco as before, but in special cases it will run a 2D reco that can correct for missing charge information\r\n- The 2d reco will be activated for barrel edge-y hits and for broken clusters that have too little charge & too short length\r\n- There is also a small bug fix for CPEBase that fixes possible incorrect setting of cluster edge flags in the case of a cluster of length 1\r\n\r\nOur homework from that meeting was to measure the cost of these changes in CPU time and the benefits in terms of higher level observables. We have done both and attached some slides showing our results. We will be presenting these slides at the Pixel Offline Meeting on Wed. Jan 23rd. \r\n[Slides here. ](https://github.com/cms-sw/cmssw/files/2780837/Jan23.pdf)\r\n\r\nWe are still working on generating all the needed 2D templates for different data taking IOV's so we current expect that many of the automated tests will fail unless they run on a specific IOV's that we currently have templates for and use specific Global Tags. More IOV's will be continually added. \r\n\r\nEDIT:\r\nThis PR still leaves CPE Cluster Repair turned off. To turn it on you only need to uncomment the two lines [here](https://github.com/OzAmram/cmssw/blob/CR_10_4_0_pre4/RecoTracker/TransientTrackingRecHit/python/TTRHBuilderWithTemplate_cfi.py#L15-L16)\r\n\r\n@perrotta @slava77 @fabiocos @makortel @tvami @tsusa @OzAmram @cmantill @schuetzepaul @pmaksim1 ", "branch": "master", "changed_files": 6, "comments": 12, "commits": 7, "created_at": "1548112828", "deletions": 60, "labels": ["code-checks-approved", "comparison-available", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-approved"], "milestone": "CMSSW_10_5_X", "number": 25727, "release-notes": [], "review_comments": 0, "state": "open", "title": "Working Version PixelCPECluster Repair (still turned off)", "updated_at": "1548359725", "user": "OzAmram"}