{"additions": 673, "auther_ref": "EgTrigSum_1120pre7", "auther_sha": "9ae839ca3a9eaa8292638e8666da1904327562cf", "author": "Sam-Harper", "body": "#### PR description:\r\n\r\nThis PR introduces a new trigger object, EgTrigSumObj. \r\n\r\nThe purpose of this is for easing debugging, validation and trigger development. In a nutshell, this object packs all E/gamma ID reco and ID quantities into a single object which can be easily analysed offline. \r\n\r\nThe reason this is necessary is that the HLT builds the e/gamma object bit by bit for CPU efficiency reasons. Therefore you have to associate the GsfTrack, the pixel seeds , the id variables to the supercluster when you want to analyse this. This class does all this for you.\r\n\r\nAt the same time, the producer of the class can also filter PFClusters, calo hits and tracks for further analysis offline. This greatly helps ID tuning as well as validation.  The class may evolve in the future with filtering of the pixel hits, gsf tracks and superclusters in the plans, however it is usable now. \r\n\r\nThis is has been the core of the E/gamma Phase-II development (a separate class for which another PR will be made once this merges handles the phase-II specific things). \r\n\r\nThe goal of this class once merged is to add it to the HLTDEBUG format for RelVals and also in any future Phase-II re-HLT.  Ultimately it may make it into other data tiers once it is stable but that depends on many other things. \r\n\r\nFinally the observant reader will notice that this has a lot of overlap with the scouting egamma format, both store very similar information. However right now they serve different purposes (this is a validation / debugging / trigger dev format) and scouting has an analysis format with strong space constraints. This does not preclude in the future that they merge but right now that is not in the plan. \r\n\r\n#### PR validation:\r\n\r\nTo get it to output, the following snippet can be added to an HLT workflow\r\n```\r\nprocess.load(\"RecoEgamma.EgammaHLTProducers.hltEgammaHLTExtra_cfi\")\r\nprocess.hltEgHLTOut = cms.EndPath(process.hltEgammaHLTExtra)\r\nprocess.schedule.append(process.hltEgHLTOut)\r\nprocess.FEVTDEBUGHLToutput.outputCommands.append(\"keep *_hltEgammaHLTExtra_*_*\")\r\n```\r\n\r\nHappily used for phase-II HLT development.\r\n", "branch": "master", "changed_files": 8, "closed_at": "1612860982", "comments": 38, "commits": 1, "created_at": "1607975610", "deletions": 0, "labels": ["code-checks-approved", "fully-signed", "hlt-approved", "orp-approved", "tests-approved"], "merge_commit_sha": "454c63edaf4e90a611a8d80750310f4a92da3c62", "merged_at": "1612860982", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 32486, "release-notes": [], "review_comments": 31, "state": "closed", "title": "New HLT DEBUG object:  EgTrigSumObj : CMSSW_11_3_X", "updated_at": "1612860982", "user": "Sam-Harper"}