{"additions": 40, "auther_ref": "fixUnclustered106", "auther_sha": "8b346094bb5fb8676ba2c179d779e9dbb174ef63", "author": "ahinzmann", "body": "#### PR description:\r\n\r\n1. Fix MET significance and unclustered pT computation for PUPPI MET. Previously these lines failed for the candidates inside jets as puppi MET and puppi jets are clustered from different particle collections with different particle momenta:\r\nhttps://github.com/cms-sw/cmssw/blob/760c98128277dcab5dc4d2887c5c814cb0401740/RecoMET/METAlgorithms/src/METSignificance.cc#L95-L99\r\nParticles from jets with puppi!=puppiForMET weights were not removed or falsely kept from unclustered energy.\r\n\r\n2. Fix MET unclusted pT uncertainty computation for PUPPI MET. Previously this line failed for the candidates inside jets as puppi MET and puppi jets are clustered from different particle collections:\r\nhttps://github.com/cms-sw/cmssw/blob/760c98128277dcab5dc4d2887c5c814cb0401740/PhysicsTools/PatUtils/python/tools/runMETCorrectionsAndUncertainties.py#L791\r\nParticles from jets were not removed from unclustered energy.\r\n\r\n3. Replace dE-matching by dR-matching when computing unclustered pT and MET signficance for PF MET and PUPPI MET. Some low pT particles randomly passed the dE matching even though they did not point in the same direction, leading to changes up to 25%.\r\n\r\nIn this PR for UL-reMiniAOD, the issue is fixed by matching candidates based on dR instead of Ptrs. In the corresponding PR in the master #29254, the issue is solved by using the same particle flow collections for puppi jets and puppi MET and separate weight valuemaps.\r\n\r\n#### PR validation:\r\n\r\nOn 100 events of 136.8311, it was checked that this PR obtains the same values of metSumPtUnlustered, metSignficance and unclustered energy uncertainties as the corresponding PT in the master #29254.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nThis is a backport of the fix in #29331.", "branch": "CMSSW_10_6_X", "changed_files": 5, "closed_at": "1585722813", "comments": 25, "commits": 3, "created_at": "1585388233", "deletions": 6, "labels": ["analysis-approved", "backport-ok", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "e75ddf28f1be134071abf833d1bc7b729955bd47", "merged_at": "1585722813", "merged_by": "cmsbuild", "milestone": "CMSSW_10_6_X", "number": 29330, "release-notes": [], "review_comments": 4, "state": "closed", "title": "Fix MET unclustered energy computation [10_6_X]", "updated_at": "1585943544", "user": "ahinzmann"}