{"additions": 540, "auther_ref": "pixelimage_morphing", "auther_sha": "73c93472c831c0ccc97b1f1faf5d2f951501e93e", "author": "CMSTrackerDPG", "body": "**PR description**:\r\nThis PR implements a new data format for the clustering algorithm for the pixel digis. The new data format is a densely populated 2D image as compared to the 1D sparsely populated digi_view. Also this PR can optionally apply the morphing algorithm for adding fake digis before doing the clustering. This morphing feature proceeds with a dilation step followed by an erosion. In the config these kernels are defined as a 1D array which store the matrix elements for the 3x3 kernels. The following options can now be set in the EDProducer config.:\r\nDoDigiMorphing = cms.bool(True), #Default False\r\nDigiMorphing = cms.PSet(\r\nkernel1 = cms.vint32(1, 1, 1, 1,1,1,1,1,1), # Example kernel values for the dilation kernel\r\nkernel2 = cms.vint32(0, 1, 0, 1,1,1,0,1,1), # Example kernel values for the erosion kernel\r\n)\r\n\r\n**Implementation details**:\r\n- SiPixelMorphing.cc defined for storing configuration of morphing parameters\r\n- Two ImageSoAs types are now available and depending on the doDigiMorphing flag, either one is used. For no morphing, the SoA with single layer padding is used and for morphing, 2 layer padding. This saves memory consumption in case morphing is disabled\r\n- The makePhase1ClustersAsync function is now templated with ImageType and TrackerTraits(default) and all templated function definitions are defined in SiPixelRawToClusterKernel.dev.cc file\r\n- The templated Image is passed to the FindClus kernel which is also templated with ImageType\r\n\r\n**PR validation**:\r\nThe code compiles. Comparisions with the legacy CPU code and the current GPU code were also made here: https://indico.cern.ch/event/1555234/contributions/6567409/attachments/3087292/5466320/digimorphing_2%20(1).pdf", "branch": "master", "changed_files": 9, "comments": 42, "commits": 23, "created_at": "1750154723", "deletions": 214, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-rejected", "heterogeneous-rejected", "trk"], "milestone": "CMSSW_15_1_X", "number": 48343, "release-notes": [], "review_comments": 7, "state": "open", "title": "Pixelimage morphing", "updated_at": "1755868709", "user": "Chirayu18"}