{"additions": 65, "auther_ref": "mvatth_run3_14_1_0_pre0", "auther_sha": "7dcfa1bf3eb229fe98f0494c23f598f382d92aad", "author": "Cvico", "body": "#### PR description:\r\n## Brief description\r\nDear reviewers,\r\n\r\nThis PR is to introduce the newest training of the Muon mvaTTH in CMSSW. The training has been performed following what was done already done for Run 2, but using Run 3 MC samples for training and validation.\r\n\r\n## Context of the PR\r\nThe goal for this new training is to be used as a substitute of the current mvaTTH **only in Run 3 MC production**. That is: for Run 2 we still need to keep the current mvaTTH implementation (can be found in these lines), and for Run 3 we want to make use of an era modifier to fetch the proper --new -- weights that have been computed.\r\n\r\n## What this PR includes\r\n**This change should only affect Run 3 production**. For that, this PR includes:\r\n 1. The required era modifiers in `Configuration/Eras/`.\r\n     * I've added two new era modifiers `run3_muon_2022` and `run3_muon_2023`, which are called from the general `Run3_Eras_cff.py`. \r\n     * I hope this is the optimal way to handle our use case.\r\n 3. The call to the era modifier and the implementation of the new mvaTTH evaluation.\r\n     * How the mva is evaluated changes a little bit with respect to the previous version: mainly the order in which the variables are parsed to TMVA and also we have added a new additional variable which is `LepGood_pfRelIso03_all`.\r\n     * Which weights should be read in order to properly compute the mva score.\r\n\r\n## Validation\r\nI've performed a local test running a simple `cmsRun` script to see that the mva is loaded and nanoAOD is in fact produced. \r\n\r\n## Other comments\r\nPlease let me know if the proposal is reasonable, and if there's anything else I can do for testing. I'm adding the L2 muon convener @JanFSchulte so he can follow up the PR as well. Feel free to add any other muon convener (I don't have their github user names unfortunately).\r\n\r\n## Linked PRs\r\nThis is the link for the PR that includes the weights in CMS-data: [pull16](https://github.com/cms-data/PhysicsTools-NanoAOD/pull/16).", "branch": "master", "changed_files": 6, "comments": 40, "commits": 7, "created_at": "1709675139", "deletions": 19, "labels": ["reconstruction-pending", "operations-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved", "xpog-pending", "egamma"], "milestone": "CMSSW_14_1_X", "number": 44322, "release-notes": [], "review_comments": 12, "state": "open", "title": "Implemented new modifiers for mvaTTH Run 3", "updated_at": "1710923165", "user": "Cvico"}