{"additions": 1485, "auther_ref": "pixel_fastsim_10_2_X", "auther_sha": "911b7264984f6bfad28a6302348035a5c72c4e8c", "author": "pmaksim1", "body": "This is the missing piece of Angira's \"new FastSim tracking\" PR which has already been integrated into 10.2.0, providing the correct resolution files for Phase 1.  (This is especially important for the forward, since the geometry of the Phase1 forward disks is very different than from Phase 0.)  The effect can clearly be seen in this plot:\r\n\r\n![image](https://user-images.githubusercontent.com/4876625/42725976-113d4766-875b-11e8-8afa-d29eb0d9ec30.png)\r\n\r\nNamely that there was little effect in the barrel, but there is a large effect in the forward (high eta) especially for the track fake rate.   For Phase 0, the new code is statistically identical to the old code.\r\n\r\nThe summary of changes to the code:\r\n\r\n- pixel RecHit smearing code has been completely rewritten, in order to make it more maintainable, and extensible to other geometries.  (The old code assumed a lot of things about the Phase 0 geometry, whereas the new code pushes all physics / geometry issues to pixel template object and the resolution histograms.)\r\n- the pixel resolution histograms are now separated for each type of pixel RecHit (regular vs cluster-on-edge vs cluster-with-big-pixel) as well as for each DetUnit with a specific orientation of local B field (since that determines the drift).  Thus, a pixel template matches each pixel resolution histogram file.\r\n- pixel templates are loaded from the DB.  (For Phase2 studies, they can also be loaded from the local directory.)\r\n- the current code is essentially completely generic, and will work for Phase2 as well. \r\n\r\nNote that the hit merging is still off.  Its effects have not been studied well enough to turn it on at this time.\r\n\r\n\r\n\r\n\r\n", "branch": "master", "changed_files": 14, "closed_at": "1534012927", "comments": 119, "commits": 26, "created_at": "1531576347", "deletions": 569, "labels": ["code-checks-approved", "comparison-available", "fastsim-approved", "fully-signed", "orp-approved", "requires-external", "tests-approved"], "merge_commit_sha": "3872c27ef6f4f618fa6387ff88cc9cc7ee95a8cd", "merged_at": "1534012927", "merged_by": "cmsbuild", "milestone": "CMSSW_10_3_X", "number": 23799, "release-notes": [], "review_comments": 7, "state": "closed", "title": "New pixel RecHit infrastructure for FastSim (for Phases 0, 1, 2, and beyond)", "updated_at": "1534012927", "user": "pmaksim1"}