{"additions": 32, "auther_ref": "dqm-remove-more-dqmstore-features", "auther_sha": "fe8e8523b8e2d497375680a9e312a40383e50abf", "author": "schneiml", "body": "#### PR description:\r\nThis PR removes more rarely used functionality from the DQM infrastructure, namely\r\n- `scaleElements`: not sure what this was ever used for, online maybe?\r\n- `softReset`: this feature is rather useful, but the few usages don't really justify the complexity. Used mainly in ECAL DQM.\r\n- `setAccumulate` flag: basically unused, not sure what it was supposed to signal.\r\n- `remove*`: Used in a bunch of places mostly for non-standard workflows. Remove is very hard to support safely (even today, it might randomly invalidate pointers that other modules are holding), so we have to drop it. The most common pattern is *\"check if ME exists, if yes remove, then book\"*: this probably was not required in most cases, but it might be required to re-bin plots. We might change semantics of `book*` to *replace* an existing ME if *merge* is not possible, without invalidating the exisiting MEs (only replace the `TH1`). [update]\r\n- `QStatisticalTests`: completely unused. [update]\r\n\r\n#### PR validation:\r\nRequires feedback from subsystem users, mainly ECAL (@tanmaymudholkar ?) regarding `softReset`. I suspect this PR will change behavior for ECAL online DQM.\r\n\r\nThe other user of `softReset` is `HLXMonitor`, which as far as I understand is history. Not sure if anybody feels responsible.\r\n\r\n`scaleElements` was called in the `MEtoEDM` workflow, so it might affect AlCa/PCL. I suspect it does not (I can't see any configuration for it, and I don't see what it would be good for), but it might be worth another check.\r\n\r\nRemove was used in a lot of places, I suspect in most cases this will only make additional MEs show up in the output. However, there might be cases where re-booking now behaves incorrectly. I typically removed the entire `cleanup` functionality incl. config options, unless that seemed to complicated, then I left a comment in the now-useless function stubs.", "branch": "master", "changed_files": 77, "closed_at": "1574628077", "comments": 77, "commits": 14, "created_at": "1571832446", "deletions": 1525, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "dqm-approved", "fully-signed", "hlt-approved", "orp-approved", "tests-approved"], "merge_commit_sha": "96fbb47377e36e6bd7427f7365dc187e023ca8b4", "merged_at": "1574628077", "merged_by": "cmsbuild", "milestone": "CMSSW_11_0_X", "number": 28247, "release-notes": [], "review_comments": 26, "state": "closed", "title": "DQM: Remove more DQMStore features", "updated_at": "1574628078", "user": "schneiml"}