{"additions": 1732, "auther_ref": "150x-dth-v1", "auther_sha": "ddb86e8fbeb33dc7fd5db1dfcc6e1ec5c50f7560", "author": "smorovic", "body": "#### PR description:\r\n\r\n* fixes to DTH parser based on tests with real DTH output (reverse bit order compared to first assumption, headers are also low endian). Also fix case of orbit containing only one event and by default disable checksum in unit test because this does not work for data at the moment.\r\n\r\n* set of changes to allow multi-directory sourcing in DTH model. It can be parametrized through DaqDirector, in the future it will be detected from ramdisk metadata.\r\n\r\n* added fileDiscoveryMode that can be used live instead of fileBroker (with DAQSource), although lower performance is expected on NFS due to doing many file operations. Atomicity in grabbing files ensured by renaming file to unique name containing host and pid. This even guarantees atomicity in file grabbing over NFS. Target for this is, apart from unit test, DAQ test kit for DTH and DAQ4 column.\r\n\r\n* For the new mode, added eventCounter function (to models) which can do early counting of events in the file\r\nif neither the (deprecated) json index file is not provided and file does not come with file header providing\r\nevent count and (optionally) file size.\r\n\r\n* Autodetection of raw file header without the file-broker is implemented.\r\n\r\n* unit tests implemented for various new scenarios. Replaced fileListMode tests with fileDiscoveryMode which has more overlap with production\r\n\r\n* copy new daqParameters json file by the fakeBU\r\n\r\n* added README with documentation of the DAQSource modular interface\r\n\r\nThe plan is to backport this PR to 15_0_X series after it is ready for master.\r\n\r\n#### PR validation:\r\n\r\nCovered with new unit test. Also tested the new fileDiscoveryMode in DAQ test VM cluster, as well as the standard production mode with file broker and FedRawDataInputSource.\r\n\r\n\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nbackport of #47410\r\n", "branch": "CMSSW_15_0_X", "changed_files": 23, "comments": 2, "commits": 8, "created_at": "1740151885", "deletions": 374, "labels": ["daq-pending", "pending-signatures", "tests-pending", "orp-pending"], "milestone": "CMSSW_15_0_X", "number": 47422, "release-notes": [], "review_comments": 0, "state": "open", "title": "[DAQ] improvements for DTH readout, new file discovery mode (15_0_X)", "updated_at": "1740151921", "user": "smorovic"}