{"additions": 2336, "auther_ref": "bricked-barrelonly", "auther_sha": "10ac102367f01fc545e80c53fad6c0dbd1c254e4", "author": "adewit", "body": "#### PR description:\r\n\r\nThis PR adds two new phase2 tracker layouts proposed in the IT sensors performance task force and correspond to evolutions of T27 (geometry with bricked pixels). More information [[in these slides](https://indico.cern.ch/event/1072175/contributions/4648635/attachments/2362758/4033767/em20211210.pdf])] \r\n\r\nIn particular this adds:\r\n- T28, a tracker based on T25, with 25x100 mum2 3D pixels in IT TBPX layer 1, bricked pixels in the central rod of TBPX layers 2 and 3, in the central 3 rods of TBPX layer 4, in TEPX, and in disks 5-8 of TFPX. The other pixels are planar 25x100 mum2.\r\n\r\n- T29, a tracker based on T25, with 25x100 mum2 3D pixels in IT TBPX layer 1, bricked pixels in the central rod of TBPX layers 2 and 3, in the central 3 rods of TBPX layer 4. 50x50 mum2 planar pixels are used in TFPX and TEPX. \r\n\r\nThere are no changes in the OT wrt T25.\r\n\r\nT28 is included in geometry scenario 2026D89 and T29 in scenario 2026D90\r\n\r\n**important**: we use process modifiers to account for the presence of bricked pixels, but no square pixel process modifiers are applied (even in T29). The reason for this is that with the square pixel process modifier the genErrors are used when running the CPE without track angles, but we do not have genErrors for bricked pixels.\r\n\r\n@emiglior @tsusa @connorpa fyi\r\n\r\n#### PR validation:\r\n\r\n- checked XMLs make sense wrt tracker design\r\n- checked that the workflows with scenarios D89 and D90 run smoothly with no warnings.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nNot a backport\r\n", "branch": "master", "changed_files": 19, "closed_at": "1640106293", "comments": 22, "commits": 4, "created_at": "1639164909", "deletions": 0, "labels": ["geometry-pending", "operations-pending", "pending-signatures", "tests-pending", "pdmv-pending", "orp-approved", "urgent", "upgrade-pending", "code-checks-approved"], "merge_commit_sha": "1d3499ad1b75471d95460bfe1d676295dbe88842", "merged_at": "1640106293", "merged_by": "cmsbuild", "milestone": "CMSSW_12_3_X", "number": 36457, "release-notes": [], "review_comments": 1, "state": "closed", "title": "Phase 2 tracker: add T28 and T29 (geometries with bricked pixels for IT sensor design studies)", "updated_at": "1640106294", "user": "adewit"}