{"additions": 59, "auther_ref": "from-CMSSW_14_0_X_2024-09-10-2300_KBv1", "auther_sha": "ff3777b596286a2b46e7a8cda3797fc758cc0be4", "author": "kbunkow", "body": "#### PR description:\r\n\r\nThis PR adds the possibility of configuring the OMTF emulator directly from the config XML, without using the L1TMuonOverlapPhase1ParamsESProducer.\r\n\r\n#### PR validation:\r\n\r\nThe PR was validated by running the L1T DQM on one file from run 385422. \r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is a backport of https://github.com/cms-sw/cmssw/pull/45032 \r\nOnly the files from the L1TMuonOverlapPhase1 folder are backported, as L1TMuonOverlapPhase2 is not included in the CMSSW_14_0_X.\r\nThis PR will be followed by the backport of https://github.com/cms-sw/cmssw/pull/45984\r\n\r\nThis PR and the backport of https://github.com/cms-sw/cmssw/pull/45984 will ensure that the OMTF emulator will be configured from the XML files corresponding to the 2024 OMTF algorithm version that was deployed at CSM on 19th March 2024, provided the Era Run3_2024 is defined for the job.\r\nThis will fix the data-emulator mismatches present in the DQM since the beginning of the 2024 pp run. Besides, will ensure the upcoming 2024 MC production will use the 2024 OMTF algorithm version.\r\n\r\n#### Details of changes:\r\n\r\nOMTFReconstruction.h and OMTFReconstruction.cc\r\nThe possibility of configuring the OMTF emulator directly from the config XML is added. When both patternsXMLFile and configXMLFile are given from the python config of the simOmtfDigis or simOmtfPhase2Digis, the L1TMuonOverlapParams are read directly from these files, and the L1TMuonOverlapPhase1ParamsESProducer is not needed. Otherwise, the L1TMuonOverlapParams are obtained from the eventSetup (so from the DB, or from the L1TMuonOverlapPhase1ParamsESProducer - if it is defined).\r\n\r\nL1Trigger/L1TMuonOverlapPhase1/src/Omtf/OMTFProcessor.cc line\r\ntrackAddr[3] = myCand->getGpResultUnconstr().getPdfSumUnconstr(); is removed, as uGMT expects 3 entries in the TrackAddress (when there were 4, uGMT was generating a warning).\r\n", "branch": "CMSSW_14_0_X", "changed_files": 3, "comments": 15, "commits": 1, "created_at": "1726135605", "deletions": 31, "labels": ["l1-approved", "fully-signed", "tests-approved", "orp-pending", "urgent", "backport-ok"], "milestone": "CMSSW_14_0_X", "number": 45988, "release-notes": [], "review_comments": 0, "state": "open", "title": "possibility of configuring the OMTF emulator directly from XMLs (14_0_X)", "updated_at": "1726485407", "user": "kbunkow"}