{"additions": 2080, "auther_ref": "ZnnHbbDQM_73", "auther_sha": "f2382f6c1586bfcca518ecbdfbdc99193e17fc93", "author": "jasperlauwers", "body": "The pull request contains code necessary for the VBFHbb and ZnnHbb DQM.\nThis comes down to the following main changes:\n- Addition of PFJets and PFMET. For completeness also the possibility to use genJets is included.\n- Reconstructed jets can be saved with btag and 4-vector information in the MatchStruct's. For the PFJets it was necessary to include a pre b-tagging sequence to generate the b-tag information.\n- The implementation of N-1 cuts, including cuts on two-jet variables.\n\nIt was checked that the changes do not influence the other Higgs analyses plots. That is, after correcting a \"bug\" that was present in the previous code. \nThe difference caused by this correction will manifest itself in two ways which is most easily explained by looking at two analyses:\n- Hgg: only 2 photons will be filled in the eta and phi histograms, instead of 3 before (clearly noticeable at generator level). \n- HZZ: only the 4 leading pt leptons will be filled in the histograms.\n\nBecause the indentation has been fixed in the end, it is recommended to look at the changes using commit f3f5c02.\n\nAt the moment only the histograms for ZnnHbb are added.\nThe increase in size:\n\n| subsystem/folder | histograms | bins | Empty bins | Empty/Total | bins per histogram | MB | kB per histogram |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| Higgs Standard | 330 | 16012 | 11831 | 0.739 | 48.5 | 0.0611 | 0.19 |\n| Higgs with ZnnHbb added | 358 | 16844 | 12652 | 0.751 | 47.1 | 0.0643 | 0.184 |\n\ncc: @HuguesBrun, @slehti\n", "branch": "CMSSW_7_3_X", "changed_files": 14, "closed_at": "1413362880", "comments": 28, "commits": 36, "created_at": "1412349567", "deletions": 1295, "labels": ["comparison-available", "dqm-approved", "fully-signed", "tests-approved"], "merge_commit_sha": "efc49788e4d31876fbfd207274fe0def13bf62cb", "merged_at": "1413362880", "merged_by": "nclopezo", "milestone": "Next CMSSW_7_3_X", "number": 5684, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Implementation of jets and N-1 cuts needed for the VBFHbb and ZnnHbb analyses", "updated_at": "1413362881", "user": "jasperlauwers"}