{"additions": 2273, "auther_ref": "ape_trend_backport", "auther_sha": "968829481a9fce88740a92d83049be56efa89ffa", "author": "mteroerd", "body": "Backport of #27656\r\n#### PR description:\r\n\r\nThis PR is the summary of some changes that were made to the APE estimation tool during the UL2017 and UL2018 campaigns. \r\n\r\nIt includes:\r\n- a tool for trend plots (hence, the data/ folder and additions in test/plottingTools)\r\n- a way to change marker styles and colors for result plots\r\n- a way to add the number of hits in a sector to result plots\r\n- fix to a small typo in test/batch/startSkim.py\r\n- fix to the wrong ideal alignment being loaded in test/cfgTemplate/apeEstimator_cfg.py\r\n- additional functionality for test/autoSubmitter:\r\n  * Basic support for submitting to condor \"CAF queue\".\r\n  * Protection against cases where the condor scheduler is unavailable when submitting jobs which used to cause crashes. Now, in this case the submission is retried after some waiting time until it works.\r\n  * Support for running multiple threads to handle measurements in case of large campaigns. Before, it happened that condor jobs (that do the track refits) of  measurements finished while another measurement was being handled, so that there was some delay before these measurements were handled, which piled up to longer delay when doing many measurements. \r\n   * Some minor changes like putting some functions into helper.py and introducing new shortcuts for convenience.\r\n\r\n#### PR Validation:\r\n\r\nThe validation happened while using the tool. Since no changes were made that could affect the APE results themselves, everything was transparent.\r\n\r\n#### if this PR is a backport please specify the original PR:\r\nBackport of #27656", "branch": "CMSSW_10_6_X", "changed_files": 14, "closed_at": "1568892332", "comments": 11, "commits": 1, "created_at": "1567687914", "deletions": 312, "labels": ["alca-approved", "backport-ok", "comparison-available", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "ca3c6e4b2efc0c5988d494a91e7518561b095ad3", "merged_at": "1568892332", "merged_by": "cmsbuild", "milestone": "CMSSW_10_6_X", "number": 27936, "release-notes": [], "review_comments": 0, "state": "closed", "title": "APE tool: Trend plots, some minor fixes: Backport of #27656", "updated_at": "1568892333", "user": "mteroerd"}