{"additions": 126, "auther_ref": "CMSSW_7_5_7_patch2/sign648/memPeaks", "auther_sha": "e66f643cafadfc805002310f92888c0a84ff435b", "author": "slava77", "body": "originally, as a follow up to cmsRun1-68 from \nhttps://hypernews.cern.ch/HyperNews/CMS/get/recoDevelopment/1405.html\n\n(I)\nusing the heavier events from the report and igprof -mp, the muon isodeposits were found to contribute up to 400 MB/event in memory (at least an order of magnitude less is expected for more normal HI events and much less for pp events).\nIt turns out that the isodeposits put in the event are not used anywhere in HI workflows.\nSo, they are dropped.\nThis has the largest \"long-term\" impact (from the time muon id module runs to the end of the event)\n\n(II)\nIn addition, modules with fairly large memory churn (MEM_TOTAL) were cleaned somewhat trivially, without changing the algorithm logic.\nThe net effect on the large events was about 15-20% reduction in allocations in stream::EDProducer and stream::EDAnalyzer modules.\nThere are only short-term (less than the module ::produce time) contributions.\nThe optimizations here also speed up substantially the modified modules.\n\nOverall, for the job that failed at T0: the 8-thread configuration memory peak reduced from 15.67 GiB to 14.88 GiB.\n\ntested in CMSSW_7_5_7_patch2: no differences were observed in monitored quantities\n", "branch": "CMSSW_7_5_X", "changed_files": 14, "closed_at": "1450053119", "comments": 7, "commits": 7, "created_at": "1449902161", "deletions": 145, "labels": ["comparison-available", "dqm-pending", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-rejected"], "merge_commit_sha": "cbf697d1784862d01c40f3eb1bc9378f6cf87acd", "merged_at": "1450053119", "merged_by": "davidlange6", "milestone": "CMSSW_7_5_X", "number": 12764, "release-notes": [], "review_comments": 0, "state": "closed", "title": "memory reduction most visible for HI processing, done mostly by dropping muon isodeposits in HI", "updated_at": "1450053119", "user": "slava77"}