{"additions": 481, "auther_ref": "duplicateMergeOverlaps", "auther_sha": "d8e0b86a083a8f081c464e6f5188459a0cf184c5", "author": "makortel", "body": "This PR enhances `DuplicateTrackMerger` to identify duplicate tracks caused by hits from overlapping modules. The development targets phase1 FPix, but is agnostic to actual geometry. Idea is to\r\n* find track pairs with close-enough parameters (using parts of the existing logic)\r\n* go over simultaneously the hits of the two tracks\r\n  * require that hits from the same layer come from different modules (unless the hits are the same)\r\n    * this alone is very effective to reduce duplicate rate, but is too aggressive (efficiency decreases and fake rate increases)\r\n  * propagate the starting state of the longer track to the hit of the shorter track, require chi2 compatibility\r\n\r\nThere is certainly room for further improvement, to be studied later.\r\n\r\nHere are MTV plots for phase0, phase1, phase1CA (all with ttbar+25PU) and phase2 D4Timing (ttbar+200PU)\r\nhttps://mkortela.web.cern.ch/mkortela/tracking/validation/CMSSW_9_0_0_pre4_duplicateMerge/\r\n(for phase1 the reference is 900pre4 + re-trained track selection MVA, without the new MVA the effect is likely a bit different; the difference between the red and black is purely technical, not even in a separate commit)\r\n\r\nTiming of the module increases by a factor of 2-3 (for PU35-200), being still at most a few percent of total tracking time.\r\n\r\nTested in 9_0_0_pre4, expecting changes as indicated above.\r\n\r\n@rovere @VinInn @felicepantaleo @ebrondol ", "branch": "CMSSW_9_0_X", "changed_files": 7, "closed_at": "1487615413", "comments": 13, "commits": 7, "created_at": "1487082013", "deletions": 132, "labels": ["comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "e4cca1c115de595eefd814e752cbd6f1f5d73d05", "merged_at": "1487615413", "merged_by": "cmsbuild", "milestone": "CMSSW_9_0_X", "number": 17511, "release-notes": [], "review_comments": 8, "state": "closed", "title": "First version of merging duplicate tracks caused by module overlaps", "updated_at": "1488460054", "user": "makortel"}