{"additions": 1633, "auther_ref": "TrackFitters76", "auther_sha": "13c2f737de0695dbe8a881a6f2d535b2516b2054", "author": "VinInn", "body": "This PR features a number of improvement of iterative tracking\n1) Outlier rejection has been reworked to avoid to reject tracks with too many outliers generated by a \"bad turn\" during pattern recognition. Now the algorithm tries also to remove the last hit of the trajectory.\nOpportunity taken for some cleanup in Fitters and TrackProducers\n2) DuplicateMerging has been re-engineered, aligned to current standards and retuned. As side effect its speed as been improved of almost a factor 2.\n3) In Iterations that share Pair and Triplet Seeds a Penalty has been introduced to require more minimum hits during pattern recognition in case of Pairs. This reduces fakes in pixelLess and TobTec iterations\n4) as side effect of the latter it has been found that increasing by one the minimumHit requirement in JetCore improves both efficiency and fake rate.\n\nEvidence supporting the usefulness of the above is posted (as MTV plots)\nin http://innocent.home.cern.ch/innocent/PR11725/\nwhere one ne can find comparisons of pre6 vs pre7 vs this PR for ttbar at pu 10,15,35 and qcd_600_800\nFrom the summary one can already noticed how, at the cost of an almost negligible difference in efficiency, both fake and duplicates rates decrease sizably.\nLooking in more details both the missingInner and missingOuter hits are improved as well as the total number of hits per tracks.\n", "branch": "CMSSW_7_6_X", "changed_files": 105, "closed_at": "1445950686", "comments": 29, "commits": 32, "created_at": "1444569464", "deletions": 1839, "labels": ["alca-approved", "comparison-available", "core-approved", "dqm-approved", "fastsim-approved", "fully-signed", "orp-pending", "reconstruction-approved", "tests-approved"], "milestone": "CMSSW_7_6_X", "number": 11725, "release-notes": [], "review_comments": 15, "state": "closed", "title": "Tracking Reco: tuning of outlier rejection, duplicate merging, pairSeeding", "updated_at": "1445950686", "user": "VinInn"}