{"additions": 12, "auther_ref": "new-slopes-for-S9S1filter", "auther_sha": "cbf470de6d8a85cbabb2c4fa9e5395caf569f662", "author": "toropin", "body": "#### PR description:\r\nThis PR is devoted to the definition of new slopes for the limit lines in the planes 'S9S1 vs log(ELong)' for HF S9S1 filter. The slopes are different for the different HF Ieta values.\r\nAll parameters of S9S1(S8S1) filter were defined in ~2010 with lower energy of colliding beams and lower luminosity. It is the isolation filter and with much higher luminosity we have now the isolation\r\nparameters could be different. See report in ref. 1 from slide 29.\r\nOn slide 30 presented distributions S9S1 vs log(ELong) for different Ieta. There are 2 inclined lines in each plot for Ieta 30 - 34. The lower lines correspond to the current slope parameters, the upper\r\nlines correspond to the proposed new parameters.\r\nThe goal of this work is to reduce populations of hits above the old slope lines. These hits could be responsible for fake jets originated in HF.\r\nOn slides 34 and 35 presented the examples of HF hits which could be marked by S9S1 filter if slopes would be increased. In the lower lines in the captions to the pictures you can see S9S1 as the value calculated by filter, S9S1cut is the limit defined with old slopes, S9S1max is the new limit defined with changed slopes.   \r\n\r\nReferences:\r\n1. https://indico.cern.ch/event/807827/contributions/3362430/attachments/1816769/2969579/HFStripFilter_22Mar2019.pdf\r\n\r\n#### PR validation:\r\nIn this PR only python file HFPhase1Reconstructor_cfi.py was modified. S9S1 slopes were multiplied by vector of constants to increase their values. These modifications are for Run 2 data. This file is for Run 2 reconstruction and this PR cannot affect data of Run 1.\r\n\r\nThe performance of reconstruction with the new slopes was tested. On the Screenshot of EventDisplay (FireWorks) below presented HF hit (signal in Long fiber) which was not marked by S9S1 filter. For these pictures threshold = 40 GeV was applied.\r\n\r\n<img width=\"1201\" alt=\"image\" src=\"https://user-images.githubusercontent.com/7665869/55708684-cd1b9d80-59e6-11e9-821f-992fa131fd4b.png\">\r\n\r\nOn the picture below presented the same hit marked by S9S1 filter after slopes were increased. In the column 'flags' uppermost hit has flag value 1048577. It means it has bit0 = 1 which corresponds to the S9S1 filter decision. \r\n\r\n<img width=\"1199\" alt=\"image\" src=\"https://user-images.githubusercontent.com/7665869/55708847-3bf8f680-59e7-11e9-9f59-c4ba65ac6d44.png\">\r\n", "branch": "master", "changed_files": 1, "closed_at": "1554835361", "comments": 13, "commits": 1, "created_at": "1554704606", "deletions": 8, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "84473083342cfe8dae4bf6a67c8c88c7d44b2b15", "merged_at": "1554835361", "merged_by": "cmsbuild", "milestone": "CMSSW_10_6_X", "number": 26382, "release-notes": [], "review_comments": 0, "state": "closed", "title": "New slopes for S9S1filter", "updated_at": "1554835361", "user": "toropin"}