{"additions": 1413, "auther_ref": "CalibrationFor_CMSSW_8_0_X", "auther_sha": "315110026756117b8aa622a52a89aff623e2e8cf", "author": "dimattia", "body": "Greeting,\n\nthis pull request implements the new paradigma of the Gain Calibration. Two AlcaReco streams have been implemented:\n- [ **SiStripCaMinBiasAfterAbortGap** ] which is feed by data coming from the First Collision after the Abort Gap. These data are unaffected by the H.I.P. effect and will be used for tuning the MPV working point of each APV.\n- [ **SStripCalMinBias** ] which is feed by data coming from the ZeroBias trigger and the Isolated Muon trigger. These data will be used for monitoring the quality of the dE/dx (with hight pT muon), the stability of the cluster charge shape and of the MPV (with ZeroBias tracks). In addition the evolution of the cluster charge distortion due to the H.I.P. can be study by comparison with the data from First Collision after the Abort Gap. \n\nIn the ALCAPrompt reconstruction of each stream, the data statistics is further split according to the Magnet Field status (ON/OFF).\n\nTo implement the freedom of changing the input trigger selection, feeding the streams, without touching the python configuration (e.g. without the need of a new software release) the following AlCaReco Trigger Bits are used to filter the input data:\n- SiStripCalMinBias, for the SStripCalMinBias stream;\n- SiStripCalMinBiasAfterAbortGap, for the SiStripCalMinBiasAfterAbortGap stream;\n- SiStripcalMinBiasHI,  for the SiStripCalMinBias stream for the Heavy ion data;\n- SiStripCalMinBiasAfterAbortGapHI, for the SiStripCalMinBiasAfterAbortGap stream for the Heavy Ion data;\n\nThe default setup of these trigger bits for the 2016 data taking will be:\n- SiStripCalMinBiasAfterAbortGap: HLT_ZeroBias_FirstCollisionAfterAbortGap\n- SiStripCalMinBiasAfterAbortGapHI: HLT_ZeroBias_FirstCollisionAfterAbortGap\n- SiStripCalMinBias: HLT_ZeroBias + IsoMu20\n- SiStrpCalMinBiasHI: do not know yet;\n\nThe AlCalPrompt statistics is shipped into the following DQM directories: AlCarReco/SiStripGain (feed by SiStripCalMinBias) and AlCaReco/SiStripGainAfterAbortGap (feed by SiStripcalMinBiasAfterAbortGap). This statistics is used to produce the gain payload and to perform the monitoring and the cluster charge studies.\n\nMissing Items in this Pull request:\n- Further split of the statistics among HLT_ZeroBias and IsoMu20 inside the Prompt reconstruction of the SiStripCalMinBias stream. This splitting is performed within the C++ code with runs in the PCL workflow. It is desirable to have it included for the data taking;\n- Fixes and patched to the offline macro used to compute an monitor the computation of the gain payload. This code runs outside the PCL workflow.\n", "branch": "CMSSW_8_0_X", "changed_files": 46, "closed_at": "1460055083", "comments": 47, "commits": 9, "created_at": "1457292624", "deletions": 387, "labels": ["alca-approved", "comparison-available", "dqm-approved", "operations-pending", "orp-pending", "pdmv-approved", "pending-signatures", "tests-approved"], "merge_commit_sha": "67c2e86961760643d61b34f744ff1bd051c7777e", "merged_at": "1460055083", "merged_by": "davidlange6", "milestone": "CMSSW_8_0_X", "number": 13609, "release-notes": [], "review_comments": 10, "state": "closed", "title": "Implementation of the statistics split for the Gain Calibration workflow.", "updated_at": "1460055084", "user": "dimattia"}