{"additions": 1, "auther_ref": "patch-4", "auther_sha": "bf941e625c9a1916a9bce97cd83e61a8a56a1de3", "author": "abrinke1", "body": "\"master\" version of https://github.com/cms-sw/cmssw/pull/29252\r\nIntended for all future versions of EMTF emulator.\r\n\r\nWe have unfortunately uncovered another error in the EMTF emulation for 2016, which had been masked by the previous one. [1]  As it turns out the emulator was not accessing the 2016 or 2017 Global Tag conditions for most of the algorithm settings, creating a mix of 2016 or 2017 and 2018 logic which is internally inconsistent.  Efe measured the efficiency in the latest 2016 RelVal samples (see attached slides), and due to this bug it is 10% lower in the negative endcap than in the positive.\r\n\r\nThankfully the fix is quite simple, as you can see in this pull request. Efe's plots confirm that the efficiency looks good when re-running the newest RelVals with this patch applied, and is consistent with the efficiency in 2016 data. [2]\r\n\r\nFor historical background on the likely cause for this bug, between 2016 and 2017 we completely overhauled the EMTF emulator, in part to handle the new RPC inputs.  Unfortunately both the CondDB code and payloads for EMTF at that point were in disarray (very long story), and accessing the conditions payload was crashing the MC RelVals.  At that point (if my hazy memory serves) we decided to configure by firmware version only for data, and by \"fake conditions\" for MC, with 3 different \"fake conditions\" python config files.  Sometime subsequently the \"fake conditions\" for each year went away, so the MC emulation (again, for some but not all of the algorithm settings) used the default settings, instead of the time-dependent firmware version settings.  This worked fine when the \"default\" settings were also the \"current\" settings (which was true when the 2017 and 2018 MC were produced), but fails for 2016. re-emulation.  Long story short, our workflows had never been fully validated for legacy MC, and now we're finding the bugs - for which we apologize.\r\n\r\n[1] #29080\r\n[2] https://twiki.cern.ch/twiki/bin/view/CMSPublic/L1TMuonPerformanceICHEP16\r\n[EMTF_UL16MC_validation_19.03.2020.pdf](https://github.com/cms-sw/cmssw/files/4361572/EMTF_UL16MC_validation_19.03.2020.pdf)\r\n", "branch": "master", "changed_files": 1, "closed_at": "1584952918", "comments": 11, "commits": 1, "created_at": "1584730282", "deletions": 1, "labels": ["code-checks-approved", "comparison-available", "l1-pending", "orp-approved", "pending-signatures", "tests-approved", "urgent"], "merge_commit_sha": "5e3f992f4fa48c721233224807b7ef95114ecb30", "merged_at": "1584952918", "merged_by": "cmsbuild", "milestone": "CMSSW_11_1_X", "number": 29260, "release-notes": [], "review_comments": 0, "state": "closed", "title": "EMTF configures from Global Tag conditions in MC as well as data", "updated_at": "1584952919", "user": "abrinke1"}