{"additions": 4147, "auther_ref": "from-CMSSW_10_4_0_pre1-inherit-from-baseboard", "auther_sha": "d4bc5748950b74740f4ba510c689699998dcd92c", "author": "dildick", "body": "This PR is the last one in a series to improve the CSC local trigger emulator. Follow up of https://github.com/cms-sw/cmssw/pull/24422. It is based on the results of 2018 pp collision data vs emulator studies. The studies were carried out during the Summer and Fall of 2018. The proposed changes improve the agreement between the CSC DAQ data and the emulator in CMSSW. \r\n\r\nSupporting material with plots can be found in the slides below:\r\n- https://indico.cern.ch/event/769093/contributions/3195866/attachments/1744999/2824740/TaoOTMB_fw_20181023v3.pdf\r\n- https://indico.cern.ch/event/756056/contributions/3133821/attachments/1748087/2834606/TaoOTMB_fw_20181106v2.pdf\r\n\r\n**List of all changes:**\r\n\r\nCSCBaseboard:\r\n- All CSC processors and TMBs inherit from the CSCBaseboard from now on. \r\n\r\nALCT processor: \r\n- During the study of data and emulation comparison, small disagreement between data and emulation was found and a few modifications were committed to improve ALCT processor.  The proposed changes allow re-triggering on one wiregroup in some dead time after earlier ALCT is built on this wiregroup. The ALCT processor before this commit would prohibit the wiregroup from triggering in one event once the first ALCT is found on the wiregroup.  However, in firmware, the wiregroup with ALCT is only dead for a few BX (~6BX) before it is triggered by next muon. \r\nTo make emulator in ALCT part consistent with firmware, the change is to allow re-triggering on same wiregroup in 6BX after the earlier ALCT on the wiregroup. \r\n- The implementation of ghost cancellation logic is also changed to accommodate the re-triggering change while the idea of ghost cancellation logic is kept the same.\r\n- CSC upgrade algorithms are now stored in a class CSCUpgradeAnodeLCTProcessor, which inherits from CSCAnodeLCTProcessor\r\n\r\nCLCT processor: \r\n- localized dead time zoning was moved to the pre-trigger level. \r\n- In addition, the dynamic dead time zoning option was taken out of the Run-3 configuration as it is currently not implemented yet.\r\n- CSC upgrade algorithms are now stored in a class CSCUpgradeCathodeLCTProcessor, which inherits from CSCCathodeLCTProcessor\r\n\r\nTrigger motherboard:\r\n- OTMBs for ME3/1 and ME4/1 now also includes ME2/1 (without GEMs). This is necessary as some of the CSC OTMB upgrade planned for LS3 will be done during Run-3 which would allow running the upgrade algorithm without GE2/1.\r\n\r\nCSCTriggerPrimitivesReader\r\n- lot of updates for better data vs emulator studies\r\n\r\n@tahuang1991 @ptcox @lpernie ", "branch": "master", "changed_files": 31, "closed_at": "1543509567", "comments": 105, "commits": 28, "created_at": "1541710898", "deletions": 3105, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "l1-approved", "orp-approved", "tests-approved"], "merge_commit_sha": "15d6e6b6852645e5d3dc9fc0eb4cec1e0a868e11", "merged_at": "1543509567", "merged_by": "cmsbuild", "milestone": "CMSSW_10_4_X", "number": 25165, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Various improvements to CSC local trigger emulator", "updated_at": "1543509568", "user": "dildick"}