{"additions": 0, "auther_ref": "clean-dict-dup-rules-CondFormats-EcalObjects", "auther_sha": "19290614c8488b0e5d0149f846aa581abe824440", "author": "davidlt", "body": "Thanks to Danilo ROOT 6.04.00 will have user-friendly duplicate\nselection rule check.\n\nThe amount of warnings are too high to put them into a commit message.\n\n`seal_cap.cc` was checked after re-compilation and none of types were\nremoved from the dictionary.\n\nFull list of warnings:\n\n```\nWarning: Selection file classes_def.xml, lines 164 and 159. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalFloatCondObjectContainer\" while the class is \"EcalCondObjectContainer<float>\".\nWarning: Selection file classes_def.xml, lines 99 and 94. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalPedestals\" while the class is \"EcalCondObjectContainer<EcalPedestal>\".\nWarning: Selection file classes_def.xml, lines 153 and 148. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalWeightXtalGroups\" while the class is \"EcalCondObjectContainer<EcalXtalGroupId>\".\nWarning: Selection file classes_def.xml, lines 73 and 68. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalGainRatios\" while the class is \"EcalCondObjectContainer<EcalMGPAGainRatio>\".\nWarning: Selection file classes_def.xml, lines 165 and 164. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalIntercalibConstants\" while the class is \"EcalCondObjectContainer<float>\".\nWarning: Selection file classes_def.xml, lines 166 and 165. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalIntercalibConstantsMC\" while the class is \"EcalCondObjectContainer<float>\".\nWarning: Selection file classes_def.xml, lines 167 and 166. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalIntercalibErrors\" while the class is \"EcalCondObjectContainer<float>\".\nWarning: Selection file classes_def.xml, lines 304 and 299. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalPulseShapes\" while the class is \"EcalCondObjectContainer<EcalPulseShape>\".\nWarning: Selection file classes_def.xml, lines 317 and 312. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalPulseCovariances\" while the class is \"EcalCondObjectContainer<EcalPulseCovariance>\".\nWarning: Selection file classes_def.xml, lines 170 and 167. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalTimeCalibConstants\" while the class is \"EcalCondObjectContainer<float>\".\nWarning: Selection file classes_def.xml, lines 171 and 170. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalTimeCalibErrors\" while the class is \"EcalCondObjectContainer<float>\".\nWarning: Selection file classes_def.xml, lines 23 and 11. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalChannelStatus\" while the class is \"EcalCondObjectContainer<EcalChannelStatusCode>\".\nWarning: Selection file classes_def.xml, lines 60 and 53. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalDQMTowerStatus\" while the class is \"EcalCondTowerObjectContainer<EcalDQMStatusCode>\".\nWarning: Selection file classes_def.xml, lines 58 and 46. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalDQMChannelStatus\" while the class is \"EcalCondObjectContainer<EcalDQMStatusCode>\".\nWarning: Selection file classes_def.xml, lines 25 and 18. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalDCSTowerStatus\" while the class is \"EcalCondTowerObjectContainer<EcalChannelStatusCode>\".\nWarning: Selection file classes_def.xml, lines 38 and 33. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalDAQTowerStatus\" while the class is \"EcalCondTowerObjectContainer<EcalDAQStatusCode>\".\nWarning: Selection file classes_def.xml, lines 169 and 171. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalLaserAlphas\" while the class is \"EcalCondObjectContainer<float>\".\nWarning: Selection file classes_def.xml, lines 208 and 203. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalTimeDependentCorrections::EcalValueMap\" while the class is \"EcalCondObjectContainer<EcalTimeDependentCorrections::Values>\".\nWarning: Selection file classes_def.xml, lines 190 and 185. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalLaserAPDPNRatios::EcalLaserAPDPNRatiosMap\" while the class is \"EcalCondObjectContainer<EcalLaserAPDPNRatios::EcalLaserAPDPNpair>\".\nWarning: Selection file classes_def.xml, lines 211 and 195. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalLinearCorrections\" while the class is \"EcalTimeDependentCorrections\".\nWarning: Selection file classes_def.xml, lines 168 and 169. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalLaserAPDPNRatiosRef\" while the class is \"EcalCondObjectContainer<float>\".\nWarning: Selection file classes_def.xml, lines 127 and 122. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalTPGLinearizationConst\" while the class is \"EcalCondObjectContainer<EcalTPGLinearizationConstant>\".\nWarning: Selection file classes_def.xml, lines 140 and 135. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalTPGPedestals\" while the class is \"EcalCondObjectContainer<EcalTPGPedestal>\".\nWarning: Selection file classes_def.xml, lines 86 and 81. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalMappingElectronics\" while the class is \"EcalCondObjectContainer<EcalMappingElement>\".\nWarning: Selection file classes_def.xml, lines 233 and 227. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalClusterLocalContCorrParameters\" while the class is \"EcalFunParams\".\nWarning: Selection file classes_def.xml, lines 229 and 233. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalClusterCrackCorrParameters\" while the class is \"EcalFunParams\".\nWarning: Selection file classes_def.xml, lines 231 and 229. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalClusterEnergyCorrectionParameters\" while the class is \"EcalFunParams\".\nWarning: Selection file classes_def.xml, lines 232 and 231. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalClusterEnergyUncertaintyParameters\" while the class is \"EcalFunParams\".\nWarning: Selection file classes_def.xml, lines 230 and 232. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalClusterEnergyCorrectionObjectSpecificParameters\" while the class is \"EcalFunParams\".\nWarning: Selection file classes_def.xml, lines 114 and 109. Attempt to select with a named selection rule an already selected class. The name used in the selection is \"EcalTPGCrystalStatus\" while the class is \"EcalCondObjectContainer<EcalTPGCrystalStatusCode>\".\n```\n\nSigned-off-by: David Abdurachmanov David.Abdurachmanov@cern.ch\n", "branch": "CMSSW_7_5_X", "changed_files": 1, "closed_at": "1433512328", "comments": 7, "commits": 1, "created_at": "1433054453", "deletions": 54, "labels": ["alca-approved", "comparison-available", "fully-signed", "tests-approved"], "merge_commit_sha": "f5e6bf53f8436674723c6374af7e55da018c4f34", "merged_at": "1433512328", "merged_by": "cmsbuild", "milestone": "CMSSW_7_5_X", "number": 9372, "release-notes": [], "review_comments": 0, "state": "closed", "title": "CondFormats/EcalObjects: clean dictionary of duplicate selection rules", "updated_at": "1433512328", "user": "davidlt"}