{"additions": 1147, "auther_ref": "percolateInfo", "auther_sha": "c3ba6088ec4ed9040828c7a423aa11a1f41f58b5", "author": "wddgit", "body": "#### PR description:\r\n\r\nUse the TransitionInfo classes in more interfaces. In particular, it adds interface changes to streamTransitionAsync.h that were recently made in globalTransitionAsync.h so the two will remain similar. It also changes other interfaces from EventProcessor down the stack to the Worker classes and into the ProductResolvers.\r\n\r\nThe 6th commit percolates the transition info through the prefetchAsync functions in the ProductResolvers.\r\n\r\nThe 7th commit makes the UnscheduledAuxiliary store an EventTransitionInfo instead of the EventSetupImpl.\r\n\r\nThese two commits remove the need for const_casts that were in the UnscheduledProductResolver class and also remove the need to have a nullptr for the pointer to the EventSetupImpl in the ProcessBlock case.\r\n\r\n(Note this is implemented on top of the changes in PR #30969. We could merge that one, then this one. Or just close that one and just handle it all in one PR. I could squash it all into one commit if you like. Let me know.)\r\n\r\n@makortel @Dr15Jones You already reviewed the first 5 commits in the earlier PR and the subsequent commits deal with the unresolved comments. You had asked me to put these in a separate pull request as we were not sure how we wanted to deal with these. I had made a 3 part proposal in the old PR to resolve the issue. The first part went OK, but the other two parts did not work. The doWork function gets used in UnscheduledProductResolver in some corner cases. getProvenance can cause it to be called. So I could not delete that code. Instead I changed the UnscheduledAuxiliary to hold an EventTransitionInfo and that works. Another alternative would be to make sure in every case getProvenance that consumes is also called.\r\n\r\n#### PR validation:\r\n\r\nRan existing unit tests. This should not change any behavior or any results. It just makes the code easier to read and understand.\r\n", "branch": "master", "changed_files": 40, "closed_at": "1599853074", "comments": 17, "commits": 7, "created_at": "1597352280", "deletions": 1018, "labels": ["code-checks-approved", "comparison-available", "core-pending", "orp-pending", "pending-signatures", "simulation-approved", "tests-approved"], "milestone": "CMSSW_11_2_X", "number": 31136, "release-notes": [], "review_comments": 6, "state": "closed", "title": "Use TransitionInfo in more interfaces, part 2", "updated_at": "1599853074", "user": "wddgit"}