{"additions": 543, "auther_ref": "zstd-CMSSW_11_0_X-merged", "auther_sha": "6b04fa1ec5c797575144dc6cea4758a500398c37", "author": "smorovic", "body": "#### PR description:\r\nPR adds new compression formats and also optimizes buffer usage in Streamer event writing.\r\n\r\nOutput buffering changes:\r\n- Output buffering changed to reduce extra copy of the payload. Instead, small header is copied to the front of the payload after compression. Initial default of 7 MB is not needed and can be sized dynamically (usually to much less). New initial size is 50 kb to reserve for event header.\r\n\r\n- Reduced ROOT TBuffer (TBufferFile object) size after serialization of the INI file, which, due to typically large INI payloads in HLT, results in significant reduction in memory usage of the process during event processing.\r\n\r\n- In testing with the realistic 2018 HLT payload and data with the 4-thread HLT (pp Physics) CMSSW job, these two changes reduced total memory footprint from 2.7 GB to 2 GB (per process).\r\n\r\nCompression changes:\r\n- LZMA compression algorithm added. To facilitate automatic detection in reader, a\r\n4-byte header is present at the beginning of LZMA content (this does not\r\nconflict with zlib header which starts with a different sequence). Compression\r\n/decompression functions are based on ROOT implementation, but we turn off\r\ncalculation of CRC32/64 checksum (adler32 is already used to checksum whole payload). Error handling is also improved and 16 MB buffer size limitation in ROOT routine is removed.\r\n\r\n- Zstandard compression is added. Compression factor is comparable to zlib, but is performing faster at lower compression levels making it potentially interesting for HLT in situations where CPU usage is tight. Similar 4-byte header (\"ZS\") is added to the payload.\r\n\r\n- \"compression_algorithm\" parameter was added to the output module allowing to choose between algorithms.\r\n\r\n- Decompression for both new algorithms with format autodetection is added to the StreamerInputSource.\r\n\r\n- several \"scram b code-checks-all\" changes to Streamer and Utililities modules has also been included with the PR.\r\n\r\n#### PR validation:\r\n\r\nBuffering and compression changes have been verified to produce correct files by producing output files  with different algorithms (DAQ and Streamer output module) and reading them with Streamer input source to verify integrity.", "branch": "master", "changed_files": 22, "closed_at": "1561574764", "comments": 26, "commits": 7, "created_at": "1561026959", "deletions": 149, "labels": ["code-checks-approved", "comparison-available", "core-approved", "daq-approved", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "cce8a240ecb8a36eb36ab0b79e98474c22536c9f", "merged_at": "1561574764", "merged_by": "cmsbuild", "milestone": "CMSSW_11_0_X", "number": 27288, "release-notes": [], "review_comments": 4, "state": "closed", "title": "LZMA and ZSTD support for Streamer format", "updated_at": "1561574764", "user": "smorovic"}