{"additions": 122, "auther_ref": "master-tva94-rebase", "auther_sha": "ce165888fcfd4c503c5e11492795ab667f723940", "author": "NJManganelli", "body": "\r\n#### PR description:\r\n\r\nThis PR implements matching of emulation to a firmware feature for the Global Track Trigger. For GTT, there are 18 optical links (9 phi sectors x 2 eta sectors) from the TrackFindingProcessors. Each link can send up to 104 tracks, but a limitation in the current firmware prevents all from being considered for association with the primary vertex: the limit is currently 94/104, and this limit is encoded in a configurable parameter in the l1tTrackVertexAssociation_cfi.py file. This has no impact on vertices (which are found using all (selected) tracks sent to GTT and strictly upstream of the TrackVertexAssociation), and in the cases of track-only objects, is expected to impact less than 1 in 10^6 ttbar (200PU) events (the original limit of 104 tracks per link was designed around such a figure of merit + an overhead, this PR decreases the overhead a small amount)\r\n\r\nBit-accurate outputs are maintained for board integration tests on 1008 events ttbar (200PU) events.\r\n\r\nIn anticipation of another PR, the code used to determine the link a track belongs to is encapsulated in a function in the codecs header, to be used commonly in the GTTFile{Reader,Writer} when updated.\r\n#### PR validation:\r\n\r\nThis PR passed:\r\nscram b\r\nscram b code-checks\r\nscram b code-format\r\nUsed to generate GTT test vectors for APx/Serenity on ~1000 events from TT (CMSSW_13_1) sample\r\nTest vectors pass tests with corresponding update for TrackVertexAssociation in the LibHLS repo\r\nrunTheMatrix.py -l limited -i all --ibeos\r\n#### Ports\r\n\r\nThis PR is a port from the cms-l1t-offline 13_3_0_pre3 integration branch, with commits squashed\r\nhttps://github.com/cms-l1t-offline/cmssw/pull/1176\r\n", "branch": "master", "changed_files": 4, "comments": 7, "commits": 3, "created_at": "1699988191", "deletions": 22, "labels": ["l1-approved", "fully-signed", "tests-approved", "orp-pending", "upgrade-approved", "code-checks-approved"], "milestone": "CMSSW_14_0_X", "number": 43278, "release-notes": [], "review_comments": 0, "state": "open", "title": "Phase 2 GTT TrackVertexAssociation Firmware limit", "updated_at": "1700582032", "user": "NJManganelli"}