{"additions": 362, "auther_ref": "feature/simplified-pixel-seed-creation", "auther_sha": "796abea8232244ac5d8f3f066051b6c469c17ac8", "author": "chrishanw", "body": "#### PR description:\r\n\r\nThis PR adds two new producers with the goal of speeding up the PixelSeed generation for the EGamma reconstruction.\r\n\r\nExtensive analysis of the `ElectronNHitSeedProducer`, which is the first producer consuming the `TrajectorySeeds` which are the product of the `SeedCreatorFromRegionConsecutiveHitsEDProducer` during the EGamma reconstruction showed that the `ElectronNHitSeedProducer` only really needs the hit collection in the seeds, but not fitted information or a proper `TrajectoryStateOnSurface`. However, the `SeedCreatorFromRegionConsecutiveHitsEDProducer` fits **all** seed candidates, thus potentially wasting a lot of compute resources on seeds that will discarded in the next step without ever checking the fitted information (the state).\r\n\r\nThe two producers introduced in this PR:\r\n1. Produce simplified `TrajectorySeed` objects by just taking the collection of hits in the `SeedingHitSet`s and creating a dummy `PTrajectoryStateOnDet` to have valid information in the state. This is done by the `SeedFromConsecutiveHitsCreatorSimple`.\r\n2. Fit the seeds selected by the `ElectronNHitSeedProducer` and produce a new `ElectronSeedCollection` with proper state information in the `PTrajectoryStateOnDet`. This is done by the `SeedFitter`\r\n\r\nThe subsequent producers in the path then can use the fitted information as usual. The features have been presented [in the GPU meeting on 17.11.2025](https://indico.cern.ch/event/1613298/#4-update-on-electron-seeding). As a lot of unnecessary work is omitted, the seed creation is expected to be significantly faster, but reliable timing studies are still pending. First tests show that the physics performance is essentially unchanged. Few differences arise from the fact that the `TrajectorySeed` objects produced by the default `SeedFromConsecutiveHitsCreator` contain the hit information updated in the fit, while the new implementation directly uses the existing hit, and the difference in position can sometimes be large enough for a seed to be rejected or not in the `ElectronNHitSeedProducer`. More detailed physics performance studies will follow.\r\n\r\nThis PR will also lay the ground for a later Alpaka based version of the`ElectronNHitSeedProducer`, which will operate on the simple seed objects without fit information, too. The new feature could potentially be used in the 2026 data taking to speed up the seed creation.\r\n\r\n#### PR validation:\r\n\r\nBasic test of the physics performance of the newly introduced producers with an adapted HLT chain. ", "branch": "master", "changed_files": 2, "comments": 9, "commits": 5, "created_at": "1763738441", "deletions": 0, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-rejected", "tracking"], "milestone": "CMSSW_16_0_X", "number": 49436, "release-notes": [], "review_comments": 36, "state": "open", "title": "Feature: Simplified and improved Pixel Seed Creation", "updated_at": "1764142433", "user": "chrishanw"}