{"additions": 101, "auther_ref": "anomalyDetectionFromExternal", "auther_sha": "84ea9e15c22b0231c836a8be9022e96cb204441f", "author": "aloeliger", "body": "#### PR description:\r\n\r\nThis PR represents the emulator of the Princeton University/University of Wisconsin unsupervised L1T anomaly detection technique using Calo L1 (\"CICADA\").\r\n\r\nHLS4ML models are now loaded from externally compiled repository `.so` libraries, via an interface provided via the `hls4mlEmulatorExtras` external. The CICADA model used in the emulator represents the first version of CICADA to be tested on trigger testing hardware, and is loaded from the `CICADA` external as `CICADAModel_v1`.\r\n\r\nThis PR supersedes #40277.\r\n\r\n#### PR validation:\r\n\r\nDue to this emulator not being associated with any standard workflows yet, no changes are expected to standard workflows, and they are not useful in validation. All code compiles, and has had code formatting applied. We have performed internal validation of the output of this emulator with a dedicated ntuplizer on data and MC, and it produces values in line with what is seen in firmware testing. If additional validation checks are desired, the CICADA team can discuss providing them or performing them upon request.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport\r\n", "branch": "master", "changed_files": 5, "closed_at": "1677486965", "comments": 25, "commits": 4, "created_at": "1676493885", "deletions": 2, "labels": ["l1-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "3bb9f02c1a75bad77fc457541a8ab7853f0df55e", "merged_at": "1677486965", "merged_by": "cmsbuild", "milestone": "CMSSW_13_1_X", "number": 40779, "release-notes": [], "review_comments": 0, "state": "closed", "title": "\"CICADA\"/calorimeter anomaly detection trigger emulator using external repositories", "updated_at": "1677486966", "user": "aloeliger"}