{"additions": 822, "auther_ref": "add-displacedMuons_RECO", "auther_sha": "4d2de56674c12e6e7dfbbcb8adeeee2f92e289bc", "author": "CeliaFernandez", "body": "#### PR description:\r\n\r\nThis PR adds a new reco::Muon collection, called 'displacedMuons', that includes the dedicated displaced muon reconstructions: 'displacedTracks', 'displacedGlobalMuons' and 'displacedStandAloneMuons' (all of them saved in AOD as reco::Track collections).\r\n\r\nIn this PR we add the necessary modifications to:\r\n1. Cross-clean the existing reco::Track objects in order to avoid the duplication or loss of displaced muon candidates in the output collection.\r\n2. Compute the main muon variables, including isolation, time, recoTracksExtras... etc\r\n3. Save this information in AOD and RECO, as configured for standard 'muons' collection\r\n\r\nThe sequences are implemented to run independently to the default reco::Muon 'muons' collection and avoid interferences. Muons of the 'muons' collection should remain untouchable. They also emulate the existing implementation and make use of the existing tools and sequences so the new information is computed with the default parameters configuration.\r\n\r\nThe following packages are modified:\r\n\r\n- RecoMuon/Configuration: To perform the cross-cleaning (in RecoMuonPPOnly), integrate the new displaced sequences (RecoMuon_cff.py) and define the information saved in AOD (RecoMuon_EventContent_cff.py)\r\n- RecoMuon/Identification: To define the main 'displacedMuons' sequence for the new collection (displacedMuons_cfi.py) and the sequence to compute the ReducedTrackExtras associated to it (displacedMuonsReducedTrackExtras_cfi.py)\r\n- RecoMuon/MuonIsolationProducers: To add the detector-based isolation deposits (muIsolation_cff.py, muIsoDeposits_cff.py, muIsoDepositCopies_cfi.py and muIsolation_EventContent_cff.py)\r\n- RecoMuon/MuonIsolation: To add the PFIsolation (muonPFIsolation_cff.py, displacedMuonPFIsolationValues_cff.py and displacedMuonPFIsolationDeposits_cff.py)\r\n\r\nThe increase in size was measured by using a ttbar benchmark model (runTheMatrix.py workflow 11634.0), where we obtained a relative increase of the 1.23%\r\n\r\nBackup documentation, detailed information about the modifications and validation can be found here:  https://cernbox.cern.ch/index.php/s/FfAZonfSest7kqQ\r\n\r\nThe implementation was built on top of CMSSW_12_3_0_pre2\r\n\r\n@gkaratha @sscruz @trocino \r\n\r\n#### PR validation:\r\n\r\nWe have checked out all dependencies and have a clean build.\r\nThe actions defined in the new sequences were validated and these results are presented in the backup documentation:\r\nhttps://cernbox.cern.ch/index.php/s/FfAZonfSest7kqQ\r\n", "branch": "master", "changed_files": 12, "comments": 27, "commits": 5, "created_at": "1644494931", "deletions": 5, "labels": ["reconstruction-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_12_4_X", "number": 36926, "release-notes": [], "review_comments": 3, "state": "open", "title": "Add new reco::Muon 'displacedMuons' collection to AOD", "updated_at": "1646982111", "user": "CeliaFernandez"}