{"additions": 34, "auther_ref": "add-mat-ord-exception", "auther_sha": "441da8b41b2b77a5d1b087e0f48e6ebb60d55078", "author": "cvuosalo", "body": "Our code allowed composite materials in the geometry to be defined out of order, but there was a subtle problem with the resolution of these materials. Also, it turned out that very few materials were defined out of order. It was decided to simply change the few cases of out-of-order material definitions rather than debug the complexities of supporting such definitions.\r\n\r\nThe re-ordering of material definitions was propagated to the DB geometry [1], so now we can change the code to simply prohibit out-of-order material definitions. This PR adds an exception if a material that was not yet defined is referenced in a geometry XML file.\r\n\r\nThe Phase 2 D77 scenario had one material that was defined out of order. This PR puts that definition in the correct order so D77 can be run with DD4hep.\r\n\r\nA number of unit tests used obsolete materials files. This PR updates the versions of materials files in those tests so they don't generate the exception for out-of-order material definitions.\r\n\r\nGoing forward, the change in this PR should prevent the introduction into the geometry of any material definitions that are in the wrong order, provided any such geometry change is checked with DD4hep.\r\n\r\n[1]: https://hypernews.cern.ch/HyperNews/CMS/get/calibrations/4552.html\r\n\r\n#### PR validation:\r\n\r\nFor Run 3, all materials are already defined in proper order, so this PR has no noticeable effect. A test was done with material definitions in the wrong order, and the exception was generated as desired.\r\n\r\nWith this PR, DD4hep Phase 2 D77 simulation runs successfully.\r\n\r\nNo backport is needed.", "branch": "master", "changed_files": 26, "closed_at": "1639756207", "comments": 15, "commits": 4, "created_at": "1639497012", "deletions": 89, "labels": ["geometry-approved", "fully-signed", "tests-approved", "orp-approved", "upgrade-approved", "code-checks-approved"], "merge_commit_sha": "593eaff3cd242254ac47035da7a177bec1372510", "merged_at": "1639756206", "merged_by": "cmsbuild", "milestone": "CMSSW_12_3_X", "number": 36496, "release-notes": [], "review_comments": 2, "state": "closed", "title": "[DD4hep] Prohibit use of undefined materials", "updated_at": "1639756207", "user": "cvuosalo"}