{"additions": 605, "auther_ref": "PF_103X", "auther_sha": "980c2bf3bd30b34cdc58f166b0f4873903abf477", "author": "gpetruc", "body": "As presented in https://indico.cern.ch/event/747970/ plus a minor fix on isolated photons (a loose cut on the solid-cone tracker isolation, since for collimated fakes the hollow-cone may miss the hadron; that was in the results shown, but not described in the slides), rebased to `CMSSW_10_3_0_pre1`\r\n\r\nThere are also few missing items in this PR for which I would have inputs for a clean implementation:\r\n* Now all features are controlled by both the HCal channel quality DB object and configuration switches, off by default. I can make an era or process modifier to turn them on, or keep them always on (they should do nothing if there are no bad channels), or keep them on and make an era to switch them off. What do you prefer? \r\n* To avoid changing dataformats and triggering big recompilations, at the moment the information about invalid H/E in reco::Photon and reco::GsfElectron objects is saved by setting H/E to a very small negative value. I can either add a new boolean flag in the showers shape struct and an accessor for it, or keep the storage as is but modify the methods (add a method to check the validity that checks if >= 0, and add  some max(x,0) in the getters to avoid returning the negative value)\r\n* Same as above for the implementation of the PFCluster status flag for the clusters used to mark masked Hcal areas. Now I've just put a random hex value for testing, as I have no idea what bits of the status flag are already used and for what purpose.\r\n\r\nFor testing, all features can be turned on via\r\n````\r\nprocess.particleFlowBadHcalPseudoCluster.enable = cms.bool(True)\r\nprocess.gedGsfElectronsTmp.checkHcalStatus = cms.bool(True)\r\nprocess.gedPhotonsTmp.checkHcalStatus = cms.bool(True)\r\nprocess.caloTowerForTrk.missingHcalRescaleFactorForEcal = 1.0\r\n````\r\n\r\nThe code is in principle agnostic of the kind of Hcal failure, but was tested only for HEM 15-16.\r\n\r\nCode was tested in 10_1_X, now I'm running some more tests in 10_3_X, but I hope the code review can start anyway.", "branch": "master", "changed_files": 20, "comments": 103, "commits": 23, "created_at": "1533557970", "deletions": 51, "labels": ["code-checks-approved", "comparison-pending", "hlt-pending", "operations-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-pending"], "milestone": "CMSSW_10_3_X", "number": 24212, "release-notes": [], "review_comments": 54, "state": "open", "title": "Code for PF HEM 15-16 mitigation", "updated_at": "1535003547", "user": "gpetruc"}