{"additions": 136, "auther_ref": "SmearMETFix_rebased", "auther_sha": "a1851de451e116e63d7e22d04872e3625ece7f2b", "author": "michaelwassmer", "body": "#### PR description:\r\n\r\nThis pull request fixes the incorrect calculation of the nominal smeared missing transverse energy (MET). The underyling problem is the application of the JER correction factors. These factors are applied in PhysicsTools/PatUtils/interface/SmearedJetProducerT.h but later not considered when reverting to the uncorrected jets in  JetMETCorrections/Type1MET/interface/PFJetMETcorrInputProducerT.h.\r\nThis results in the problem that the JER correction factors in the smeared MET calculation effectively cancels and therefore the smeared MET is basically the same as the regular type1-corrected MET. After the changes shown below, the nominal smeared MET distributions from MiniAOD are similar to the ones obtained from NanoAOD.\r\n\r\nThis pull request includes the following:\r\n\r\nPhysicsTools/PatUtils/plugins/SmearedJetProducer.cc\r\n- adds a template function (SmearJet in SmearedJetProducer_namespace) to apply the JER\r\n- if the type of the jet is not pat::Jet it reproduces what has been done so far (using the scaleEnergy function to apply the JER factor to the jet)\r\n- if the jet is of type pat::Jet, it does the same but additionally adds the JER factor as a userFloat to the pat::Jet (needed to later remove JER from the jets in the corresponding MET module)\r\n\r\nPhysicsTools/PatUtils/interface/SmearedJetProducerT.h\r\n- use the template function explained above\r\n\r\nPhysicsTools/PatUtils/plugins/PATPFJetMETcorrInputProducer.cc\r\n- edit pat::Jet template specialization of the already existing RawJetExtractor class to consider a possible JER correction factor, which was added as a userFloat previously, during the jet correction removal  (if a JER factor was applied, it is now removed by applying 1/factor)\r\n- pat::Jet template specialization, which retrieves a previously saved JER factor, of the template class/functor explained below\r\n\r\nJetMETCorrections/Type1MET/interface/PFJetMETcorrInputProducerT.h\r\n- add a template class/functor to retrieve JER correction factors\r\n- in generic implementation it only applies 1 as a factor therefore doing nothing\r\n- in case of pat::Jet, see above\r\n\r\nFinally, there is also a mistake when saving the JERup and JERdown varied smearedMET. The different contributions of the nominal smeared MET correction and the JERup and JERdown variations are not separated correctly from on another. After the changes shown below, the varied smeared MET distributions from MiniAOD are similar to the ones obtained from NanoAOD.\r\n\r\nDataFormats/PatCandidates/src/MET.cc\r\n- to get the corrections/deltas for the JER variations of the smeared MET, the calculation now takes the up/down-varied smeared MET (px,py,...) and subtracts the contributions from the nominal smeared MET corrections (ref.dpx(),ref.dpy(),...) as well as the nominal type1-corrected MET (this->px(),this->py(),...)\r\n- the previous implementation is a mystery to me :D\r\n\r\n#### PR validation:\r\n\r\n- 'runTheMatrix.py -l limited -i all' worked besides some workflows which had CMSDAS errors despite a working certificate\r\n- 'scram b runtest' worked\r\n", "branch": "master", "changed_files": 7, "closed_at": "1645514505", "comments": 69, "commits": 11, "created_at": "1637224051", "deletions": 10, "labels": ["reconstruction-rejected", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_12_3_X", "number": 36165, "release-notes": [], "review_comments": 22, "state": "closed", "title": "Fix calculation of smeared MET on MiniAOD", "updated_at": "1645514505", "user": "michaelwassmer"}