{"additions": 850, "auther_ref": "FWLite_MVA_master", "auther_sha": "54d947a9412fd210800760fea156d62d4913e7c7", "author": "guitargeek", "body": "Hi,\r\n\r\nin the discussion about issue https://github.com/cms-sw/cmssw/issues/23676 it became evident that the current electron MVA ID does not work in FWlite/Python. Mainly the reason for this was that the MVA classes have to get additional variables not in the objects from edm::ValueMaps and the objects therefore need to be wrapped in something Ref-like (`edm::Ptr`s in the current implementation).\r\n\r\nTo get around this, we propose to add another helper class (`MVAVariableHelper`) to the Egamma MVA framework which calculates the extra variables and passes is to the MVA classes, which in turn don't need any other event or provenance information no more. The same function used by the new MVAVariableHelper to get the extra electron variables can also used in FWLite. An example will be included in the test code. There is also a new Python wrapper class which makes using the most recent Electron MVAs for 2016 and 2017 in Python very easy.\r\n\r\nFurthermore, I cleaned up the MVANtuplizers a bit and more importantly changed the interface of the ConversionTools to not require edm::Handles anymore. Which makes their usage a bit more consistent in FWlite/Python with the other code I wrote.\r\n\r\nLocal matrix tests pass and I checked the output of the new fwlite test and the ElectronMVANtuplizer for numerical agreement of MVA values. Validation plots here [1]. If one wants to reproduce the comparison, the pt threshold in the ElectronMVANtuplizer has to be set to zero [2] and one could make the comparison plots with this script for example.\r\n\r\nI hope everyone is fine with these changes and I don't have to touch the MVA code again any time soon.\r\n\r\nCheers,\r\nJonas\r\n\r\nShout-out to who discussed in the issue-thread @Dr15Jones, @makortel and of course to @cbernet for the nice discussion and help but in particular the FWlite example!\r\n\r\n[1] https://rembserj.web.cern.ch/rembserj/plots/CMSSW_PRs/25337/\r\n[2] https://github.com/cms-sw/cmssw/blob/master/RecoEgamma/ElectronIdentification/plugins/ElectronMVANtuplizer.cc#L424\r\n[3] https://gitlab.cern.ch/snippets/636", "branch": "master", "changed_files": 47, "comments": 31, "commits": 13, "created_at": "1543194272", "deletions": 750, "labels": ["analysis-pending", "code-checks-approved", "comparison-pending", "dqm-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-started"], "milestone": "CMSSW_10_4_X", "number": 25337, "release-notes": [], "review_comments": 0, "state": "open", "title": "Make ElectronMVA usable in FWlite again", "updated_at": "1543909747", "user": "guitargeek"}