{"additions": 19, "auther_ref": "removePSetRefsSimMuonAndPPS", "auther_sha": "1e0f6b63ebff506f6de94021fc9c05b72308c3a7", "author": "wddgit", "body": "#### PR description:\r\n\r\nIn an effort to reduce memory usage we are attempting to remove references into the main ParameterSet from modules. When that effort is complete delete, the intent is to submit a separate PR deleting that object when all module construction is complete (I'm not sure this will succeed, but the changes in this PR are improvements even if it doesn't).\r\n\r\nThis PR addresses 3 of the modules with such references.\r\n\r\nIn RPVFATSimulator and RPLinearChargeDivider, the reference is simply an unused member that is deleted. Trivial cleanup that ought to be done anyway.\r\n\r\nCSCTruthTest is a module that has been broken since at least May 2022 because the consumes calls are made during the Event transition. Possibly there are other problems in there. I didn't try to fix everything, but this is a step in the proper direction. The MuonTruth object is now a data member instead of being constructed on each Event. This eliminates the need for the reference and as a side benefit fixes problems with the consumes calls.\r\n\r\nNote that nothing in the repository uses CSCTruthTest or MuonTruth. Possibly it would be better to delete them entirely. I will do that instead if requested.\r\n\r\n#### PR validation:\r\n\r\nCompilation should be good enough to test the member deletions. There is not an existing test for CSCTruthTest. I created a dummy job with no input that gets to expected ProductNotFound exceptions. Before the changes in this PR, it died when the consumes calls were improperly executed.\r\n\r\nFYI @makortel \r\n", "branch": "master", "changed_files": 8, "comments": 4, "commits": 1, "created_at": "1691609853", "deletions": 32, "labels": ["simulation-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_13_3_X", "number": 42531, "release-notes": [], "review_comments": 0, "state": "open", "title": "Remove references to PSet in SimMuon and SimPPS", "updated_at": "1691630278", "user": "wddgit"}