{"additions": 860, "auther_ref": "pps-timing_2021_geom-11_2_X", "auther_sha": "c0145c7f21cc0801afc5fd503aa332afb68ff984", "author": "forthommel", "body": "#### PR description:\r\n\r\nThis PR is a follow-up of #30252 after the merging of #31383 porting the PPS geometry into the DD4hep world. It includes a new set of DDLs for 2021 scenario (preparing for the addition of a new timing station), before integration onto the geometry DB payload.\r\nThe DetGeomDesc geometry parser is therefore modified to host this additional station, better exploiting the copy numbers in a modified hierarchy. As a result, this latter requires the addition of a \"legacy\" isRun2 flag to allow the previous DD/DB geometry format.\r\n\r\nAs a side development, the track reconstruction plugin is adapted to dynamically create a track fitting algorithm for each new pot/station observed in the rechits stream (i.e. timing pots are not hardcoded anymore in plugin implementation).\r\nAlgorithms being stored as an associative container (single pot detid  algorithm) of this latter, a hash function is defined for the CTPPSDetId object used as an indexing variable.\r\n\r\n@fabferro @jan-kaspar @ghugo83 \r\n\r\n#### PR validation:\r\n\r\nSame validation procedure as #30996. Observed no difference in run 2 CTPPSDiamond* objects with the definition of the new station.\r\nOverlaps detected (using the [g4OverlapCheck](https://github.com/cms-sw/cmssw/blob/master/SimG4Core/PrintGeomInfo/test/python/g4OverlapCheck_cfg.py) tool) equivalent to the ones already present in run 2 geometry (the current second station implementation is a naive copy-paste of this latter), and will be corrected in a follow-up PR. This PR being intended for an update of the reconstruction geometry payload (not the simulation one) it should not be problematic. Experts are warmly welcomed to comment.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR: N/A\r\n\r\n<!-- Please replace this text with any link to  -->\r\n\r\nBefore submitting your pull requests, make sure you followed this checklist:\r\n- [x] verify that the PR is really intended for the chosen branch\r\n- [x] verify that changes follow [CMS Naming, Coding, And Style Rules](http://cms-sw.github.io/cms_coding_rules.html)\r\n- [x] verify that the PR passes the basic test procedure suggested in the [CMSSW PR instructions](https://cms-sw.github.io/PRWorkflow.html)\r\n", "branch": "master", "changed_files": 32, "closed_at": "1607675305", "comments": 151, "commits": 70, "created_at": "1600252983", "deletions": 155, "labels": ["alca-approved", "code-checks-approved", "db-approved", "dqm-approved", "geometry-approved", "orp-approved", "pending-signatures", "reconstruction-approved", "simulation-pending", "tests-approved", "urgent"], "merge_commit_sha": "7170574d17c276aa5c257aca7f30bc721a4c6248", "merged_at": "1607675305", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 31484, "release-notes": [], "review_comments": 28, "state": "closed", "title": "[PPS] 2021 conditions for timing detectors geometry (resubmission after DD4hep)", "updated_at": "1607677856", "user": "forthommel"}