{"additions": 257, "auther_ref": "HCAL_HO_72", "auther_sha": "13ad49dc08fdcb67f72c02b3562de93d3456af08", "author": "bachtis", "body": "Python configurations for the following :\n1. Clustering of the HCAL from hits -removal of the custom PF CaloTower sequence. The clusters are made in layers and then merged to form multiplayer clusters using the Arbor algorithm and incorporating the transverse compatibility  based on shower shapes\n1. HCAL energy and time calculated with the two max time samples. Independently of the HCAL reconstruction  the rechits are read and the 2 max time samples are used to define energy and time of the rec hits. This is a coarse stepo on what will be available in method 2.\n2. 3D clustering with time. In this new reco OOT mitigation is done at clustering level by sharing the energy  across the time dimension so that OOT clusters pull enerrgy out of in time clusters. Timing cuts are then applied on cluster level vs the energy and the HCAL layer before multidepth cluster creation.\n3. Configurations changed to apply the same cleaning in HF in Data reconstruction as before \n   -This cleaning has to be revisited and rediscussed with the HCAL DPG. Will try to bring it up \n   in one of the next meetings  to have uniform strategy for 73X\n\n5.Fast sim configuration changed to remove special noise cuts in Fast sim as before\n1. pfClusteringCutoms.py changed to revert to an HCAL reco that uses standard 2 clustering and energy and time from the default [whatever it is in the rechit] HCAL reco \n", "branch": "CMSSW_7_2_X", "changed_files": 12, "closed_at": "1410236406", "comments": 28, "commits": 9, "created_at": "1409926737", "deletions": 586, "labels": ["comparison-pending", "fastsim-approved", "operations-pending", "pending-signatures", "reconstruction-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "31ac8c5fca82eb482b1fd3cb144a4437e486e118", "merged_at": "1410236406", "merged_by": "davidlange6", "milestone": "Next CMSSW_7_2_X", "number": 5195, "release-notes": [], "review_comments": 0, "state": "closed", "title": "New HCAL clustering in 72X", "updated_at": "1410533153", "user": "bachtis"}