{"additions": 609, "auther_ref": "131X-202103-fast_mon_refactoring", "auther_sha": "7fc2ce4c36ca87e3b8612b478478765e934054a8", "author": "smorovic", "body": "#### PR description:\r\n\r\n- refactoring of FastMonitoringService (mainly in headers( and removal of the legacy MicroStateService classic (only thin class remains as interface to other modules, will be removed at later point).\r\n- removing hack (an unlikely data race) reading path information on first event for microstate monitoring, replaced by getting the information sooner. At first snapshot, mapping to path name memory locations is updated.\r\n  - resolves one of the issues rised in - https://github.com/cms-sw/cmssw/commit/d4abbd312da73273949fa3950c275a2d64997c62\r\n- acquire state is now monitored. Each CMSSW module gains another micro-state for counting state snapshots. This is not exact because of more dynamic thread scheduling (compared to framework stream execution), but is expected to provide approximate measure with microstate snapshots.\r\n- service will not output any monitoring files if time interval is set to 0 (more suitable for e.g. running diagnostics on raw files).\r\n\r\nSeparate commits are provided per the change described.\r\n\r\n#### PR validation:\r\n\r\nTesting done in DAQ testbed shows that it operates without a problem, including having the functional monitoring based on the FastMonitoringService that is modified.\r\n", "branch": "master", "changed_files": 11, "closed_at": "1615849252", "comments": 9, "commits": 7, "created_at": "1615549587", "deletions": 692, "labels": ["code-checks-approved", "daq-approved", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "f903cead6b0a7dc95b8a44a8b199075797f1d3a4", "merged_at": "1615849252", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 33160, "release-notes": [], "review_comments": 0, "state": "closed", "title": "DAQ FastMonitoringService refactoring and monitoring of module acquire state (11_3_X)", "updated_at": "1615849252", "user": "smorovic"}