{"additions": 6, "auther_ref": "UpdatedIVFVertexArbitration_from-CMSSW_8_0_0_pre5", "auther_sha": "d9a6d9b6e57e9a12850233d0d20d74901448f286", "author": "cms-btv-pog", "body": "This PR updates the arbitration step in the IVF secondary vertex reconstruction by requiring all vertices to have at least two tracks with weight>0.5. This change ensures we do not end up with any single-candidate vertices (when vertices are candidate-based, i.e. stored as `reco::VertexCompositePtrCandidate`, only vertex tracks with weight>0.5 are kept. Hence, for vertices consisting of two tracks where one track has weight<0.5 a single-track vertex is produced).\n\nThis PR also affects secondary vertices stored as `reco::Vertex`. The difference here is that, in contrast to `reco::VertexCompositePtrCandidate`, `reco::Vertex` actually stores the track weights so vertices consisting of two tracks where one track has weight<0.5 are still kept as two-track vertices. However, since in track counting and computing the vertex kinematics only tracks with w>0.5 are taken into account, it is better to apply the same requirement also to secondary vertices stored as `reco::Vertex`. In this way both types of secondary vertices are treated in the same way.\n\nThis PR is expected to produce small changes in the size of the IVF secondary vertex collection. However, the IVF-based b-tag discriminators are expected to remain unchanged since they already require secondary vertices with at least two tracks with weight>0.5.\n\n@arizzi\n", "branch": "CMSSW_8_0_X", "changed_files": 1, "closed_at": "1454480522", "comments": 12, "commits": 2, "created_at": "1454316272", "deletions": 2, "labels": ["comparison-available", "fully-signed", "orp-pending", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "8fbef64b0ee1e08614339573c0c459928b7d1dcc", "merged_at": "1454480522", "merged_by": "davidlange6", "milestone": "CMSSW_8_0_X", "number": 13140, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Updated IVF vertex arbitration", "updated_at": "1454489352", "user": "ferencek"}