{"additions": 1146, "auther_ref": "151x-FEDRawDataBuffer", "auther_sha": "172a86fa82ee2454bb33ae9f30e5150a271cd44c", "author": "smorovic", "body": "#### PR description:\r\n\r\nDue to source-ID range (replacing FED IDs) in Phase-2 being 32-bit, current data class that initializes a fixed vector up to maximum FED size (4096) is no longer feasible. If high 32-bit range is used, it would have to allocate order of gigabytes for each event.\r\nNew class, RawDataBuffer uses a std::map, which is supported for ROOT files. Also, instead of allocating a separate buffer for each FED, so a single std::vector<unsigned chanr> is preallocated. Size needs to be precalculated, but it is known in advance by the input source. FEDs are then written into the buffer and map stores offset and length of each block indexed per source ID.\r\nFormat can also be used with Run3 raw data, intendend for tests only.\r\nNote: we expect approx 5000 source IDs and event sizes up to 10 MB in Phase-2.\r\nNote: classes_def.xml format starts at 2 because putting \"1\" returns Error mentioning version \"-1\".\r\n\r\nOther changes:\r\n- migrated DAQSource \"DTH\" mode to the new format. Old format is supported with the legacy one (\"DTHLegacyCollection\" mode) limited to IDs up to 4096. This is intended to be used for subdetector development.\r\n- SLinkRocket header and trailer definitions are updated and moved to DataFormats/FEDRawData from EventFilter/Utilities (which keeps DTH-specific formats).\r\n- Initial source ID assignment file is committed. It does not yet have any assignment to subdetectors and contains dummy assignment that will later be modified.\r\n- fakeBU, DTH fake BU and RawOutputModuleForBU have been migrated to RawDataBuffer format\r\n-   conversion modules between RawDataBuffer and FEDRawDataCollection added (intended for tests)\r\n\r\n#### PR validation:\r\n\r\nUnit tests are provided for testing integrity of the new format. In addition, benchmarks were performed (using Run3 raw files) showing that either writing RawDataBuffer into the ROOT file or unpacking it from the ROOT file does not show any discernible performance difference ( < 1% in time running simple jobs handling this format/files).\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThere are no plans for a backport.", "branch": "master", "changed_files": 26, "comments": 10, "commits": 5, "created_at": "1750928484", "deletions": 258, "labels": ["daq-pending", "pending-signatures", "tests-pending", "orp-pending", "hold", "code-checks-pending", "changes-dataformats"], "milestone": "CMSSW_15_1_X", "number": 48421, "release-notes": [], "review_comments": 0, "state": "open", "title": "[DAQ] Phase-2 raw data product", "updated_at": "1750936407", "user": "smorovic"}