{"additions": 1582412, "auther_ref": "add_CUDA_9.0.176_samples_94x", "auther_sha": "725872c1e947e35369539123186cfa55d00a7376", "author": "fwyzard", "body": "From https://developer.nvidia.com/cuda-code-samples\r\n\r\n> All of the code samples are available under a permissive license that\r\n> allows you to freely incorporate them into your applications and\r\n> create derivative works for commercial, academic, or personal use.\r\n\r\nFrom http://docs.nvidia.com/cuda/eula/index.html#nvidia-cuda-toolkit-license-agreement\r\n\r\n> 2.1. Sample Source Code Modification, Ownership and Distribution\r\n>\r\n> Subject to the terms of the SLA and this Supplement, NVIDIA hereby grants you\r\n> a non-exclusive, non-transferable license, without the right to sublicense,\r\n> during the applicable license term unless earlier terminated pursuant to the\r\n> SLA, to have Authorized Users modify and create derivative works of CUDA\r\n> Licensed Software that constitutes sample source code, when provided to you\r\n> by NVIDIA in source code form.\r\n> You hold all rights, title and interest in and to your modifications and\r\n> derivative works of the sample source code software that you create as\r\n> permitted hereunder (collective, Derivatives), subject to NVIDIA's underlying\r\n> Intellectual Property Rights in and to the CUDA Licensed Software; provided,\r\n> however that you grant NVIDIA and its Affiliates an irrevocable, perpetual,\r\n> nonexclusive, worldwide, royalty-free paid-up license to make, have made, use,\r\n> have used, reproduce, license, distribute, sublicense, transfer and otherwise\r\n> commercialize Derivatives including (without limitation) with the CUDA Licensed\r\n> Software or other NVIDIA products, technologies or materials.\r\n> You may distribute the sample source code as delivered by NVIDIA and/or your\r\n> Derivatives, provided that all NVIDIA copyright notices and trademarks are\r\n> maintained and used properly and the sample source code includes the following\r\n> notice:\r\n> \"This software contains source code provided by NVIDIA Corporation.\"", "branch": "CMSSW_9_4_X", "changed_files": 1050, "closed_at": "1509715208", "comments": 3, "commits": 4, "created_at": "1509544611", "deletions": 0, "labels": ["comparison-pending", "new-package-pending", "orp-pending", "pending-signatures", "tests-pending"], "milestone": "CMSSW_9_4_X", "number": 21118, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Add samples from CUDA 9.0.176", "updated_at": "1509715209", "user": "fwyzard"}