{"additions": 518, "auther_ref": "TrackingResolution", "auther_sha": "06a002f2e6529231f9d4ec65d7b16af5c42bf9f7", "author": "borzari", "body": "#### PR description:\r\n\r\nThis PR implements a data-driven method to artificially shorten muon tracks to assess the tracking pT resolution of short tracks.\r\n\r\nIt relies on shortening the muon tracks by creating track candidates with new hit collections that have the outermost hits removed from the original collection. The new track candidates are refitted to calculate the pT resolution, defined as pT short track / pT of long track. Currently, tracks are being shortened to have 3 to 8 layers, with no missing middle layers. The pT resolution histograms have been included in the tracking DQM sequence, and will also be included in the DQM GUI offline tracking layout.\r\n\r\nThe latest presentation about this work can be found [here](https://indico.cern.ch/event/1247012/#5-update-on-tracking-pt-resolu), and contains links to older presentations as well.\r\n\r\n#### PR validation:\r\n\r\nThe shortening procedure was verified in CMSSW 13_1_0_pre2 with MC events using RelValZMM_14 dataset with and without PU, and with events from collected data using Run 3 Muon_2022G dataset. It works as intended and provides the pT resolution histograms following the expectations.\r\n\r\nThe complete set of changes comprising the inclusion of the tracks shortening module in the DQM sequence and the creation of the histograms inside the DQM root file was checked in CMSSW 14_0_0_pre0 with runTheMatrix workflows 11650.0 (Run 3 ZMM) to check that the shortening procedure worked as expected and that the histograms were added to the DQM root file, and 11634.0 (Run 3 ttbar) to ensure that the DQM step throughput wouldn't be affected in processes having few muon tracks. Both checks were successful.\r\n", "branch": "master", "changed_files": 6, "comments": 11, "commits": 1, "created_at": "1703033761", "deletions": 1, "labels": ["reconstruction-pending", "dqm-pending", "pending-signatures", "orp-pending", "tests-started", "code-checks-approved", "tracking"], "milestone": "CMSSW_14_0_X", "number": 43613, "release-notes": [], "review_comments": 2, "state": "open", "title": "Including short tracks resolution method in DQM", "updated_at": "1703224988", "user": "borzari"}