{"additions": 942, "auther_ref": "track-gen-matching-by-tp_10_6_X", "auther_sha": "8fa15fc12b5575399e1603be9e448e747fef02c5", "author": "elusian", "body": "#### PR description:\r\n\r\nThis PR adds a way to match generalTracks (in AOD) and packedPFCandidates and lostTracks (in miniAOD) to a subset of genParticles, using association by hit on TrackingParticles.\r\nThe association is performed on step3 and just replicated in the miniAOD.\r\nSince the track association by hit needs both TrackingParticles and SimLink for pixel and strips and the SimLink collections are not available in RAWSIM, two plugins are created to be run in step2 to add two pruned collections and avoid adding the all the SimLink, which have a non negligible size.\r\n\r\nThe changes contained are:\r\n- a plugin for pruning TrackingParticles in step2 based on their association to specific GenParticles. The genParticle selection is taken from the GenParticlePruner class and can be configured.\r\n- a plugin for pruning SimLink collections based on the SimTrack association to a TrackingParticle\r\n- a plugin for adding an association between PackedCandidates and GenParticles based on an existing association between tracks and GenParticles\r\n- Needed configuration changes to add this to standard sequences, gated behind the bParking modifier\r\n\r\nNo plugin is needed for association between tracks and GenParticles through TrackingParticle as it is already present in CMSSW (MCTrackMatcher).\r\n\r\n#### PR validation:\r\n\r\nOn a B+->Psi2SK sample (one of the possible targets for this PR) we registered this increases in size, timing and memory\r\n|       | Size | Timing | Memory |\r\n| ---- | ---- | ---- | ---- |  \r\n|RAWSIM|+0.05%|+0.08%|+5MB|\r\n|RECOSIM|< +0.01%|+0.07%|+2MB|\r\n|AODSIM|+0.06%|||\r\n|MINIAODSIM|+0.4%|+0.08%|+400kB|\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nBackport of #33774 needed for BParking reprocessing\r\n", "branch": "CMSSW_10_6_X", "changed_files": 19, "closed_at": "1623545518", "comments": 61, "commits": 18, "created_at": "1623053817", "deletions": 128, "labels": ["backport", "fully-signed", "operations-approved", "orp-approved", "pdmv-approved", "reconstruction-approved", "simulation-approved", "tests-approved", "upgrade-approved", "urgent"], "merge_commit_sha": "d884dab09c6356b62a4ba31970a461da049698c7", "merged_at": "1623545518", "merged_by": "cmsbuild", "milestone": "CMSSW_10_6_X", "number": 33996, "release-notes": [], "review_comments": 3, "state": "closed", "title": "[Backport] Track-gen matching passing through TrackingParticle", "updated_at": "1623545518", "user": "elusian"}