{"additions": 553, "auther_ref": "EGRegModifierUpdates_1060", "auther_sha": "02920afbcba4168d18e7182fea524dfc740adaff", "author": "Sam-Harper", "body": "#### PR description:\r\n\r\nThis is a speculative PR which may or may not be final.  Its more alerting people to what is coming as it'll look a lot like this with perhaps some variables changed. \r\n\r\nFirst there are bug fixes to the V1 and V2 regression modifiers. These modifiers cache the event setup object.  When using ModifiedElectronProducer/  ModifiedPhotonProducer this updates every lumisection. However at somepoint after 102X, the event setup object is deleted and should not be cached. Therefore it was modified to properly cache just the calo geometry. When this code was used in reco, it just happened that setEventContent must have been called every event so we didnt see this bug.  This was a fun debug btw. \r\n\r\nThen it adds the V3 regression modifier. Currently its fully backwards compatible with the existing regressions but adds features necessary for the new regression. The new regression may need more changes now based on studies ongoing. \r\n\r\nSo this might be all the code we need but then again might have some more changes coming.\r\n\r\nRight now even though its using the V3 regression modifer for the old regressions, no changes are expected. \r\n\r\n\r\n", "branch": "master", "changed_files": 16, "closed_at": "1560404883", "comments": 175, "commits": 9, "created_at": "1558530764", "deletions": 43, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "operations-approved", "orp-approved", "reconstruction-approved", "requires-external", "tests-approved"], "merge_commit_sha": "dc71ac5b51aa23d8d35db6ff17c0a3e243335e86", "merged_at": "1560404883", "merged_by": "cmsbuild", "milestone": "CMSSW_11_0_X", "number": 26892, "release-notes": [], "review_comments": 21, "state": "closed", "title": "Adapting EGRegression Modifiers to 106X and adding V3 modifier", "updated_at": "1560404883", "user": "Sam-Harper"}