{"additions": 265, "auther_ref": "HI2015_ClusterCompatibility_75X", "auther_sha": "94eda2aed8f1cebe0f4a8c281001b0f26667dbe0", "author": "appeltel", "body": "This request is to create a new \"ClusterCompatibility\" DataFormat and associated producer for use in the HeavyIon reconstruction scenario.\n\nThis DataFormat is required in order to facilitate a change in analysis strategy for heavy ion data in 2015, where RECO may be replaced with AOD. In previous years, RECO event content has been stored which includes pixel clusters. The pixel cluster information was used to run the HLTPixelClusterShapeFilter to remove beam scraping events from analysis samples. The ClusterCompatibility object provides a small (2.5 kB compressed) summary of the cluster-vertex compatibility information given a hypothesis of a collision vertex at several positions along the z-axis. \n\nFrom the information stored in the ClusterCompatibility object, it is possible to implement a filter with identical behavior to the HLTPixelClusterShapeFilter that does not need access to the collection of pixel clusters, which is not present in AOD. Such a filter has been implemented and tested, but is not part of this pull request. \n\nIn addition to allowing the removal of beam scraping events from analysis samples, the ClusterCompatibility object could be used to identify PbPb collision events with multiple collision vertices. This is not currently possible using tracks, as the specialized heavy ion tracking is performed relative to a specific single vertex position.\n", "branch": "CMSSW_7_5_X", "changed_files": 8, "closed_at": "1431587865", "comments": 16, "commits": 9, "created_at": "1431016909", "deletions": 3, "labels": ["comparison-available", "fully-signed", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "ebc8238ca5e2d2476aee5ff1ecf4430414edf33d", "merged_at": "1431587865", "merged_by": "cmsbuild", "milestone": "CMSSW_7_5_X", "number": 8996, "release-notes": [], "review_comments": 5, "state": "closed", "title": "New HeavyIon ClusterCompatibility object and producer for beam scraping removal", "updated_at": "1431587865", "user": "appeltel"}