{"additions": 790, "auther_ref": "Hcal-ML4DQM", "auther_sha": "f4650a55fec14b4723702c5479293fe7fbfff0b7", "author": "lwang046", "body": "#### PR description:\r\nAdd an `HcalMLTask` to run ML models at the end of each LS for each cell, model description can be found [here](https://indico.cern.ch/event/1155250/contributions/4853721/attachments/2434393/4169212/DESMOD_AD_Spatio_Tempo_HEOnlineDQM_HCAL_DPG.pdf). \r\n\r\nThe configurable `flagDecisionThr` is a sensitivity control variable for the anomaly detection to balance between false negatives (missing to capture anomaly channel) and false positives (mis-flagging of healthy channel).  It is a threshold value used when generating channel anomaly status flags from the estimated channel anomaly score strength. The higher flagDecisionThr reduces the anomaly detection sensitivity (captures extreme channel faults such as dead and hot issues but may miss some anomalies). In contrast, the lowering the flagDecisionThr increases the sensitivity (captures also degrading channels but may also increase false detections). Generally, the anomaly scores are proportional to channel deterioration (degrading, dead, and hot channel faults, respectively). \r\nThe general recommend values for the latest models are between 10 and 30. If the AD model is generating too much false flags, increase the `flagDecisionThr` and if it is missing too much actual anomalies, reduce flagDecisionThr.  Note that tuning `flagDecisionThr` is not repeatative task and may need to be done only during initial phase of the deployment and not for every experiment.\r\n\r\n\r\n#### PR validation:\r\n\r\nTested with `runTheMatrix.py`, desired plots were shown added.\r\n\r\n", "branch": "master", "changed_files": 5, "closed_at": "1690438764", "comments": 42, "commits": 1, "created_at": "1688704741", "deletions": 0, "labels": ["dqm-approved", "fully-signed", "tests-approved", "orp-approved", "requires-external", "code-checks-approved", "hcal"], "merge_commit_sha": "61c13520828e102aaab307080c2feae7282bc859", "merged_at": "1690438764", "merged_by": "cmsbuild", "milestone": "CMSSW_13_3_X", "number": 42212, "release-notes": [], "review_comments": 16, "state": "closed", "title": "HCALDQM - Add occupancy-per-LS based ML monitoring plots", "updated_at": "1690438764", "user": "lwang046"}