{"additions": 248, "auther_ref": "concurrentIOVsL1ConfigOnlineProdBase3", "auther_sha": "2d4f54cdb832d0d4a810d08898fec522888e2e60", "author": "wddgit", "body": "This PR changes the return type of \"produce\" functions in ESProducers from shared_ptr to unique_ptr. This will help as we migrate towards running multiple IOVs concurrently, because ESProducers that actually share and reuse the memory need special treatment to work properly when multiple IOVs are processed concurrently. In all the cases modified here, the memory is not actually shared and reused. A unique_ptr will work just as well as a shared_ptr. By making this change, it makes it easier now and in the future to identify and take special care of the ESProducers that actually do share and reuse memory, because there are not actually very many of them. In addition, performance is slightly better with unique_ptr's than shared_ptr's.\r\n\r\nThis PR modifies L1ConfigOnlineProdBase and L1ConfigOnlineProdBaseExt and all the ESProducers that inherit from them.\r\n\r\n(Note that previously PR #25037 was rejected and closed, then split into 3 different PRs. The first two of those PRs included all the changes in CondCore and have now already been merged. This is the 3rd of those PRs and includes only the changes from that PR outside CondCore. But other than that, it is the same as the original PR)\r\n\r\nThere is also a little bit of cleanup, like deleting unused \"using\" statements around the lines of code modified. And also some unrelated changes added by \"scram b code-checks\".\r\n", "branch": "master", "changed_files": 80, "comments": 11, "commits": 3, "created_at": "1544477855", "deletions": 386, "labels": ["code-checks-approved", "comparison-available", "db-approved", "fully-signed", "l1-approved", "orp-pending", "tests-approved"], "milestone": "CMSSW_10_4_X", "number": 25464, "release-notes": [], "review_comments": 0, "state": "open", "title": "Prepare for concurrent IOVs, L1ConfigOnlineProdBase ", "updated_at": "1544522650", "user": "wddgit"}