{"additions": 59, "auther_ref": "EF_3MUOS_fix", "auther_sha": "d1071564fccc377bf4128255797f55fc8c3a34b0", "author": "elfontan", "body": "This PR contains a fix in the correlation class to handle the three-body conditions in order to include the possibility to read the OS requirement for TripleMu seeds with the three-muon invariant mass requirement.\r\nReference PR: https://github.com/cms-sw/cmssw/pull/33911.\r\n\r\n#### PR validation:\r\nA special menu have been created for the validation of the updates starting from the baseline [L1Menu_Collisions2022_v1_3_0](https://htmlpreview.github.io/?https://github.com/cms-l1-dpg/L1MenuRun3/blob/master/development/L1Menu_Collisions2022_v1_3_0/L1Menu_Collisions2022_v1_3_0.html) and adding two new seeds as copy of bits 82-83 with an additioanl OS requirement. \r\nL1Ntuples have been created re-emulating the uGT step to take into account the new menu and the final countings have been checked in three scenarios:\r\n- Default uGT emulator\r\n- Updated uGT emulator adding the cut for all cases involving the three body invariant mass: same countings in bits 82-83 and new bits with the expected reduction by the removal of the three SS muon events causing the high rate.\r\n- Updated uGT emulator adding the cut for cases involving the three body invariant mass with an OS requirement parsed from the xml menu: reduction as in two only in the two new seeds containing the OS requirement.\r\n\r\nCMSSW release used for tests: _CMSSW_12_6_0_pre4_.\r\n\r\nFinal tests are currently performed by producing test vectors based on the above mentioned L1 menu and checking the data-MC agreement. ", "branch": "master", "changed_files": 3, "comments": 3, "commits": 2, "created_at": "1668419341", "deletions": 16, "labels": ["l1-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_12_6_X", "number": 40060, "release-notes": [], "review_comments": 0, "state": "open", "title": "OS requirement for Triple Muon seeds in the uGT emulator", "updated_at": "1668431062", "user": "elfontan"}