{"additions": 188, "auther_ref": "stack-trace-pause", "auther_sha": "038d35d71e3000c62fe3681173f40089c0909abd", "author": "dan131riley", "body": "The idea for this PR is to get more informative stack traces for multithreaded jobs by pausing all CMSSW threads.  Currently these threads continue to run while the stack trace is being collected, so we get no reliable information about what the other threads were doing at the time, making it difficult to debug problems caused by interactions between threads.\n\nThe implementation uses a signal handler, triggered by SIGRTMAX (where available), that prints the current module and then pauses the thread for a configurable interval (default 5 minutes).  A tbb::task_scheduler_observer is used to collect the thread IDs of all threads created by TBB; this change does assume that all TBB created threads will have access to the CMSSW thread-local CurrentModuleOnThread.\n\nSignal handlers are always somewhat touchy to write.  I've tried to be very careful to avoid any changes that could impact running jobs; any issues from this PR should only appear in jobs that have already received a fatal signal.  One noticeable consequence is that stack traces will now show all CMSSW threads in signal handlers, so a little more searching will have to be done to find the one in the stacktraceFromThread() signal handler.\n\nThis PR uses strlcpy()/strlcat() for low-level C-style string manipulation in the signal handlers; these are not standard on Linux, but are provided (and used heavily) by ROOT.\n\nThis also fixes a bug in FWCore/Utilities/src/UnixSignalHandlers.cc that meant SIGRTMAX wasn't being blocked.  With these changes, SIGRTMAX is now blocked (along with the rest of the RT signals) until the stack trace signal handler unblocks it for entire process.\n", "branch": "CMSSW_8_1_X", "changed_files": 2, "closed_at": "1471236462", "comments": 29, "commits": 6, "created_at": "1470746652", "deletions": 8, "labels": ["comparison-available", "core-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "7a08b91ba333af39337f0a20822f20cd25696dd9", "merged_at": "1471236462", "merged_by": "cmsbuild", "milestone": "Next CMSSW_8_1_X", "number": 15401, "release-notes": [], "review_comments": 15, "state": "closed", "title": "Before collecting a stack trace, pause all CMSSW threads and print out the current modules", "updated_at": "1507556356", "user": "dan131riley"}