{"additions": 1775, "auther_ref": "CMSSW_8_1_X_tau-pog_miniAOD-tauID", "auther_sha": "d8d833b97da753962b11a1c7dc404f2e8c9ed54e", "author": "cms-tau-pog", "body": "This is a pull request to layout the infrastructure to create the actual pat::Tau-discriminator ValueMap. \n\nThe PATTauDiscriminator.h is declared in DataFormats/PatCandidate. The classes for filling are provided in RecoTauTag/RecoTau:\n- PATTauDiscriminantCutMultiplexer.cc : used to save discriminator working points (eventually depending on other variables), following the currently existing TauPOG infrastructure.\n- PATTauDiscriminantCutMultiplexer_cfi.py : corresponding cfi file for configuration.\n- PATTauDiscriminationByMVAIsolationRun2.cc : the plugin to create the tauID discriminator ValueMap\n- PATTauDiscriminationByMVAIsolationRun2_cff.py : corresponding cff file for configuration.\n\nSeveral other files have been modified to account for the existence new discriminator or to adapt helper functions to be able to act on the PATTauDiscriminator as well as on the PFTauDiscriminator. The input values for the AOD based discriminator calculation have been downgraded to float, since this is the available level of accuracy on miniAOD. This has been done with the premiss to guarantee that the MVA return values are the same irrespective of whether AOD or miniAOD has been used as input to the calculation. A few files have been added to the RecoTauTag/RecoTau/test directory for unit testing.  \n\nUsual checks have been made (apart from runMatrix problems with CMS_DAS). Also internal tests show that already existing workflows are not altered or compromised in any way. The unit test show that the discriminator can be calculated on miniAOD event content and read-in at analysis level and that it returns identical results to the discriminator as calculated on AOD input at an accuracy of 10e-5. Residual differences are understood in terms of differences on the miniAOD input variables.   \n\nWe would like to get this infrastructure integrated in time for CMSSW_8_1_0_pre12. \n\nPotentially we would like to backport it to 80X: it does not change any existing event content while it clearly add a new object to the EDM. In the typical case the new objects will be used at the analysis level and will be transient. The use case is also expressed by the fact that the new data object is defined in the AT packages DataFormats/PatCandidates. We anticipate that the backport might be subject of debate and rely on our assessment.\n\nAs for the extension of the miniAOD event content before we have one more development that is a bit lacking behind but that we would like to be integrated on the same time scale for the anti-electron discriminator. We hope that we can prepare this PR by tomorrow based on the infrastructure that has been laid out here. It will then ideally only add the plugins to calculate the physically different discriminator values using the PATTauDiscriminator infrastructure introduced with this PR. It will therefore not be as extended in lines of new/altered code as this PR. \n\nCheers,\nRoger\n", "branch": "CMSSW_8_1_X", "changed_files": 19, "closed_at": "1475039163", "comments": 23, "commits": 19, "created_at": "1473325415", "deletions": 225, "labels": ["analysis-pending", "comparison-available", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "e1d30d054fa0661d1a5062d7c6505a3a4be4a3fc", "merged_at": "1475039163", "merged_by": "davidlange6", "milestone": "Next CMSSW_8_1_X", "number": 15778, "release-notes": [], "review_comments": 31, "state": "closed", "title": "Infrastructure to create the actual ValueMap pat::Tau-discriminator for tau isolation and ID", "updated_at": "1487932744", "user": "roger-wolf"}