{"additions": 22, "auther_ref": "remove_calo_tau_code", "auther_sha": "c0c9efe14dadf08f45afe906f0afecb3ba3f0ec5", "author": "cms-tau-pog", "body": "#### PR description:\r\n\r\nThis PR removes remaining code of Calo Taus, which are not used anymore. The purpose is basically clean up. In a previous PR #26816 some parts like reconstruction have already been removed.\r\n\r\nAll data formats specific to Calo Taus are removed. The content of some AOD productions from 2015 to 2018 was checked and did not contain these formats. The corresponding content dumps can be inspected in /afs/cern.ch/user/s/swozniew/public/TauPOG/EvtContentChecks. Therefore, no compatibility problems with existing official AODs are expected.\r\nFurthermore the removal of the data formats was announced in https://indico.cern.ch/event/829640/contributions/3473231/attachments/1869301/3075263/StatusReportTauRECOJune.pdf, asking for objections concerning private productions but without responses so far.\r\n\r\nIn order to completely remove Calo Tau code, some member functions and the attribute caloSpecific_ of pat::tau were removed requiring a new class version 19 for pat::tau.\r\n\r\nSome unused includes and typedefs from HLTrigger are removed. Also some code in DQM, DQMOffline, Fireworks that should be unused is removed. But please let know if related experts should be contacted.\r\n\r\nThis PR is not supposed to cause changes in physics results.\r\n\r\n#### PR validation:\r\n\r\ncompiles and passes limited Matrix tests apart from some DAS errors\r\n", "branch": "master", "changed_files": 42, "closed_at": "1562687283", "comments": 36, "commits": 3, "created_at": "1561725180", "deletions": 1058, "labels": ["analysis-approved", "code-checks-approved", "comparison-available", "docs-pending", "dqm-approved", "hlt-approved", "orp-approved", "pending-signatures", "reconstruction-approved", "tests-approved", "visualization-pending"], "merge_commit_sha": "3024fbc335cc473356e527f0c8f12d30325b5462", "merged_at": "1562687282", "merged_by": "cmsbuild", "milestone": "CMSSW_11_0_X", "number": 27400, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Remove calo tau code and data formats", "updated_at": "1562687283", "user": "swozniewski"}