{"additions": 3325, "auther_ref": "ticlv5_dataformats_associators", "auther_sha": "a98834cadd6dce32df3f130f3d93d85c179c771f", "author": "waredjeb", "body": "This PR is meant to improve the Monte Carlo truth information within the TICL Framework. \r\n- Add RecoTrack index to collection of SimTracksters. This is done by using the SimTrack-to-TrackingParticle association map and the TrackingParticle-to-RecoTrack association. The SimTrack is known from the CaloParticle/SimCluster that seeds the creation of the SimTrackster\r\n- Add PU SimTrackster. This is a single SimTrackster built from all the remaining contributions from the LayerClusters not used in the SimTracksters. This is only used to estimate the pileup contamination in the recoObjects\r\n- Add SimTICLCandidate: This is a new object created within the SimTracksterProducer. This object is meant to be the best Particle Flow reconstruction we can achieve with the available objects, and is going to be used for validation of the full TICL chain. This object is created for each CaloParticle and contains the list of SimTracksters beloging to the same CaloParticle and the best recoTrack associated to the CaloParticle (plus each SimTrackster knows its RecoTrack) [1]\r\n- Associators: Adding associators[2] to EventContent.\r\n- TICLDumper: EDAnalyzer for saving TICL information in TTrees and be used out of CMSSW. Extensively used by TICL group for several studies and developments. Can be enabled by using `customiseTICLFromReco` in step3\r\n- Trackster DataFormat optimization\r\n\r\n- [1] https://indico.cern.ch/event/1234092/sessions/473632/attachments/2582424/4470565/TICLMeeting_09_02_23.pdf\r\n- [2] https://hgcal.web.cern.ch/Validation/TracksterValidation/\r\n\r\n**Validation**\r\n- `runTheMatrix.py -l limited -i all --ibeos `\r\n- private testing to inspect TICLDumper content\r\n", "branch": "master", "changed_files": 37, "comments": 121, "commits": 12, "created_at": "1691564847", "deletions": 127, "labels": ["reconstruction-pending", "simulation-pending", "dqm-pending", "pending-signatures", "tests-rejected", "orp-pending", "upgrade-pending", "code-checks-approved", "tracking", "trk"], "milestone": "CMSSW_13_3_X", "number": 42518, "release-notes": [], "review_comments": 19, "state": "open", "title": "Improve MC truth information in TICL, Sim-Reco Associators, TICLDumper", "updated_at": "1697017063", "user": "waredjeb"}