{"additions": 3068, "auther_ref": "implementConcurrentRuns11", "auther_sha": "2ed188587d3a9229644848dd49e31a843cb336a9", "author": "wddgit", "body": "#### PR description:\r\n\r\nImplement support for concurrent runs in the Framework.\r\n\r\nThe design is analogous to what was done to implement\r\nconcurrent luminosity blocks as much as possible, although\r\nthere are unavoidable differences.\r\n\r\nOne can configure how many concurrent runs are allowed.\r\nThe default is one. With that setting, almost nothing externally\r\nvisible should change in the behavior of cmsRun. There\r\nare significant and complex changes in the Framework\r\nimplementation to support this new ability.\r\n\r\nEven with the number of concurrent runs configured to 1 the\r\nFramework will be able to execute some transitions concurrently\r\nwhich could not be executed concurrently before:\r\n- The streamBeginRun transition will be able to run concurrently with global begin lumi, and on other streams - stream begin lumi, events, stream end lumi, and stream end run.\r\n- The streamEndRun transition will be able to run concurrently with global end lumi and on other streams - stream begin lumi, events, stream end lumi and stream begin run.\r\n\r\nIf the number of concurrent runs is configured greater than one,\r\nthen global end run can run concurrently with any transitions from\r\nanother run and global begin run can run concurrently with any transitions\r\nfrom another run except global begin run and global begin lumi.\r\n\r\nThis pull request does NOT upgrade modules and services outside\r\nthe Framework to support concurrent runs. We expect many of them\r\nwill fail if the number of concurrent runs is configured to be\r\nmore than one in an existing production configuration. We have not\r\nsurveyed existing code to see which modules and services cannot\r\nsupport concurrent runs. Most should be OK because they do not\r\ndepend on run transitions. But for example, a module designed\r\nto create per run histograms might have problems with concurrent\r\nruns.\r\n\r\nOne configures the \"numberOfConcurrentRuns\" in the top level\r\noptions parameter set. If it is 0 or greater than the number\r\nof concurrent lumis, then it will be reset to equal the\r\nnumber of concurrent lumis.\r\n\r\nIf an EventSetup IOV changes at a run boundary, then one also\r\nwould need to configure concurrent IOVs for that record to two\r\nto actually have the runs on both sides of that run boundary process\r\nconcurrently. Without that cmsRun would execute properly, but the\r\nIOVs would block concurrent execution. In addition, it is technically\r\npossible for the sequence of transitions beginLumi, endRun,\r\nbeginRun, and beginLumi to all have different IOVs. An EventSetup\r\nrecord with such IOVs would need to be configured to allow\r\n4 concurrent IOVs to process both runs concurrently across\r\nsuch a run boundary.\r\n\r\nIt is the design intent that the rest of changes are transparent\r\nto the user (beyond what is discussed above).\r\n\r\n#### PR validation:\r\n\r\nThere are a few new unit tests. Existing unit tests pass. In fact\r\nexisting unit tests covered most of the features one might be\r\nconcerned about with this pull request. Of the new tests, these two\r\nconfigurations are the most significant:\r\n\r\nFWCore/Integration/test/testConcurrentIOVsAndRuns_cfg.py\r\nFWCore/Integration/test/testConcurrentIOVsAndRunsRead_cfg.py\r\n", "branch": "master", "changed_files": 106, "closed_at": "1664898424", "comments": 84, "commits": 1, "created_at": "1658323126", "deletions": 1931, "labels": ["core-approved", "simulation-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "0d05bbab398a144ca83dc745a570951cb343212f", "merged_at": "1664898424", "merged_by": "cmsbuild", "milestone": "CMSSW_12_6_X", "number": 38801, "release-notes": [], "review_comments": 90, "state": "closed", "title": "Implement support for concurrent runs in the Framework", "updated_at": "1664898424", "user": "wddgit"}