{"additions": 12, "auther_ref": "removeOwnVectorBaseTrackerRecHit", "auther_sha": "84d3ad5e1bbd688fc3b648c480ad4c86587abfe2", "author": "wddgit", "body": "#### PR description:\r\n\r\nThis is part of a campaign to remove code related to OwnVector. This is in preparation for a possible move to RNTuple from TTree as a persistence mechanism. RNTuple does not support OwnVector because it allows polymorphism. Issue https://github.com/cms-sw/cmssw/issues/42734 discusses this in more detail.\r\n\r\nIn this PR, ```OwnVector<BaseTrackerRecHit>``` is replaced. This is one of the classes on Matti's list in the issue.\r\n\r\nThe dictionaries are transient so there should be no backward compatibility issues. The ```OwnVector<BaseTrackerRecHit>``` is converted to ```std::vector<std::unique_ptr<BaseTrackerRecHit>>``` in the places  where it appears.\r\n\r\nThe output and behavior of the code should be the same as before. The EDProducer that produces this also makes another product. That product has pointers to the objects in product with the OwnVector. Nothing else uses it. The only purpose of putting the  product in the event is to keep the object alive so those pointers continue to work. Nothing directly consumes it.\r\n\r\n#### PR validation:\r\n\r\nSeveral tests in runTheMatrix.py execute the affected code and those tests pass. For example, test 25.0 step 3 executes it. As a temporary test, I commented out the line putting the product in the event. When that is done, there is a seg fault when the code that dereferences the pointers accesses the object. This is expected behavior and it shows the object is getting put in the event properly when runTheMatrix tests are run and pass with object being put in the event.\r\n", "branch": "master", "changed_files": 3, "comments": 7, "commits": 1, "created_at": "1708534084", "deletions": 12, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-pending", "code-checks-approved", "tracking"], "milestone": "CMSSW_14_1_X", "number": 44047, "release-notes": [], "review_comments": 0, "state": "open", "title": "Migrate away from ```OwnVector<BaseTrackerRecHit>```", "updated_at": "1709107237", "user": "wddgit"}