{"additions": 268208, "auther_ref": "devNewValidation_81X", "auther_sha": "43f256167244ef7fa5a2e9dfe6a6c3a8f677a4cb", "author": "abbiendi", "body": "This is the first step in deployment of an improved muon track validation code.\nThe strategy is agreed with the Muon POG and PPD conveners.\n\nThis PR contains new code and configuration files, introduced alongside with the current code and cfgs. The new code is not yet used in the standard workflows, i.e. nothing should change anywhere.\n\nThe second step will be the customization of a few configuration files (marked by a comment) to let the new and the default code to run (both) for a given 81X prerelease cycle in few selected muon RelVals. This will allow for a smooth transition between the current and the new validation code. The plan foresees to deploy the new validation at the prerelease following the one with duplicate validations. At that point the old code should be possibly removed.\nAs I will be on vacation for the next few weeks this is supposed to let others to implement the necessary customization to try to speed up things a bit.\nAlso this base code is convenient for other developments (new code for upgrades, which can be integrated afterwards).\n\nAs a side effect the main muon POG validation affects the HIN validation of muons. HIN should decide what to do during this intermediate period. (I am available to help out, I tried to update the HIN part as well).\n\nThe new code and configuration has been flagged by a prefix \"New\" in filenames, class/module names, when it is a duplicate of the current production code. \nFeatures:\n- much clearer code, easier maintenance and developments, some technical improvements\n- new plots for performance vs PU, charge misid ...\n- removal of a few unused plots\n- improved settings of the histogram binning/ranges for different types of muons. All such settings contained in a cfg file \"histoParameters_cff.py\".\n- better choice of names for histograms, corrected labels etc...\n- better use of selectors to clean up the cfgs\n- slimmed/clearer cfgs as a consequence of the above changes\n- kept legacy configurations for use of TrackAssociatorByPosition in separate files, avoiding to clutter the main cfgs as in the current version\n- new default setting of the MuonAssociatorByHits to flag as fakes global muons with tracker and muon hits matched to different particles: this will produce sensible fake rates (much higher than what is obtained currently). Side note: the current configuration has always lived for historical reasons.\n\ncheers\n    Giovanni\n", "branch": "CMSSW_8_1_X", "changed_files": 3392, "closed_at": "1487951657", "comments": 46, "commits": 4735, "created_at": "1467990755", "deletions": 493911, "labels": ["alca-pending", "analysis-pending", "comparison-pending", "db-pending", "l1-pending", "orp-pending", "pending-signatures", "reconstruction-rejected", "tests-pending"], "milestone": "Next CMSSW_8_1_X", "number": 15153, "release-notes": [], "review_comments": 3, "state": "closed", "title": "Improved muon track validation (step1: base code deployment, no change to workflows)", "updated_at": "1487951657", "user": "abbiendi"}