{"additions": 239, "auther_ref": "AncestralValueMaps_105X-010419", "auther_sha": "38bd1b5cc99cbd89de141b8fd6eff82b61d81fc2", "author": "Sam-Harper", "body": "This is a rebase of https://github.com/cms-sw/cmssw/pull/25576. Because I like to have the base release in the branch name (I know its easy to  find out but this makes my life a bit easier), I decided to close that PR and reopen it with a new branch. The text of that PR follows below:\r\n\r\nValuemaps are used extensively to associate values with objects. An object is identified via a product id/ index pair, corresponding to a given item in a collection. This is used extensively in the HLT but is also used frequently in RECO. A value map can only be used with a reference to an object from the collection it was created with.\r\n\r\nThe issue arises in that we often need to make new collections of electrons/photons (such as converting them to pat or updating the objects with new embedded information). Currently when you do this, you need to rekey all the value maps associated with that collection, which to put it mildly is a pain.\r\n\r\nThis update allows electrons and photons to track which objects they were made from by storing a edm::Ptr to the original object. edm::ValueMap interface has been extended to recognize when this information is available and if the edm::Ptr is invalid, cycle through its parents to see if it finds one that matches the collection it was created from. This means a new collection of pat::Electrons can use value maps keyed to the orginal GsfElectrons. This greatly simplifies the code, look what happens to RecoEgamma/EgammaTools/interface/EGExtraInfoModifierFromValueMaps.h. ReducedEGProducer will similarly get smaller as it spends some effort rekeying valuemaps. Also makes VID so much easier.\r\n\r\nThe setting of the parents references is optional and up to the code which creates the new electrons/photons. You may not want to do it for temporary collections for which no value maps are produced.\r\n\r\nNote the code refers to parentRefs etc but perhaps I should rename it to pointers as thats what they are.\r\n\r\nFinally, this is probably of interest to other POGs who likely have similar issues. As such I'm open to the idea allowing reco::Candidates to track their parents and adding this capability for everybody.\r\n\r\nBtw backporting some of this to 102X would be useful, this would make E/gamma user recipes easier. However I'm not going to push for this.\r\n\r\nAlso while I was compiling half of CMSSW anyways, I added an \"unInitialized\" method to InputTag, can remove if you like but it made the code a bit more clear.", "branch": "master", "changed_files": 15, "comments": 10, "commits": 2, "created_at": "1546861721", "deletions": 265, "labels": ["analysis-pending", "code-checks-approved", "comparison-available", "core-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-approved"], "milestone": "CMSSW_10_5_X", "number": 25593, "release-notes": [], "review_comments": 3, "state": "open", "title": " Ancestral Value Maps : 105X", "updated_at": "1546899076", "user": "Sam-Harper"}