{"additions": 217, "auther_ref": "CMSSW10X_Updates_NegativeTag", "auther_sha": "575defa79289ec3f2b9bd27f3767e3defa0f3a08", "author": "emilbols", "body": "This PR is concerned with the implementation of the DeepFlavour negative tagger, which is used for estimating the rate of light jets being tagged as b jets. The goal of the negative tagger is to have the same light jet distribution as the full tagger, but filter out as many b-jets as possible at high discriminator values. This is done by inverting the sign of all distributions that are symmetric under sign inversion for light jets, but not for b-jets.\r\n\r\nA series of bugs that were discovered in the current implementation of the DeepCSV (and CSVv2) negative tagger has also been fixed in this PR. A description of the bugs and the negative taggers in general can be found in this presentation at the BTV meeting [1].\r\n\r\nIt was also discovered that in the method used for producing inclusive secondary vertices, there is a cut on the angle between the vertex flight direction and the direction of the track sum. This cut needs to be inverted for a negative tagger, so a vertexing sequence with correct cuts for a negative tagger has been introduced.\r\n\r\nIn the plot [2] the negative tagger of DeepCSV is shown. The negative tagger discriminator values are shown from -1 to 0, and the full tagger is shown from 0 to 1.\r\n\r\nA similar plot for DeepFlavour is shown in [3]\r\n\r\nFinally, in this PR a retraining of the DeepFlavour model with more realistic MC samples has been added. It is therefore required that the PR https://github.com/cms-data/RecoBTag-Combined/pull/12 is merged first.\r\n\r\n[1] https://indico.cern.ch/event/713923/contributions/2938152/attachments/1620844/2578707/NegativeTagger.pdf\r\n\r\n[2]\r\n![deepcsvnegativetagger](https://user-images.githubusercontent.com/33452471/40061942-5945600a-585a-11e8-9b78-1286ab57791a.png)\r\n\r\n[3]\r\n![deepflavournegativetagger](https://user-images.githubusercontent.com/33452471/40061957-5f1072ae-585a-11e8-83eb-058aceba5b75.png)\r\n", "branch": "master", "changed_files": 11, "comments": 23, "commits": 16, "created_at": "1526386688", "deletions": 60, "labels": ["analysis-pending", "code-checks-pending", "comparison-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-pending"], "milestone": "CMSSW_10_2_X", "number": 23206, "release-notes": [], "review_comments": 8, "state": "open", "title": "Deep Negative Taggers + DeepFlavour re-training", "updated_at": "1527648569", "user": "emilbols"}