{"additions": 163, "auther_ref": "g4particles_Showers", "auther_sha": "5a60d166a74f46e8520c8999ba6f35fe9cec3d51", "author": "civanch", "body": "This PR was discussed at the SIM meeting: \r\nhttps://indico.cern.ch/event/702324/contributions/2885360/attachments/1596130/2528121/VI20180206.pdf \r\n\r\nSeveral static methods are added to identify Geant4 particle type. These methods are used to select shower library branches with EM or hadronic hits. Hyperons and exotic particles will not any more treated as \"hadrons\", they should decay and only decay products will provide showers. Due to that, in many workflows one can expect different simulation histories and only statistical comparison of results is possible.\r\n\r\nHF hits are sampled differently:\r\n1) for e+-, gamma and stable hadrons SL is called, if kinetic energy of a particle is below 50 MeV the particle is killed 2) Hyperons are ignored - no hits are created, allowing them to decay first\r\n3) If baryon number of a particle is above 0 then kinetic energy is used for SL interpolation and not total energy. DUe to these modifications low-energy ions does not produce any more extra hits\r\n\r\nCastorSD class was changed more in order to use this opportunity when results are not identical:\r\n1) many commented lines removed; 2) fabs -> std::abs 3) early check of primary particle type and do not perform computations if a particle is not for shower library and cannot produce Cerenkov light.\r\n\r\nAdditionally some commented lines and unused variables are removed in other classes.\r\n", "branch": "master", "changed_files": 13, "closed_at": "1524400068", "comments": 58, "commits": 5, "created_at": "1518011252", "deletions": 286, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "caf9c332c34438343725be1e28a72ed7ff13a657", "merged_at": "1524400068", "merged_by": "cmsbuild", "milestone": "CMSSW_10_2_X", "number": 22145, "release-notes": [], "review_comments": 3, "state": "closed", "title": "Geant4 Sensitive Detectors update 4: revised selection of particle type for shower libraries", "updated_at": "1524400069", "user": "civanch"}