{"additions": 34, "auther_ref": "VIDIsPOGFix93X", "auther_sha": "944fa090894021d6f9bf207da969a473049d742a", "author": "Sam-Harper", "body": "Dear All,\r\n\r\nThis PR fixes issue raised in https://github.com/cms-sw/cmssw/issues/19799\r\n\r\nThe short summary:\r\nVID md5sums the tracked part of the pset's dump string of its id psets. Therefore isPOGApproved is easier if it's tracked as you have to redo the md5sum once you flip it. However it also forbids untracked parameters in its id psets. Therein lies the issue because isPOGApproved can neither be tracked or untracked now. \r\n\r\nTo solve this issue, when setting up the VID module via a python function, VID deletes the isPOGApproved from the id pset and creates a new pset with the id, md5sum and id pset. The issue is when you do this twice, the second time isPOGApproved is missing from the id pset and therefore VID warns that its not approved.\r\n\r\nTo fix the issue, we now ignore isPOGApproved when checking there are no untracked parameters in the id pset. \r\n\r\nThis should only affect the printing out of the warning about not being approved, there should be no other changes expected from this.\r\n\r\nNote while I was doing this, I noticed that the md5sum checking is somewhat useless. It does not throw an exception if they differ and if you're running with info suppressed, you wont even see it.  It should be changed in my opinion to throw if there's a difference or at least throw if isPOGApproved is set. \r\n\r\nFor testing, I had a fair number of xrootd issues with runTheMatrix and scramv1 b runtests so I can not guarantee they all pass. \r\n\r\n\r\n\r\n", "branch": "master", "changed_files": 2, "closed_at": "1500961448", "comments": 8, "commits": 1, "created_at": "1500833898", "deletions": 13, "labels": ["analysis-pending", "comparison-available", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "a055509f28dfa560ad8e8cafaa16252218afe980", "merged_at": "1500961448", "merged_by": "cmsbuild", "milestone": "CMSSW_9_3_X", "number": 19872, "release-notes": [], "review_comments": 0, "state": "closed", "title": "VID update to handle isPOGApproved in a better way", "updated_at": "1500961448", "user": "Sam-Harper"}