{"additions": 110, "auther_ref": "dev-filterExtrapolatedTracks", "auther_sha": "dcf6752b80962fc4f74e23bd8f21334608280b1a", "author": "CeliaFernandez", "body": "#### PR description:\r\n\r\nThis PR modifies the track extrapolation to the muon chambers to reduce the time taken in muons1stStep sequence. In the current setup all tracks (passing soft pt and eta requirements) are extrapolated to all chambers that are geometrically compatible with the track parameters. The proposed changes allow to check if there are segments/hits in these chambers before initiating any extrapolation. If there are segments/hits, the track is extrapolated to the compatible chambers, if not, extrapolation is aborted.\r\n\r\nImplementation was built on top of 13_0_0_pre3.\r\n\r\nThe time taken by muon1stStep was reduced from 4.5% to 3.8%, which translates into a reduction of total RecoMuon time from 7.0% to 6.1%. This measurement was done in lxplus with low precision, so checks are required.\r\n\r\n**No changes are expected in any collection as this PR is not intended to modify any physics behavior but reduce the time taken by muon reconstruction.**\r\n\r\nMore info in this presentation: https://indico.cern.ch/event/1257332/\r\n\r\nSome notes:\r\n1. ME0 segments were loaded by default, so ME0 hits were also loaded as well. There is an ongoing migration from GEM  ME0 ( [#31424](https://github.com/cms-sw/cmssw/issues/31424)), should we take advantage here to remove them from TrackAssociator?\r\n2. There is a merge conflict with changes introduced by other PR (https://github.com/cms-sw/cmssw/pull/40698), although the proposed changes should give an equivalent outcome. How can I proceed here?\r\n\r\n#### PR validation:\r\n\r\nThis PR was tested with standard 11834.21 workflow. It passes the runTheMatrix tests with the exception of 2 where the connection of the input samples couldn't be readed.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport.\r\n\r\n\r\n", "branch": "master", "changed_files": 8, "comments": 13, "commits": 8, "created_at": "1681299075", "deletions": 3, "labels": ["reconstruction-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "tracking"], "milestone": "CMSSW_13_2_X", "number": 41323, "release-notes": [], "review_comments": 7, "state": "open", "title": "Filter tracks extrapolated to the muon system", "updated_at": "1684173410", "user": "CeliaFernandez"}