{"additions": 32, "auther_ref": "phase1pixeldqm-bugfixes", "auther_sha": "5b03e23a33ee37d8c44b8e2b0f710eb78ba7d2f7", "author": "schneiml", "body": "This PR fixes some smaller bugs that were found in the first version merged in #14586 (also @fioriNTU ).\n- (UPDATE: the explanation here is wrong, it seems this was all caused by the invalid refs fixed by [this](https://github.com/cms-sw/cmssw/pull/14760/commits/5b03e23a33ee37d8c44b8e2b0f710eb78ba7d2f7). I still don't understand why this happens, but it is undefined behaviour and therefore totally fine.) The most critical one was caused by the last-minute changes to TrackerTopology ( @davidlange6 ). The new code stored a `edm::ESHandle` to TT, and that seemed to silently become invalid on rare occasions. The fix is to use a bare pointer, which is a bad solution but works. While I can understand that the Handle or also the pointer gets invalid, what I do NOT understand is why this happens during the DQM booking phase (maybe also elsewhere, but definitely there) and only in one out of 6 plugins, that all run the same code. Maybe there is more to it. (The plugin in question is SiPixelPhase1RecHits, the symptom is that many histograms are not booked, and changing to pointers fixes it).\n- the other commits fix a crash on configurations with all MEs turned off and some cosmetic changes\n- finally there is a a fix for the issue reported by @slava77 today in #14586 . With this fix the given command does still crash, but it is no longer the Phase1 Pixel DQMs fault (I hope).\n- I have no idea how @mtosi 's commit ends up in this PR. It is totally unrelated. (Update: fixed by rebase & force push)\n", "branch": "CMSSW_8_1_X", "changed_files": 6, "closed_at": "1465625164", "comments": 19, "commits": 8, "created_at": "1464940950", "deletions": 27, "labels": ["comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "b132d1c88a0a24668442cb4f32c7c516654fdf8a", "merged_at": "1465625164", "merged_by": "cmsbuild", "milestone": "Next CMSSW_8_1_X", "number": 14760, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Phase1 Pixel DQM Bugfixes", "updated_at": "1465625164", "user": "schneiml"}