{"additions": 523, "auther_ref": "implementPacketLabels", "auther_sha": "2fe27214f5ab0eb0c028acd0248a215ad2203853", "author": "wddgit", "body": "#### PR description:\r\n\r\nImplement network packet labels. See issue #47517 for further discussion and the initial request for this feature. This PR will cause a CGI parameter to be appended to PFNs (Physical File Names) of the form\r\n\r\n```\"?scitag.flow=<scitag_id>\"```\r\n\r\nscitag_id  is a string that must be a number in the range 196612 to 196860. This is the range assigned to the CMS organization. Values outside that range are assigned to other organizations.\r\n\r\nThis only works with XRootD as that is the only protocol that has implemented this feature so far (other protocols ignore this and nothing is appended to the PFN). When the CGI parameter is present, XRootD includes packet labels in packets sent out over the network. This allows monitoring of network traffic and identifying network traffic from CMS.\r\n\r\nThis PR only implements the part of this that adds the CGI parameters to the PFNs. The responsibility for the rest of this monitoring system lies outside the Core software group.\r\n\r\nThe default values are:\r\n\r\n```\r\nPrimary input 196664\r\nProduction input 196656\r\nPreMixingModule 196704\r\nEmbedded input (mixing other than from the PreMixingModule) 196700\r\n```\r\n\r\nThe Workflow Management system must explicitly configure the value for Production using the new StorageProtocolConfigService.  The other 3 values will automatically be selected based on the type of input source used. It is possible to configure other values in the range assigned to CMS, although at present the plan is to use only those four values. (One of the open questions in the design discussions that seemed unresolved was whether we should allow configuration of those other values or block them entirely, either by throwing an exception or just ignoring them.)\r\n\r\nIf configured values are outside the range assigned to CMS (or the value is not a number), then nothing is added to the PFN, but no exception is thrown as this value is only for monitoring purposes (and we usually don't throw exceptions for monitoring problems). It is possible for a class using the InputFileCatalog to pass the Undefined enumeration value as an argument and then nothing is added to the PFN. Currently nothing does that. The default is the Primary value. If it is PreMixingModule, then PreMixedPileup is used. Any other type of source using EmbeddedRootSource will use the Embedded value.\r\n\r\nIf there is already a CGI tag appended to the PFN, the appended value starts with a \"&\" (standard CGI convention when there are multiple parameters).\r\n\r\nThe StorageProtocolConfigService was added to the list of default services in cmsRun. It will always run in any cmsRun job even if not configured.\r\n\r\nFWStorage/Services/test/test_storageProtocolConfig_cfg.py shows the proposed configuration of the service. I went with the simplest possible. It seemed to me each protocol should have its own independent ParameterSet and there is no reason to expect they should be the same. I expect later we will add more to this for configurable items that are not related to packet labels.\r\n\r\nThere was a lot of discussion about how to implement this feature and I don't  think it ever exactly converged.  I somewhat view this as a draft and am half expecting requests for changes. But it seemed to me we were at the point where having a concrete proposal would move the discussion forward.\r\n\r\nFYI @stlammel\r\n\r\nResolves https://github.com/cms-sw/framework-team/issues/1293\r\n\r\n#### PR validation:\r\n\r\nThere are new or extended unit tests to verify the proper strings are being appended to the PFN and that the new service is working.\r\n\r\n", "branch": "master", "changed_files": 21, "comments": 7, "commits": 1, "created_at": "1767801313", "deletions": 43, "labels": ["simulation-pending", "core-pending", "pending-signatures", "orp-pending", "tests-started", "code-checks-approved"], "milestone": "CMSSW_16_1_X", "number": 49740, "release-notes": [], "review_comments": 6, "state": "open", "title": "Implement network packet labels", "updated_at": "1767811031", "user": "wddgit"}