{"additions": 604, "auther_ref": "implementPacketLabels", "auther_sha": "723a0b71763afcd8e34e309acb6c03f0e52d4ae1", "author": "wddgit", "body": "#### PR description:\r\n\r\nImplement network packet labels. See issue #47517 for further discussion and the initial request for this feature. This PR will cause a CGI parameter to be appended to PFNs (Physical File Names) of the form\r\n\r\n```\"?scitag.flow=<scitag_id>\"```\r\n\r\nscitag_id  is a string that must be a number in the range 196612 to 196860. This is the range assigned to the CMS organization. Values outside that range are assigned to other organizations.\r\n\r\nThis only works with XRootD as that is the only protocol that has implemented this feature so far (for other protocols nothing is appended to the PFN). When the CGI parameter is present, XRootD includes packet labels in packets sent out over the network. This allows monitoring of network traffic and identifying network traffic from CMS.\r\n\r\nThis PR only implements the part of this that adds the CGI parameters to the PFNs. The responsibility for the rest of this monitoring system lies outside the Core software group.\r\n\r\nThe default values are:\r\n\r\n```\r\nPrimary input 196664\r\nProduction input 196656\r\nPreMixingModule 196704\r\nEmbedded input (mixing other than from the PreMixingModule) 196700\r\n```\r\n\r\nThe Framework will automatically know the type of source being used and this cannot be configured (Primary, Embedded, or Premixing), but the numerical values associated with those source types can be configured to different values.\r\n\r\nFor production use cases, the Workflow Management system must explicitly configure the value of the configuration parameter ```productionCase``` to true in the new new service named ```ScitagConfig```.  One can also configure the 3 values associated with the source type using the same service. The values for the analysis and production use cases can be configured independently.\r\n\r\nIf configured values are outside the range assigned to CMS then an exception will be thrown.\r\n\r\nIt is possible for a class using the InputFileCatalog to pass the ```Undefined``` enumeration value as an argument and then nothing is added to the PFN. Some utility executables and tests are modified to do that. In that case, nothing is appended to the PFN\r\n\r\nIf there is already a CGI tag appended to the PFN, the appended value starts with a \"&\" instead of \"?\" (standard CGI convention when there are multiple parameters).\r\n\r\nThe new ```ScitagConfig``` service was added to the list of default services in ```cmsRun```. It will always run in any cmsRun job even if not configured. Any other executable that uses ```InputFileCatalog``` will either need that service running or need to use the ```Undefined``` enum value in the ```InputFileCatalog``` constructor.\r\n\r\nThere is enable parameter in the new service that can be configured to turn this off which means nothing is appended to the PFNs and there is no packet labeling.\r\n\r\nFYI @stlammel\r\n\r\nResolves https://github.com/cms-sw/framework-team/issues/1293\r\n\r\n#### PR validation:\r\n\r\nThere are new or extended unit tests to verify the proper strings are being appended to the PFN and that the new service is working.\r\n\r\n", "branch": "master", "changed_files": 26, "comments": 28, "commits": 1, "created_at": "1767801313", "deletions": 50, "labels": ["simulation-pending", "core-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending"], "milestone": "CMSSW_16_1_X", "number": 49740, "release-notes": [], "review_comments": 37, "state": "open", "title": "Implement network packet labels", "updated_at": "1768599312", "user": "wddgit"}