{"additions": 0, "auther_ref": "removeGetManyByTypeSim", "auther_sha": "891e053f532912c59c5890f949aa95d1e822f7a4", "author": "wddgit", "body": "#### PR description:\r\n\r\nDelete module BoostTester\r\n\r\nThe primary motivation for this change is to delete uses of getManyByType so that we can delete the function getManyByType from the Framework without breaking compilation.\r\n\r\nThe Framework has been throwing an exception when getManyByType is called without a call to consumesMany since 2015. We've just finished a large migration where all code calling both consumesMany and getManyByType was replaced by GetterOfProducts or was removed in some other way. The function consumesMany has been deleted entirely from the Framework. The only uses of getManyByType that are left are the ones where consumeMany was not called. All these have been broken since 2015. The Framework will throw an exception if these calls to getManyByType are executed. \r\n\r\nAfter examining the code, it seemed the most appropriate thing was deleting this module. The module has been broken since 2015 and no one has bothered to fix it. It doesn't contain anything that looks to me useful or worth saving. Nothing in CMSSW references this module. It is only test code. It hasn't been substantively edited in years.\r\n\r\nThere are two alternatives I can think of:\r\n\r\nI could comment out the call to getManyByType and replace it with an immediate exception throw. (The current behavior of the getByManyType function in the Framework is to always throw an exception).\r\n\r\nIf we really need this module, we could upgrade it to use GetterOfProducts. This seems unlikely, because it has been broken for so many years already.  It doesn't seem worth the effort. And there is value to deleting code that is old, broken, and dead. Less maintenance and faster builds using less resources.\r\n\r\nIf you want me to implement one of the alternatives, ask and I will do that instead.\r\n\r\n#### PR validation:\r\n\r\nNothing uses this code and it is already broken. There is nothing to test.\r\n", "branch": "master", "changed_files": 3, "closed_at": "1689438643", "comments": 7, "commits": 1, "created_at": "1689363330", "deletions": 117, "labels": ["simulation-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "b6b45c0077cede3be2969904f36c77a84af7f22e", "merged_at": "1689438643", "merged_by": "cmsbuild", "milestone": "CMSSW_13_2_X", "number": 42272, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Delete module BoostTester", "updated_at": "1689438643", "user": "wddgit"}