{"additions": 1942, "auther_ref": "GEMCSCEmulators", "auther_sha": "7c2500416bb530e21e19bcd305c80cd1339ba37d", "author": "giovanni-mocellin", "body": "#### PR description:\r\n\r\nThis PR introduces major changes in the L1 trigger primitive emulators for GEM and GEM-CSC, plus some minor changes for CSC for Run-3 mode. In addition, it ensures the full compatibility of unpackers and emulators to the b904 lab test setups, utilized during the SW and FW validation.\r\n\r\nChanges for GEM trigger primitive emulator:\r\n  - GEM unpacker modified to add compatibility with GEM chambers in b904 lab setup mapping: added new file and corresponding tags in test python config script, specified correct FED ID numbers for it\r\n  - GEM trigger primitive emulator streamlined, with specific GE1/1 and GE2/1 parameters. Less mishmash between different chamber types: easier maintainability and flexibility\r\n  - Updated to latest FW version, which includes: 4 clustering partitions (2 eta partitions each), and a maximum of 4 clusters built per clustering partition. Kept the maximum of 8 clusters selected and sent per chamber, and the maximum cluster size of 8 pads\r\n\r\nChanges for CSC trigger primitive emulator:\r\n  - CSC unpacker modified to add compatibility with CSC chambers in b904 lab setup mapping. Manual flags added to specify the type of chamber in use: B904ME11PositiveEndcap, B904ME11NegativeEndcap, B904ME234s2\r\n  - CSC unpacker modified to add printouts (commented out by default)\r\n  - Added new flag for run-3 CSC trigger primitive run3. It regulates the primitive quality data format. Earlier the quality format was linked to the CCLUT algorithm activation, now its independent. Needed for CSC outer rings, where CCLUT algorithm is not implemented (and will not be implemented) in FW, but the quality assignment follows run-3 format\r\n  - CSC CLCT ordering between first and second has been updated to the one implemented in FW: first sort by quality, then by pattern, and finally by half strip number\r\n\r\nChanges for GEM-CSC trigger primitive emulator:\r\n  - Updated names and paths for GEM-CSC LUT files stored in cms-data (dedicated parallel PR done, more comments below in NOTE 1)\r\n  - Modified the BX assigned to GEM trigger primitives readout through CSC DAQ: before it was referenced to CLCTs, now it is referenced to ALCTs. Thus, the time assignment takes into consideration the variable alctMatchTime. This entailed a modification to the CSC unpacker and packer\r\n  - CSC unpacker modified to add compatibility with GEM chambers in b904 lab setup mapping. Manual flags added to specify the type of chamber in use: B904GE11Long, B904GE11Short\r\n  - Major update to the GEM-CSC trigger primitive matching algorithm. A few more details below in NOTE 2\r\n\r\nNOTE 1)\r\nThis PR is intrinsically linked to the PR #13 to [L1Trigger-CSCTriggerPrimitives](https://github.com/cms-data/L1Trigger-CSCTriggerPrimitives), which updates the lookup tables for the GEM-CSC trigger to the ones currently used in FW\r\n\r\nNOTE 2)\r\nUpdate to the GEM-CSC trigger primitive matching algorithm. Before it reflected an old concept of FW implementation, now it adheres completely to the FW implemented and deployed\r\nA few notable changes:\r\n  - Full independence of GEM-CSC and CSC-only emulators + streamlined GEM-CSC emulator implementation: much easier maintainability now\r\n  - Added dedicated matching algorithms for the two GEM chamber layers\r\n  - GEM primitives matching windows are updated to final applied values\r\n  - GEM primitives matching in time is ALCT-centric. Selected GEM BX is the closest to CSC ALCT BX in which a GEM hit is found. Using same GEM-CSC BX difference preferences as in FW\r\n  - CSC CLCT propagation to GEM (via LUTs) is the default matching algorithm\r\n  - CSC LCT slope and run2pattern are amended by GEM trigger primitive position wrt CSC trigger primitive position by default\r\n  - Update of quality assignment: swapped quality assignment between CLCT-2GEM and ALCT-2GEM, to conform to FW\r\n\r\nNOTE 3)\r\nIn agreement with EMTF experts (@eyigitba), the flags that control the run-3 algorithms in CSC (and EMTF) have been kept off for this PR. Another PR (or a new commit) will come within a few days to abilitate the necessary flags. Since the PR includes changes in the run-3 algorithms, the tests were performed turning on such flags.\r\n\r\n#### PR validation:\r\n\r\nThe code has been tested and validated by re-emulating b904 lab and P5 data taken during the FW commissioning phase. Plots of comparisons between re-emulation and data show very good agreement. A couple of re-emulation files for a GE1/1-ME1/1 run in b904 and a ME4/2 run in b904 have been attached to this PR.\r\n[ReEmuFiles.zip](https://github.com/cms-sw/cmssw/files/8906912/ReEmuFiles.zip)\r\n\r\nNote: the tests were done with run-3 flags activated, in order to verify the proper functioning of the implemented algorithms. As described before, now these flags have been turned off, and will be turned on in a second PR (or new commit), to come within a few days.", "branch": "master", "changed_files": 50, "comments": 10, "commits": 61, "created_at": "1655276421", "deletions": 1913, "labels": ["reconstruction-pending", "simulation-pending", "dqm-pending", "l1-pending", "alca-pending", "db-pending", "pending-signatures", "tests-pending", "orp-pending", "upgrade-pending", "requires-external", "code-checks-approved"], "milestone": "CMSSW_12_5_X", "number": 38373, "release-notes": [], "review_comments": 2, "state": "open", "title": "Update of GEM & CSC trigger primitive emulators", "updated_at": "1655283151", "user": "giovanni-mocellin"}