{"additions": 125, "auther_ref": "cicadaL1Addition", "auther_sha": "0fad9ab2c171a94c9980403089d8062cc1836aee", "author": "aloeliger", "body": "### PR description:\r\n\r\nThis PR introduces the CaloSummary (CICADA) emualtion into L1 standard sequences by adding it to the L1TCalorimeter `simDigis` task. This is being done in preparation of integrating CICADA into the uGT (and uGT emulator) and in preparation for menu studies next year.\r\n\r\nIn addition, basic L1Ntuples infrastructure for looking at CICADA input and output have been added to the L1Ntuples as an emulator tree, taking by default it's input from the CaloL1Emulation, and the CICADA output by default from the CICADA emulation. Later, if desired, an non-emulator version of this tree could be run off an unpacked CICADA score and genuine tower regions in the raw data.\r\n\r\nSome more slight tidying of the CaloSummary emulator has been down to remove ambiguity from other anomaly detection techniques by renaming variables/outputs from \"anomaly\" to \"CICADA\".\r\n\r\n### PR validation:\r\n\r\nAll code compiles, passes tests, and has had code formatting applied. In addition, the addition of the CaloSummary to standard Sequences has been tested by running the standard L1 sequences `L1TReEmulFromRAW` (from `L1Trigger/Configuration/customiseReEmul`) and then the Ntuplization sequence `L1NtupleRAWEMU` (from `L1Trigger/L1TNtuples/customiseL1Ntuple`) on a file with RAW info available. This ran successfully, and an Ntuple with sensible information was produced.\r\n\r\n### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport and a backport will only be needed if L1/HLT trigger studies are performed on an earlier version of the emulator.\r\n", "branch": "master", "changed_files": 8, "comments": 1, "commits": 4, "created_at": "1698240852", "deletions": 5, "labels": ["l1-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-rejected"], "milestone": "CMSSW_13_3_X", "number": 43114, "release-notes": [], "review_comments": 0, "state": "open", "title": "Addition of CaloSummary (CICADA) to L1 Emulation Sequences and Ntuples", "updated_at": "1698241243", "user": "aloeliger"}