{"additions": 9, "auther_ref": "restore-namespace-names", "auther_sha": "1d04b300749bcf0cc90650b9ac31c0c11b7395e2", "author": "cvuosalo", "body": "In the old DD, all names of geometry components (other than SpecPars) included the namespace. That feature promoted uniqueness of names. With DD4hep, most names still contain the namespace, but a small minority do not. Nonetheless, most of these names still are unique. Without this PR, there are a handful of names which show duplication. Internally, this duplication is not a problem because ROOT implicitly appends a hex address to all names to make them unique, but the human-readable portion of the name might show duplication.\r\n\r\nA PR that will be submitted very soon will propose a tool for creating the simulation geometry DB payload with DD4hep. This payload will not be readable if it contains duplicate names for different components (e.g., two different solids with the same name). To prevent this duplication, the namespace needs to be restored to a handful of component names, making them match exactly their names in the old DD and preventing duplication.\r\n\r\nIn addition, a small typo was discovered in `Geometry/TrackerCommonData/plugins/dd4hep/DDCutTubsFromPoints.cc`. Fixing the typo restores the code to match the old DD and also restores the names of the solids affected to exactly match the old DD.  See the doc below and my note on the file page for more details.\r\n\r\nThis Google doc shows the names in detail and how they change with this PR:\r\nhttps://docs.google.com/document/d/1kNMv9FWSRcfM_FUjzrFzNH5igZhW62ZwjYNIj98zaSM/edit?usp=sharing\r\n\r\nNote: This PR clarifies several names but **does not actually change the geometry.**\r\n\r\n#### PR validation:\r\n\r\nThe solids affected by this PR were checked to see that their parameters were exactly the same before and after the PR, and also that, after this PR, the DD4hep solids exactly match those in the old DD.\r\n\r\nCode searches were performed to see if the names affected by this PR are referred to anywhere else in the code. They are not. Also, the clarifications in this PR should be safe because the names are being restored to match the old DD.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nA backport is probably not necessary since this PR only clarifies several names.", "branch": "master", "changed_files": 2, "closed_at": "1623651504", "comments": 8, "commits": 2, "created_at": "1623620526", "deletions": 5, "labels": ["code-checks-approved", "fully-signed", "geometry-approved", "orp-approved", "tests-approved"], "merge_commit_sha": "d2df48292bfb7bd13366ebd757884b1e28ee89f5", "merged_at": "1623651504", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 34109, "release-notes": [], "review_comments": 4, "state": "closed", "title": "[DD4hep] Name clarification: Restore namespace to several names to enable reading sim geo DB payload", "updated_at": "1623651504", "user": "cvuosalo"}