{"additions": 647, "auther_ref": "4dvtx_tofpid_10_5_X", "auther_sha": "bbff806ecce37866030b7916df5a80d7cf68fa77", "author": "bendavid", "body": "(master version of https://github.com/cms-sw/cmssw/pull/25627)\r\nImplements changes needed to propagate full simulation and reconstruction based track timestamps to 4D vertex reconstruction and particle flow.\r\n(Previously this was already implemented and running based on the fastsim timestamps used for the MTD Technical Proposal)\r\n\r\nThe following strategy is used to deal with particles moving slower than the speed of light:\r\n\r\nExisting timestamps from the TrackExtender assume the pion mass hypothesis when propagating the MTD cluster time back to the beamline. The valuemaps produced at this step have been extended to provide some additional information in a more convenient form. (Time at MTD, momentum magnitude of refitted track, etc)  As well the uncertainty is inflated by adding in quadrature the time of flight difference between the pion and proton mass hypothesis for each track.\r\n\r\nFirst pass of 4D vertex reconstruction runs on the output as above. After a bugfix/protection, combined with the inflated uncertainties it is able to deal with the resulting outliers from slower kaons/protons in a reasonable way.\r\n\r\nAdditional TOFPIDProducer which tests compatibility of kaon and proton mass hypotheses for the tracks with the 4D vertices from 2) and produces updated timestamps where appropriate. This producer also creates value maps of particle ID probabilities which can be used downstream.\r\n\r\nSecond pass of 4D vertex reconstruction based on the refined timestamps from 3)\r\n\r\nThis pull request also migrates the PFCandidate timestamps to the fullsim/reconstruction ones (previously populated from the fastsim). This automatically propagates to the packed candidates in MINIAOD as well.\r\n\r\nAn additional collection of slimmed primary vertices with timing is added to MINIAOD, but the PackedCandidate-vertex association, puppi, etc are still based on the default primary vertices without timing.\r\n\r\nIn order to facilitate comparisons and benchmarking, the fastsim-based timestamps and 4d vertex reco is still run and stored. This is especially relevant since direct comparisons may validate the continued use of existing/fastsim-based results where fullsim-based ones are not yet available.\r\n\r\nSome discussion and validation/performance plots in https://indico.cern.ch/event/783100/contributions/3273442/attachments/1780769/2896933/mtdvtxJan17-2019.pdf\r\n\r\n\r\n\r\n@pmeridian @lgray ", "branch": "master", "changed_files": 16, "comments": 91, "commits": 27, "created_at": "1547225263", "deletions": 103, "labels": ["analysis-pending", "code-checks-approved", "comparison-available", "dqm-pending", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-approved", "upgrade-approved"], "milestone": "CMSSW_10_5_X", "number": 25628, "release-notes": [], "review_comments": 50, "state": "open", "title": "Migrate 4D vertexing and downstream reco to full simulation/reconstruction track timestamps and add TOF PID (10_5_X)", "updated_at": "1548088295", "user": "bendavid"}