{"additions": 55, "auther_ref": "devel_1130pre4_pixelVertexTrimmer", "auther_sha": "df509f6dd03b5be654a94322a17487e034bd3b36", "author": "missirol", "body": "#### PR description:\r\n\r\nThis PR is meant to improve the implementation of the plugin `PixelVertexCollectionTrimmer`.\r\n\r\nThis plugin is used at HLT to select a subset of pixel vertices, based on their Sum-Pt2 score.\r\n\r\nIn its current form, the plugin implicitly assumes that the input collection of vertices is already sorted according to the same sorting criterion used in `PixelVertexCollectionTrimmer` itself ([the 1st entry of the input collection is assumed to have the highest f.o.m.](https://github.com/cms-sw/cmssw/blob/4adab384c347d9ba6d86978f905bb65c0e4743ab/RecoPixelVertexing/PixelVertexFinding/plugins/PixelVertexCollectionTrimmer.cc#L104)).\r\n\r\nThe main update in this PR is to remove this assumption on the ordering of the inputs.\r\n\r\nWhile said assumption was valid in the past (e.g. Run-2 HLT), it might not be valid in the future; for example, the pixel vertices in the Patatrack workflow use a sorting criterion which is slightly different from the \"legacy\" pixel vertices (the trimmer still uses the same sorting criterion as the legacy pixel vertices).\r\n\r\nMore details can be found in https://github.com/cms-patatrack/cmssw/issues/605.\r\n\r\nAs suggested by @AdrianoDee (TRK POG), I'm opening a PR here, so that experts can review it.\r\n\r\n----\r\n\r\nOn a technical level, these updates would introduce two small changes in the producer:\r\n\r\n* in the PR, the output collection is sorted according to the sorter in `PixelVertexCollectionTrimmer` (currently, the trimming is applied, but there is no re-sorting, and the ordering of the outputs is the same as the inputs);\r\n\r\n* the current impl uses [`sumpt2 > minSumPt2_`](https://github.com/cms-sw/cmssw/blob/4adab384c347d9ba6d86978f905bb65c0e4743ab/RecoPixelVertexing/PixelVertexFinding/plugins/PixelVertexCollectionTrimmer.cc#L112); in the impl in the PR, this is effectively changed to `sumpt2 >= minSumPt2_`.\r\n\r\n----\r\n\r\nHere are 3 (possibly alternative) ways to maybe improve things further, for experts to consider:\r\n\r\n* adding a data member to `reco::Vertex` to save the Sum-Pt2 score, such that it would not have to be recomputed a posteriori in other modules (having to make sure different modules use the same sorting criterion);\r\n\r\n* generalizing the implementation of `PVClusterComparer` (the legacy sorter, used in the trimmer) such that it can be configured to give the legacy sorting, or the Patatrack sorting, depending on what is needed;\r\n\r\n* making `PixelVertexCollectionTrimmer` capable of using different sorting functions, rather than just `PVClusterComparer`.\r\n\r\n---\r\n\r\n#### PR validation:\r\n\r\nPrivate tests to verify that the changes work as intended.\r\n\r\nRunning the updated plugin on 100 events (Run-3 DY MC with PU) suggests that its timing remains very small (<0.1ms).\r\n\r\n#### If this PR is a backport, please specify the original PR and why you need to backport that PR:\r\n\r\nN/A (no backport planned)", "branch": "master", "changed_files": 1, "closed_at": "1615470085", "comments": 29, "commits": 5, "created_at": "1615111235", "deletions": 85, "labels": ["code-checks-approved", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "bf18a63c29ea3ba60f032dd20c39add6de2ceb1e", "merged_at": "1615470085", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 33091, "release-notes": [], "review_comments": 18, "state": "closed", "title": "improving PixelVertexCollectionTrimmer", "updated_at": "1615470085", "user": "missirol"}