{"additions": 896, "auther_ref": "genStatusFlags", "auther_sha": "00937d12bfabfc5964ed87232825a84b188a6f95", "author": "bendavid", "body": "Adds status flags which fold useful information about particle status+history into a simplified set of persistent flags which can be used at analysis level and which are less generator dependent.\n\nUse of flags related to the hard process is still discouraged unless absolutely needed.  More robust prompt/non-prompt/from tau decay type flags are provided and preferred.\n\nPreferred flag for matching to prompt leptons/photons at generator level:\nisPromptFinalState()\nThis encompasses any final state particle which is NOT from a hadron, muon, or tau decay.  Practically this means that for charged leptons they either came from the hard process or from (rare) internal conversions of radiated photons.  For photons this flag is a bit more encompassing since it includes all ISR/FSR photons as well as those strictly from the hard process (ie hard matrix element).\n\nHard process related flags are currently only implemented for pythia6 and pythia8.\n\nisHardProcess() is the closest to pythia6 status 3, but does NOT in general represent final state kinematics and should NOT be used directly for matching to reco objects.  If matching to reco objects is needed and the hard process matching is strictly required, then fromHardProcessFinalState() can be used.\n\nNote that tau decay products must be treated with dedicated flags.\nMore details in accessor comments\nhttps://github.com/bendavid/cmssw/blob/73d2957327d2b844c439b9e89889d52c6f4bd420/DataFormats/HepMCCandidate/interface/GenParticle.h\nhttps://github.com/bendavid/cmssw/blob/73d2957327d2b844c439b9e89889d52c6f4bd420/DataFormats/HepMCCandidate/interface/GenStatusFlags.h\n\nThese flags are currently computed and stored in the GenParticle at GEN-SIM or DIGI-RECO time and are propagated to the prunedGenParticles in the miniaod (but they could be easily recomputed when producing the prunedGenParticles in a future miniaod reprocessing if needed).\n\nSince the flags are persistent and do not rely on any mother-daughter links once stored, potentially the number of intermediate particles in the prunedGenParticles might be possible to reduce.\n\nTo be discussed whether these flags should also be added to the packedGenParticles.\n(13 bits but only ~10 allowed values, so should compress extremely well)\n\nAutomatically ported from CMSSW_7_4_X #7662\n", "branch": "CMSSW_7_5_X", "changed_files": 18, "closed_at": "1424876303", "comments": 6, "commits": 12, "created_at": "1424173194", "deletions": 15, "labels": ["analysis-pending", "comparison-available", "core-pending", "generators-pending", "orp-pending", "pending-signatures", "tests-rejected"], "merge_commit_sha": "edd9679b95c55c2cfe260330dad406a525823f89", "merged_at": "1424876303", "merged_by": "davidlange6", "milestone": "CMSSW_7_5_X", "number": 7791, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Add status flags to GenParticles as analysis aid", "updated_at": "1424876537", "user": "cmsbuild"}