{"additions": 184, "auther_ref": "p2gt-ar25", "auther_sha": "a6b0ff16a2c0ab8eb86f26bdf304bffe0457219f", "author": "RobertJWard", "body": "#### PR description:\r\n\r\nThis PR updates the Phase-2 Global Trigger Emulator step-1 menu to use the latest online-to-offline scalings from [L1T annual review 2025](https://indico.cern.ch/event/1516922/#4-algorithms-physics-performan), derived with the [standalone menu tools](https://github.com/cms-l1-dpg/Phase2-L1MenuTools) using CMSSW_15_1_0_pre4, as well as the latest object IDs from the review. In particular the ID changes are to apply tight electron ID in the endcap for all pTs both for TkElectron and TkIsoElectron, and to correct the bit used for photon ID for TkIsoPhoton. The scalings for the forward region, relevant for seeded cone jets, have also been separated into two bins to separate the HGC and HF segments of the detector. \r\n\r\nIn addition to the AR25-specific changes, some additional updates have been implemented:\r\n- Handling of standalone EG triggers have been updated to use TkPhoton instead of TkIsoPhoton, and to use the L1EG scalings\r\n- PT thresholds in TkEleTkMuon10_20 and DoubleTkMuon_4p5_4p5_OS_Er2_Mass7to18 were incorrect and have been fixed\r\n\r\n#### PR validation:\r\n\r\nThe trigger rates from the menu and the P2GT emulator results are directly compared in the attached plot below, where the same online-to-offline scalings are used in each case. Some discrepancies remain in specific seeds but these require further discussion and are out of scope of this PR. These are discrepancies are independent of the AR25 scalings and IDs, and this PR is already significant improvement on the current P2GT vs standalone tools.\r\n\r\n<img width=\"1710\" height=\"1157\" alt=\"image\" src=\"https://github.com/user-attachments/assets/614ee6ff-a544-486c-8b60-8b01a5b73566\" />\r\n", "branch": "master", "changed_files": 7, "comments": 8, "commits": 8, "created_at": "1756294768", "deletions": 114, "labels": ["l1-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_16_0_X", "number": 48813, "release-notes": [], "review_comments": 0, "state": "open", "title": "[L1T] Update P2GT Emulator with latest IDs and Scalings from Annual Review 2025 (Phase 2)", "updated_at": "1758285627", "user": "RobertJWard"}