{"additions": 173, "auther_ref": "p2gt-ar25", "auther_sha": "153a3cc922b382dd2456834d3c070a3a777de08c", "author": "RobertJWard", "body": "#### PR description:\r\n\r\nThis PR updates the Phase-2 Global Trigger Emulator step-1 menu to use the latest online-to-offline scalings from [L1T annual review 2025](https://indico.cern.ch/event/1516922/#4-algorithms-physics-performan), derived with the [standalone menu tools](https://github.com/cms-l1-dpg/Phase2-L1MenuTools) using CMSSW_15_1_0_pre4, as well as the latest object IDs from the review. In particular the ID changes are to apply tight electron ID in the endcap for all pTs both for TkElectron and TkIsoElectron, and to correct the bit used for photon ID for TkIsoPhoton. The scalings for the forward region, relevant for seeded cone jets, have also been separated into two bins to separate the HGC and HF segments of the detector.\r\n\r\n#### PR validation:\r\n\r\nThe trigger rates from the menu and the P2GT emulator results are directly compared in the attached plot below, where the same online-to-offline scalings are used in each case. Some discrepancies remain that need further investigation, in particular for standalone EG triggers and triggers with R,  and invariant mass calculations, but this may be more appropriate for a follow up PR, as these are discrepancies that also existed previously, and are independent of the AR25 scalings and IDs. The rates for the single TkElectron, single TkIsoElectron, and single TkIsoPhoton triggers whose IDs have been updated are identical.\r\n\r\n<img width=\"1698\" height=\"1157\" alt=\"image\" src=\"https://github.com/user-attachments/assets/0ca7ab23-30ba-4aa2-9792-41d12d2b2c05\" />", "branch": "master", "changed_files": 4, "comments": 3, "commits": 6, "created_at": "1756294768", "deletions": 104, "labels": ["l1-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_15_1_X", "number": 48813, "release-notes": [], "review_comments": 0, "state": "open", "title": "Draft: [L1T] Update P2GT Emulator with latest IDs and Scalings from Annual Review 2025 (Phase 2)", "updated_at": "1756294918", "user": "RobertJWard"}