{"additions": 948, "auther_ref": "exo_regional_step_pr", "auther_sha": "dfca8c3423b5b0b674ef7f6b48a21fad24ab40ea", "author": "aehart", "body": "#### PR description:\r\n\r\nThis is a reprisal of #32806, and was discussed recently in the TRK POG meeting:\r\nhttps://indico.cern.ch/event/1232392/#3-update-on-ml-seeded-displace\r\n\r\nThis PR introduces a new tracking iteration for Run 3, called the displacedRegionalStep, based on ROIs targeting exotic physics scenarios. The ROIs are formed from tracks found by existing iterations, and they are tagged with an MVA that helps to reduce the CPU time. The tagged ROIs are used as tracking regions for the new iteration.\r\n\r\nSince the previous PR, I have updated RecoTracker/IterativeTracking/python/DisplacedRegionalStep_cff.py with changes made to TobTecStep_cff.py, which it was originally based on. There are further studies/optimizations to explore, but the iteration, as a process modifier, should be ready for integration now.\r\n\r\n#### PR validation:\r\n\r\nI re-ran the tracking, both without and with the new iteration, on a sample of HSSbbbb signal events that we used previously, where S is a long-lived scalar with a mass of 40 GeV and lifetime of 500 mm/c. The below plots are the resulting efficiencies vs. dxy. On the left is what was obtained previously, when #32806 was submitted, and the right plot is what we get now. Although the shapes of the efficiencies have changed significantly, the effect of the new iteration is qualitatively the same and even greater in magnitude, showing that it still behaves as expected.\r\n\r\n![eff_vs_dxy](https://user-images.githubusercontent.com/5114977/215625182-5594ea88-8d8a-47af-845b-1914c9295005.png)", "branch": "master", "changed_files": 31, "comments": 26, "commits": 19, "created_at": "1675120701", "deletions": 35, "labels": ["reconstruction-pending", "dqm-pending", "operations-pending", "pending-signatures", "tests-rejected", "orp-pending", "pdmv-pending", "upgrade-pending", "code-checks-approved", "tracking"], "milestone": "CMSSW_13_0_X", "number": 40643, "release-notes": [], "review_comments": 36, "state": "open", "title": "Displaced regional tracking iteration", "updated_at": "1676078345", "user": "aehart"}