{"additions": 2230, "auther_ref": "pfRecHitProducerAlpaka", "auther_sha": "40ed38b82330af3e012679723555174c143bc7ab", "author": "fllor", "body": "#### PR description:\r\n\r\nThis pull-request is the first step towards making the ParticleFlow algorithm portable and heterogeneous using Alpaka. It adds a PFRecHitSoA data format and a producer that constructs it. The module can process HCAL and ECAL hits and runs on the CPU and CUDA backends of Alpaka. The ROCm backend compiles, but is untested.\r\nSince calorimeter reconstruction is not available using Alpaka yet, this PR also introduces a CaloRecHitSoA format and a producer that converts calorimeter hits from the CPU modules to the SoA. This format and producer will become obsolete, when then HCAL/ECAL groups directly provide their own SoA formats.\r\nA producer that converts to new PFRecHitSoA format back to the existing PFRecHit collection format is included. It can be used for validation and to run down-stream modules, until they are adapted to the SoA themselves.\r\nThis PR does not alter any existing workflow in any way. The Alpaka module is provided but not executed for HLT reconstruction. For now, it can be used for testing and for down-stream development. The transition from the CPU implementation to Alpaka is intended to happen later, when an Alpaka implementation of the PFClusterProducer is also available.\r\n\r\n#### PR validation:\r\n\r\nExtensive validation of the Alpaka implementation is provided, see commit message of e3a6018f0e8f209741533325c6311732ebf77a25.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis is not a backport.\r\n\r\n@hatakeyamak @jsamudio", "branch": "master", "changed_files": 46, "comments": 8, "commits": 13, "created_at": "1695025680", "deletions": 120, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved", "heterogeneous-pending", "pf"], "milestone": "CMSSW_13_3_X", "number": 42807, "release-notes": [], "review_comments": 42, "state": "open", "title": "Add Alpaka implementation of PFRecHitProducer", "updated_at": "1695831309", "user": "fllor"}