{"additions": 468, "auther_ref": "CICADA_uGT_Emulator", "auther_sha": "6b446cc8987ed50785b891cc5f8de43fe6627919", "author": "aloeliger", "body": "### PR description:\r\n\r\nThis PR adds the uGT half of the CICADA -> uGT emulator chain. It adds all the pieces needed to parse and compare the new CICADA condition added in uTM v 0.12.0. This is being opened in draft because no unpacker/packer combo is available yet, but will be added after I have had the chance to speak to experts about reading the CICADA record.\r\n\r\nDepends on utm version 0.12.0\r\n\r\n@elfontan You should likely take a look at my work on this, this is more working with uGT than I am used to.\r\n\r\n@cms-sw/hlt-l2 Just in case you aren't automatically pinged on this, FYI. There is no unpacker/packer, but I will keep this in draft while I develop them. I will be speak to experts about it ASAP.\r\n\r\n### PR validation:\r\n\r\nAll code compiles and has had code formatting applied.\r\n\r\nIn addition, I have tested the emulator on a new proto-type menu including a CICADA seed:\r\nhttps://cernbox.cern.ch/files/link/public/LeBbgndwFDjWoI5?tiles-size=1&items-per-page=100&view-mode=resource-table\r\n\r\nThe emulator runs all the way through. The following are debug statements (now removed) from various components of the global board, CICADA conditions, and trigger menu parser showing that the emulator receives the score, compares to the menu, and in this case, decides it is below threshold and doesn't pass the menu cut:\r\n\r\n```\r\nBegin processing the 2nd record. Run 368566, Event 2615907242, LumiSection 1195 on stream 0 at 27-Feb-2024 08:34:54.517 CST\r\nGlobalBoard::receiveCaloObjectData receive cicada\r\nValid CICADA\r\n2.73438\r\nGlobalBoard::runGTL CondCICADA\r\nCICADACondition::evaluationCondition begin\r\ncicada score is: 2.73438\r\nmin threshold is: 42\r\npassCondition? 0\r\n```\r\n\r\n### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport however, is likely to be needed for data-taking so a backport is probable to CMSSW_14_0.", "branch": "master", "changed_files": 23, "comments": 4, "commits": 2, "created_at": "1709044407", "deletions": 4, "labels": ["l1-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-rejected"], "milestone": "CMSSW_14_1_X", "number": 44222, "release-notes": [], "review_comments": 0, "state": "open", "title": "CICADA-uGT emulator additions", "updated_at": "1709734111", "user": "aloeliger"}