{"additions": 1002, "auther_ref": "BDHadronTrackMonitoringDQM_90X", "auther_sha": "e2a6c77722a45f2357c50fddb2a44038229c260e", "author": "smoortga", "body": "This PR contains currently a standalone version of a DQM tool to monitor track properties of tracks from B and D hadron decays (or more generally bottom and charmed hadron decays).\r\nThis information is needed by the BTV POG to monitor any possible effects on b-tagging (and c-tagging) performance.\r\n\r\nWe would like to add this to the standard DQM sequence for release validation to be able to compare between pre-releases.\r\n\r\nNote 1: As already discussed over e-mail, this code should be ran over a TTbar RECODEBUG sample, since it uses track history information (TrackingParticles). Therefore a small TTbar RECODEBUG sample should be produced for every new release on which this code will be ran. Previous tests have shown that it would already be sufficient to run over only 1000 events. I was told this was something that should be looked into by the PDMV group.\r\n\r\nNote 2: I have no previous experience in DQM code, but I managed to run my code in a standalone way (first the Analyzer, then the Harvester) and produce the required output histograms. You can see my standalone test configuration in:\r\nAnalyzer:  Validation/RecoB/test/test_BDHadronTrackMonitoringAnalyzer_cfg.py\r\nHarvester:  Validation/RecoB/test/test_BDHadronTrackMonitoringHarvester_cfg.py\r\nAs you can see I require PAT to be ran (I use PF2PAT followed by switchJetCollection, which follows as close as possible the code used by the BTV POG to make testing ntuples, called the BTagAnalyzer). I just mention this since this might not be the usual procedure in DQM applications.\r\n\r\nI am looking forward to your feedback on how to proceed in order to finally get this tool included in the standard DQM sequence.\r\n\r\n@imarches, @JyothsnaKomaragiri, @mverzett you might want to follow this discussion as well.\r\n\r\nThanks,\r\nCheers,\r\nSeth Moortgat", "branch": "CMSSW_9_0_X", "changed_files": 9, "closed_at": "1488125449", "comments": 26, "commits": 3, "created_at": "1486475504", "deletions": 0, "labels": ["comparison-available", "dqm-pending", "orp-pending", "pending-signatures", "tests-approved"], "merge_commit_sha": "b31d01960090e98b4f3337c5ae626801e19af0bf", "merged_at": "1488125449", "merged_by": "davidlange6", "milestone": "CMSSW_9_0_X", "number": 17444, "release-notes": [], "review_comments": 5, "state": "closed", "title": "B/D hadron track monitoring for offline DQM", "updated_at": "1488125449", "user": "smoortga"}