{"additions": 427, "auther_ref": "PixelClusterTagInfo", "auther_sha": "83310006eeccb09e2cf84320057013ce29ce83a9", "author": "zucchett", "body": "#### PR description:\r\n\r\nThis pull request defines a new TagInfo object (PixelClusterTagInfo), produced from the RECO format starting from the siPixelCluster collection, propagated to AOD, and embedded in miniAOD. The TagInfo contains a very compressed information of the pixel clusters geometrically matched to an AK4 jet, consisting of a char for each 4 pixel layers times 6 jet-cluster association cones, plus four unsigned integers for the collected charge. This information is added only to jets with pT > 100 GeV, and is critical for novel studies of b-tagging at high pT without relying on tracks, whose reconstruction efficiency decreases in very energetic jets. The pixel cluster information can be provided to a standalone tagger or (in the future) integrated in combined b-tagging algorithms. Preliminary studies performed on very limited samples estimate that a pixel-based tagger provides a better performance than the DeepCSV for jet pT > 1.2 TeV.\r\n\r\nLatest presentations:\r\nhttps://indico.cern.ch/event/828712/contributions/3468910/attachments/1869375/3075401/Sommerhalder_Zucchetta.pdf\r\nhttps://indico.cern.ch/event/830302/contributions/3483708/attachments/1871179/3079451/190628_Zucchetta.pdf\r\nhttps://indico.cern.ch/event/833434/contributions/3495708/attachments/1877898/3093199/190710_Zucchetta.pdf\r\n\r\n#### PR validation:\r\n\r\nThe basic checks have been successfully run (code-checks, runTheMatrix). The only exception is represented by two jobs in runTheMatrix that run on already-produced AOD (136.7611* and 136.8311*) that fail because the needed collections are not found. This is understandable because neither the basic siPixelCluster nor the pixelClusterTagInfo collections are present in AODs by default; the latter collection is added to AODs with this PR.\r\nEDIT: Era modifiers have been introduced to exclude pixelClusterTagInfos from 80X and 94X miniAOD productions, avoiding the crash.\r\n\r\n\r\n@msommerh as developer, and BTV conveners @mverzett , @kskovpen, @XavierAtCERN, @smoortga are also involved and interested in these developments.\r\n", "branch": "master", "changed_files": 14, "closed_at": "1567191771", "comments": 102, "commits": 76, "created_at": "1565347953", "deletions": 5, "labels": ["analysis-approved", "code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "29e0d7fa234c6927d2d636af4cab1fd90f227104", "merged_at": "1567191771", "merged_by": "cmsbuild", "milestone": "CMSSW_11_0_X", "number": 27738, "release-notes": [], "review_comments": 106, "state": "closed", "title": "Addition of pixelClusterTagInfos to AOD and miniAOD", "updated_at": "1567191771", "user": "zucchett"}