{"additions": 91, "auther_ref": "switchToErasAndWarn", "auther_sha": "f1cf99d3c593a0860fd452a371b46c7aa1a18762", "author": "mark-grimes", "body": "This changes runTheMatrix tests to use `--era Run2_25ns` instead of `--customise SLHCUpgradeSimulations/Configuration/postLS1Customs.customisePostLS1` (and the 50 ns and HI equivalents).\n\nThe two forms of configuration should be functionally identical.  For various reasons there are expected differences if doing simple `diff` on dumps of the configuration files.  I've been running periodic checks to make sure the two forms haven't diverged, results are at:\n\nhttp://grimes.web.cern.ch/grimes/eraProcessDiffs/\n\nNote that I've made some assumptions when deciding a difference has no functional effect, e.g. ignoring a lot of calo config in the PAT step.  Please check that these assumptions are valid, if not let me know and I'll update the relevant era.  There should be enough information in the results linked above to describe these assumptions.  Some of the CSC configuration is actually more up to date in the era than the customisation, this I've \"ignored\" since this a reason to move to eras rather then stay with customisations.\n\nI've added a deprecated warning print out to the old customisation functions as well, in case users use their old configuration files.  I could split that off into a separate PR if you prefer.\n\n@davidlange6, @mulhearn \n", "branch": "CMSSW_7_6_X", "changed_files": 2, "closed_at": "1444322998", "comments": 39, "commits": 2, "created_at": "1443105985", "deletions": 34, "labels": ["comparison-available", "orp-pending", "pdmv-pending", "pending-signatures", "simulation-pending", "tests-rejected"], "merge_commit_sha": "62ee52035ccfca0564e09d4c1ff745f057042c47", "merged_at": "1444322998", "merged_by": "davidlange6", "milestone": "CMSSW_7_6_X", "number": 11466, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Switch runTheMatrix tests to use Run 2 eras", "updated_at": "1444362617", "user": "mark-grimes"}