{"additions": 17, "auther_ref": "master", "auther_sha": "5cedebee49a0bff7a41159836951ba0b19fbecbf", "author": "syuvivida", "body": "#### PR description:\r\nThis is a follow-up and update with respect to [PR 41986](https://github.com/cms-sw/cmssw/pull/41986). \r\n\r\nAfter testing the hlt clients in the new online DQM machines [0][1], we find an update in the `DQM/Integration/python/config/pbsource_cfi.py` is also required when using the new hltd version in the new online DQM machines: an additional input argument outputBaseDir must be provided.\r\n\r\nFor the current (old) online DQM machines, whether adding this input argument or not has no effect. \r\n\r\nMore information about the upgrade of new DQM machines below:\r\nWe are working on the upgrade of online DQM machines [0][1]. There will be a few months that we share the same CMSSW code between the new and the current machines. \r\nIn the current (old) DQM machines, the disks of bu-c2f11-09-01 and bu-c2f11-13-01 are mounted on our fu machines as /fff/BU0.  Event display clients `visualization-live` and `visualization-live-secondInstance` produce output root files at /fff/BU0/output. \r\n\r\nHowever, the mount point (path) has changed in the new online DQM machines [1]. In order to use the same event display client codes for both old and new machines and also to make the path name more flexible, we replace the output path with an input argument (with a default value of `/fff/BU0/output`). The old machines will use an old hltd version and take the default value of the argument `outputBaseDir`, while the input values for the new machines will be determined by hltd and startDqmRun.sh. \r\n\r\n\r\n[0] [twiki about the upgrade of DQM machines](https://twiki.cern.ch/twiki/bin/view/CMS/DQMUpgradeOnlineMachines)\r\n[1] [JIRA ticket that includes the communication with DAQ](https://its.cern.ch/jira/browse/CMSONS-14012)\r\n[2] [JIRA ticket of the tests during TS1](https://its.cern.ch/jira/browse/CMSONS-14652)\r\n\r\n#### PR validation:\r\n\r\n- This PR has been tested at lxplus by running the hlt, hcal, and ecal clients standalone with `CMSSW_13_0_X_2023-06-27-1100` , `CMSSW_13_1_X_2023-06-27-1100`,  and `CMSSW_13_2_X_2023-06-26-2300` with the streamers at `/eos/cms/store/group/comm_dqm/Collisions23_tempStreamers/`. \r\n- This PR has been tested at the current (old) online DQM playback machines and ran all clients without problem when using the default value of the input argument. \r\n- This PR has been deployed/tested when we tested the data transfer during TS1 [2].\r\n", "branch": "master", "changed_files": 2, "closed_at": "1688703591", "comments": 9, "commits": 1, "created_at": "1687981809", "deletions": 1, "labels": ["dqm-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "7d4e6d2c27402f2f60f636cbe8628511da29c27d", "merged_at": "1688703591", "merged_by": "cmsbuild", "milestone": "CMSSW_13_2_X", "number": 42128, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Online DQM: add an input argument outputBaseDir in pbsource_cfi.py (to fit with the new hltd version)", "updated_at": "1688703592", "user": "syuvivida"}