{"additions": 62, "auther_ref": "DemonstratorTools_compression_master", "auther_sha": "b58fcf1ed5be070678777188ae3b9b4c60c64dac", "author": "gpetruc", "body": "#### PR description:\r\n\r\nThis PR updates the DemonstratorTools package to support transparent compression of files pattern files if they end up with `.gz` (gzip) or `.xz` (lzma), using boost iostreams. \r\n\r\nThis feature is already implemented in other tools outside CMSSW that work with pattern files, in the [emp software framework](https://gitlab.cern.ch/p2-xware/software/emp-toolbox/-/merge_requests/121) and [correlator trigger tools](https://gitlab.cern.ch/cms-cactus/phase2/firmware/correlator-common/-/commits/master-125x/utils/patterns.py) so having the feature in CMSSW is useful.\r\n\r\nFor the moment lzma is not recommended since the other emp software tools don't support it as they're built on a version of boost iostreams without lzma, but since that may change in the future and adding lzma is only 5 extra lines of code I thought it was easier to just add it already in CMSSW.\r\n\r\nThe PR also updates the costructor of the BoardDataWriter to make the extension of the file configurable, and updates the pieces of C++ code using that class in CMSSW to add this extra parameter.\r\n * @tswilliams If you prefer, I can add an additonal constructor that doesn't take the file extension to keep backwards compatibility.\r\n* The behaviour of the GTT dumpers in DemonstratorTools is unchanged, the output remains an uncompressed text file.\r\n* The configuration of the Correlator pattern dumpers in Phase2L1ParticleFlow is updated to use compressed files and also to switch to the new EMP format introduced in #41768 above\r\n* I have also a version of the Phase2L1ParticleFlow which introduces `fillDescriptions()` for the Correlator Layer 2 e/gamma L1TCtL2EgProducer (@cerminar), I can either include it in this PR or leave it for the later bigger PR that adds `fillDescriptions()` also for the Correlator Layer 1 producers. You can see the diff in https://github.com/gpetruc/cmssw/compare/DemonstratorTools_compression_master...L1TCtL2EgProducer_fillDescriptions_master \r\n\r\nNote that pattern file production is not run in any production workflow\r\n\r\nThe PR was tested with the usual code checks + `runTheMatrix -l 23234.0` (to check nothing got broken elsewhere) and `L1Trigger/Phase2L1ParticleFlow/test/make_l1ct_binaryFiles_cfg.py` (which runs the correlator emulator + pattern file producers)\r\n\r\nA PR to cms-l1t-offline is also under way\r\n\r\n", "branch": "master", "changed_files": 11, "closed_at": "1688405955", "comments": 15, "commits": 2, "created_at": "1687891776", "deletions": 14, "labels": ["l1-approved", "fully-signed", "tests-approved", "orp-approved", "upgrade-approved", "code-checks-approved"], "merge_commit_sha": "89566566ccc898c6b1a11ea5b0dd962c32086eda", "merged_at": "1688405955", "merged_by": "cmsbuild", "milestone": "CMSSW_13_2_X", "number": 42115, "release-notes": [], "review_comments": 0, "state": "closed", "title": "L1T DemonstratorTools: support transparent compression of pattern files", "updated_at": "1688405956", "user": "gpetruc"}