{"additions": 24, "auther_ref": "pps-physvol-names", "auther_sha": "7ef37ed745581cc46be0822ae201610f10f441d8", "author": "cvuosalo", "body": "In old DD, physical volume names have no prefix or suffix, but, with DD4hep, physical volume names are prefixed with the namespace and suffixed with the copy number. PPS code searches for specific physical volumes, and these searches were failing because of the additional prefix and suffix added by DD4hep. The solution is to search for a string that somewhere contains the base physical volume name, rather than requiring an exact match.\r\n\r\nThis PR fixes issue #32653. The exception described in the issue occurred because the intended physical volume was not found, resulting in an attempt to construct a nonsense DetId, which caused the exception. In addition to fixing the search for the volume, this PR changes the initialization of the data members used to create the DetId. These members had been initialized to -1, which was a poor choice since they were converted into unsigned ints for use in the DetId, which gave the maximum unsigned value instead of -1 and thus generated an exception. This PR changes the initialized values to 0, which will not generate an exception in the case that the physical volume cannot be found. Instead, this PR adds error messages to cover this case.\r\n\r\n#### PR validation:\r\n\r\nThe sim step of DD4hep workflow 11642.911 was run to see the bug occur. After the code was fixed, the sim step was run again to see that it could successfully handle 50 events without the error occurring. Also, debug statements were checked to see that the fix was working.\r\n\r\nNo backport is planned.\r\n", "branch": "master", "changed_files": 3, "closed_at": "1610630325", "comments": 10, "commits": 1, "created_at": "1610577598", "deletions": 11, "labels": ["code-checks-approved", "fully-signed", "orp-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "17e3389749d67a251dfee0614ab8f30e06f46b3c", "merged_at": "1610630325", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 32667, "release-notes": [], "review_comments": 0, "state": "closed", "title": "[DD4hep] Fix PPS simulation so physical volume names are recognized", "updated_at": "1610630325", "user": "cvuosalo"}