{"additions": 5, "auther_ref": "PbPb_HoverE_CMSSW_15_1_X", "auther_sha": "65b1310ebe0b36cf6ec55b47dd8c5d8e47b8f15a", "author": "stahlleiton", "body": "#### PR description:\r\n\r\nThis PR increases the H/E threshold used for electrons from 0.15 to 0.5 in the PbPb eras via the pp_on_AA era modifier.\r\n\r\nThe inefficiency of ECAL-driven electrons in central PbPb collisions was identified to arise from the maximum H/E selection of 0.15 applied on super clusters used for producing ECAL-driven seeds. This selection was too tight for central PbPb collisions where the large event activity increases the H/E.\r\n\r\nIncreasing the H/E threshold to the same value used for photons (0.5) managed to recover the electrons and reach similar electron efficiencies in central PbPb as in peripheral PbPb and pp collisions, leading to an increase of efficiency from 64% to 95% in the barrel and from 30% to 94% in the endcap, while the fake rate in the reconstructed electrons (gedGsfElectron) remained under control only increasing by less than 1% in the barrel and 10% in the endcap in 0-20% centrality.\r\n\r\nThese changes were checked offline with a HYDJET embedded DY->ee 2023 PbPb MC simulation showing the improvement in electron efficiency. And the timing and event size were checked with 10k minbias events from 2023 PbPb data, showing an increase of less than 1% in reco timing and no significant increase in total MiniAOD event size.\r\n\r\n@mandrenguyen @pfs @RSalvatico\r\n\r\n#### PR validation:\r\n\r\nTested with workflows 162,162.02,162.03,162.1,162.2,162.3,162.4\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n", "branch": "master", "changed_files": 3, "comments": 8, "commits": 1, "created_at": "1755696121", "deletions": 0, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-pending", "code-checks-approved", "egamma"], "milestone": "CMSSW_15_1_X", "number": 48769, "release-notes": [], "review_comments": 0, "state": "open", "title": "Increase electron H/E threshold in PbPb eras", "updated_at": "1755705029", "user": "stahlleiton"}