{"additions": 975, "auther_ref": "sistripdetinfofilereader_removeservice", "auther_sha": "48a27816a67ee92936cbd3f92ccc13ee587d4622", "author": "pieterdavid", "body": "#### PR description:\r\n\r\nAs pointed out by @makortel the SiStripDetInfoFileReader service was violating framework policy by providing \"physics data\" (the list of strip tracker modules, and the number of APVs and strip length for each), so this is an attempt to remove it where it was used in that way.\r\nThe same information can be obtained also from the geometry (GeometricDet on the IdealGeometryRecord for the list of DetIds, TrackerGeometry on the TrackerDigiGeometryRecord for the full information), so for the cases where that was available anyway (or could easily be added) I moved to that.\r\nThere are a few cases (the SiStripCondObjBuilderFromDb service, and ES producers of with \"fake\" content - e.g. set with parameters, random - of conditions that do not depend on any of these records). Those I changed to use their own SiStripDetInfoFile instance.\r\n\r\n#### PR validation:\r\n\r\nCompiled and ran unittests. Also checked that the configs for standalone use of the GeometricDet/TrackerGeometry work and give the same information, see [here](https://github.com/pieterdavid/SiStripLocalRecoDebugging/commit/04eb0e90a8187b4a778ea679c02d7b2a167be46e).\r\nI did however not run all configs that I edited (many are for standalone tests, production of conditions etc., and several looked quite outdated), so it would be great if the relevant people (Strip online/DAQ, tracker DQM etc.) could have a look at those.", "branch": "master", "changed_files": 122, "closed_at": "1561616365", "comments": 39, "commits": 30, "created_at": "1561039116", "deletions": 1043, "labels": ["alca-approved", "analysis-approved", "code-checks-approved", "comparison-available", "db-approved", "dqm-approved", "fully-signed", "geometry-approved", "orp-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "83c9627a58bbd6e4e307a31617ca788769c6722a", "merged_at": "1561616365", "merged_by": "cmsbuild", "milestone": "CMSSW_11_0_X", "number": 27292, "release-notes": [], "review_comments": 13, "state": "closed", "title": "Remove SiStripDetInfoFileReader as an edm::Service", "updated_at": "1561616366", "user": "pieterdavid"}