{"additions": 522, "auther_ref": "20241022_DQMDEV_MainRebase", "auther_sha": "6200a84ec761856a0c966028faef9cd9b5cce35a", "author": "cfmcginn", "body": "#### PR description:\r\n\r\nThis PR is to replace existing, closed PR here: https://github.com/cms-sw/cmssw/pull/45948\r\n\r\nThe PR adds to the DQM for ZDC specific histograms, via ZDCQIE10Task\r\n\r\nThis PR is updated relative to the closed previous PR, mostly fixing build issue, retitling some histograms, and updating python such that emulated ZDC sums fill. Another PR exists where it is rebased to 14_1_X for backport, currently open  here https://github.com/cms-sw/cmssw/pull/46407.\r\n\r\n#### PR validation:\r\n\r\nThe PR is tested in CMSSW_14_2_X_2024-10-20-0000, after running a merge-topic to incorporate the PR into a fresh area\r\nscram b ran successfully, validating the build\r\n\r\nFollowing test command produces the expected output:\r\n```\r\ncmsRun DQM/Integration/python/clients/hcal_dqm_sourceclient-live_cfg.py inputFiles=/eos/cms/store/group/dpg_hcal/comm_hcal/PFG/backup_raw/HIHLTPhysics-HIRun2023A-RAW-v1-375754.root runkey=hi_run\r\n```\r\nunder the upload directory, if using the offline candidate GT. Inspected histograms inside the DQM file appear reasonable for ZDC sums.\r\n\r\nIn addition, the following set of commands are run\r\nscram b runtests\r\nscram build code-checks\r\nscram build code-format\r\n\r\ncode-checks revealed no issues, code-format offered no suggestions. runtests had multiple failures, detailed below - however, every failure existed already with runtests in a fresh area, and matches the set of failures documented already in the backport. As such, it is unclear the failures are the result of the PR\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nAs mentioned above, this PR is to replace the closed PR https://github.com/cms-sw/cmssw/pull/45948, and is paired to the backport to CMSSW_14_1_X, found here https://github.com/cms-sw/cmssw/pull/46407", "branch": "master", "changed_files": 4, "comments": 4, "commits": 1, "created_at": "1729597706", "deletions": 30, "labels": ["dqm-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_14_2_X", "number": 46478, "release-notes": [], "review_comments": 0, "state": "open", "title": "Added more ZDC functionality to DQM", "updated_at": "1729597824", "user": "cfmcginn"}