{"additions": 19, "auther_ref": "conddb-PoolDBESSource-fix-for-deleted-records-1-120X", "auther_sha": "73a40133c55a5f15816068dae18e4ab5f3271528", "author": "ggovi", "body": "#### PR description:\r\n\r\nCMSSW Workflows requiring the consumption of conditions can be successfully executed  when all the records involved in the code are represented by their corresponding entries in the Global Tag loaded from the Condition Database. \r\n\r\nConversely, additional Records included in the GT Record-Tag map could be ignored when they are not involved in the Workflow code.  This is the case, for instance, of Records that have been completely removed from the CMSSW Code.\r\n\r\nThis PR is addressing this last particular circumstance.  The GT initialisation has been modify to ignore the Records for which the corresponding plugin can't be found in CMSSW.\r\n\r\nThe new behaviour is obviously applied to Records added manually with toGet statements, when not present in the release.\r\n\r\nNote that these changes are not altering the current behaviour for other possible mis-matches between release and database,  that could happen at later stage in the processing:\r\n\r\n- Failures produced when no suitable IOV is found for a record invoked in the Workflow\r\n- Failures produced when the payload to be used for a given record cannot be read in the release, because written with a higher boost version\r\n- Failures produced when the Record, associated to given CondFormat in the release,  is mapped in the GT, to a Tag populated with payloads from a different class ( this is normally forbidden by policy )\r\n\r\n#### PR validation:\r\n\r\nIntegration test, executed with a specific GT (106X_mcRun2_asymptotic_v15) triggering in 12X the condition of 'missing record plugin'\r\n\r\n", "branch": "master", "changed_files": 1, "closed_at": "1622547826", "comments": 16, "commits": 4, "created_at": "1621503300", "deletions": 13, "labels": ["alca-approved", "code-checks-approved", "db-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "ad03f8b2a9a93cb189b98f752a32f85030edbbc0", "merged_at": "1622547826", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 33798, "release-notes": [], "review_comments": 1, "state": "closed", "title": "GT Initialization: ignoring non-existing record in the plugins pre-load", "updated_at": "1622547826", "user": "ggovi"}