{"additions": 2564, "auther_ref": "phase1TrackingSequence_v3", "auther_sha": "ac818d32b4e7171da0e42a04cd2351ddf701516f", "author": "makortel", "body": "This PR updates the Phase1 tracking sequence from the `Phase1PU70` to the one presented in tracking POG meeting Feb 1st. The performance comparison against `Phase1PU70` and run2 tracking (in phase1 detector) can be found from\nhttps://indico.cern.ch/event/489234/contribution/5/attachments/1220760/1784567/slides_phase1.pdf\nDue to the situation of the phase1 workflows (see the points below), the main purposes of this PR are to allow review/discussion on the implementation, and the use of the sequence e.g. for track selection MVA training.\n\nSince the era migration of the reconstruction part of the phase1 customization is still pending, the new sequence is added following the current pattern (full configuration fragments + customize function). The customize for the Phase1PU70 is kept, and another customize for running run2 tracking in phase1 detector is added for reference. The tracking configuration is selected by changing which line in `phase1TkCustoms.py` is uncommented (not too handy, but hopefully good-enough while waiting for better solutions, see e.g. https://hypernews.cern.ch/HyperNews/CMS/get/edmFramework/3597/1/2/1.html and onwards).\n\nAlso the effects on phase1 can't be easily tested before #12806 gets merged one way or another, and MultiTrackValidator configuration gets additional tuning for the iterations (that depends on #12806 and hence is not included in here).\n\nTested in 8_0_0_pre5. No changes expected in run2 workflows, for phase1 `-w upgrade -l 10000` runs.\n\n@rovere @VinInn \n", "branch": "CMSSW_8_0_X", "changed_files": 17, "closed_at": "1454526521", "comments": 7, "commits": 4, "created_at": "1454340184", "deletions": 52, "labels": ["comparison-available", "geometry-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "simulation-pending", "tests-approved"], "milestone": "CMSSW_8_0_X", "number": 13149, "release-notes": [], "review_comments": 1, "state": "closed", "title": "Update phase1 (2017) tracking sequence", "updated_at": "1454526521", "user": "makortel"}