{"additions": 1665, "auther_ref": "74X-MVaNoPuMETForMiniAOD", "auther_sha": "ce1863b6512fb541506a1ed37bd17fc76b309a41", "author": "cms-met", "body": "Same as #6922 but rebased on top of CMSSW_7_4_X.\n\nThis PR modifies the mva mitigated MET code in order to make it able to run in top of miniAODs. Cleaning and restructuration of the associated code is also done.\n\nPackages involved :\n-DataFormats/METReco : auxiliary structure for the pileup mitigated MET algorithm restructuresd for a common approach\n\nRecoJets/JetProducers : pileup mva jet id now able to work in top of miniAOD, mandatory for the mva MET\nRecoMET/METPUSubtraction : rewriting of the NoPU and Mva MET code -> clarity and structure improved, mvaMET able to work in top of miniAOD. NoPU will not due to the limited information available on miniAOD, and it is not planned to go further in that direction.\nChanges expected :\n\nreco sequence : no change expected so far, plugin of default mva/nopu algorithm at the RECO/AOD or miniAOD level for a next PR\nevent content : transparent\ndifference between the mva MET at AOD and miniAOD level : 1% of events slightly different due to the difference of pfCandidate-vertex matching between both format\ndifference between previous version and new version : slight difference of the mvaMET results compared to the current version in the release, due to how JEC are handled in the pileup Jet Id mva algorithm for the mvaMET (before was internal, now pileup Jet ID mva is independent, and in sync with other use of the pileup mva jet id)\nmatrix tests are successfull\n", "branch": "CMSSW_7_4_X", "changed_files": 40, "closed_at": "1421454193", "comments": 13, "commits": 10, "created_at": "1420732264", "deletions": 1570, "labels": ["comparison-available", "fully-signed", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "61c8447becfdc7003ebd80ff18a3cb1b66c5f706", "merged_at": "1421454193", "merged_by": "cmsbuild", "milestone": "Next CMSSW_7_4_X", "number": 7085, "release-notes": [], "review_comments": 12, "state": "closed", "title": "Integration of MvaMET code and tools for miniAOD, cleaning of RecoMET/METPUSubtraction package", "updated_at": "1479107062", "user": "mmarionncern"}