{"additions": 543, "auther_ref": "esConsumesMigrationTrigger", "auther_sha": "fc2db8ea20eb07482b5ab76eda0757b9249dff3c", "author": "wddgit", "body": "#### PR description:\r\n\r\nMigrate L1GtUtils, L1TGlobalUtil, and HLTPrescaleProvider to make necessary consumes calls for the EventSetup objects they get. The clients of these classes are modified the minimal amount necessary to keep things working properly with those changes, but this does not include the full consumes migration of all those client modules. That will need to be done in future PRs.\r\n\r\nThere is some choice for L1GtUtils and L1TGlobalUtil whether to get data in beginRun or the Event or both. It defaults to beginRun and clients that already used that choice did not need modification.\r\n\r\nHLTPrescaleProvider needs a configuration parameter now to tell it whether to use L1GtUtils or L1TGlobalUtil. We do not want it prefetching for both when EventSetup prefetching is enabled. The era mechanism will be used to control this choice unless someone manually sets the parameter.\r\n\r\nThe changes propagated into GenericTriggerEventFlag and through, but there will need to be more work done there. I did not finish migrating that yet. It has additional EventSetup get calls. The default constructor argument is correct for all but 3 clients of that.\r\n\r\nThis could easily break code outside the repository. If they use one of the 3 migrated classes and the constructor argument defaults are not what is required.\r\n\r\n#### PR validation:\r\n\r\nI just ran the full runTheMatrix tests. There is no new functionality here. All results should be the same.\r\n", "branch": "master", "changed_files": 39, "closed_at": "1575926713", "comments": 3, "commits": 1, "created_at": "1575926663", "deletions": 215, "labels": ["alca-pending", "analysis-pending", "code-checks-approved", "comparison-pending", "dqm-pending", "hlt-pending", "l1-pending", "orp-pending", "pdmv-pending", "pending-signatures", "reconstruction-pending", "tests-pending"], "milestone": "CMSSW_11_1_X", "number": 28591, "release-notes": [], "review_comments": 0, "state": "closed", "title": "EventSetup consumes migration for L1GtUtils, L1TGlobalUtil, HLTPrescaleProvider", "updated_at": "1575927135", "user": "wddgit"}