{"additions": 3954, "auther_ref": "CMSSW_10_1_X_tau-pog_recoOnMiniAOD", "auther_sha": "26c6f8fda1d7db22feca48bb0303f8d8f23a7547", "author": "cms-tau-pog", "body": "Hi all, \r\n\r\nthis is a pull request concerned with tau reconstruction based on miniAOD event content. There has been a related PR (*) in December. After some restructuring, following proposals by Slava, this is the next iteration to integrate this feature. The restructuring required changes of data formats to be a accepted by plugins and other data formats used in TauReco, which imply small/minimal changes in quite a large number of files. The original work was initiated by @mbluj and continued and brought to completion by @steggema. An independent deep validation has been performed by @mbluj in addition to the usual checks that we apply. All tests went out fine.\r\n\r\nWe have checked and expect that the default workflows based on AOD input remain unchanged. Small differences are observed and expected when comparing taus reconstructed based on AOD input to taus reconstructed based on miniAOD input. Also for the availability of the full performance of the tau-ID (e.g. concerning discrimination against muons) a few pieces of information are still missing on the miniAOD event content. This work is left to follow-up implementations. \r\n\r\nA presentation by @steggema is anticipated in then next Reco/AT meeting. For more details before this presentation will be given, please refer to @steggema and @mbluj. \r\n\r\nCheers,\r\nRoger\r\n\r\n(*)\r\nhttps://github.com/cms-sw/cmssw/pull/21757", "branch": "master", "changed_files": 137, "comments": 336, "commits": 114, "created_at": "1520944526", "deletions": 2182, "labels": ["analysis-pending", "code-checks-approved", "comparison-pending", "dqm-pending", "hlt-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-started", "visualization-pending"], "milestone": "CMSSW_10_5_X", "number": 22594, "release-notes": [], "review_comments": 148, "state": "open", "title": "Tau reconstruction based on miniAOD event content ", "updated_at": "1549370257", "user": "roger-wolf"}