{"additions": 41, "auther_ref": "tighterQuality4MuonAndJetCoreSeedsHI", "auther_sha": "04db5e36b1a02b5da8817bc7539fc68dbe6ecc8a", "author": "mandrenguyen", "body": "In the heavy-ion era (pp_on_AA) each tracking iteration either has a dedicated MVA track selection, trained in heavy ions, or we simply tighten the cut on the pp-trained MVA output.\r\nThe exceptions are the jetCore and muon-seeded iterations, which are still using the pp defaults.  The quality selection is far too loose for central PbPb collisions giving rise to fake tracks that can lead to fake hadrons in particle flow. \r\nIn the 2018 data this was dealt with by a post-PF cleaning module [1], which is sub-optimal, as the event interpretation is already done.\r\nThis PR tighten the selections that define the highPurity bit, which is required for charged hadrons in PF (at least for PbPb)\r\n\r\nFor the jetCore iteration we simply tightened the value of the pp-trained MVA cut used in the highPurity bit from 0.4 to 0.8.    This was tested in minbias and QCD events (with a PbPb UE).  There is about a 10% loss of tracks for this iteration, but the fake rate is reduced by a factor of several.  The overall effect on the efficiency and fake rate is small, as this iteration does not contribute much to the overall tracking.\r\n\r\nThe muon-seeded iterations are still cut based.  We tuned the cuts that define highPurity using a muon-jet and upsilon sample (with PbPb underlying event).  There is no effect on the efficiency of muons passing the standard selection.  This is expected as highPurity is not used in the global muon reconstruction or in the selection.  Matched tracks from these iterations were reduced by about 5%, while fake tracks were reduced by 30%, notably removing a tail of high pT fake/mis-reco'd tracks, which was known to be problematic for jets.  \r\n\r\n@denerslemos \r\n ", "branch": "master", "changed_files": 2, "closed_at": "1660742840", "comments": 7, "commits": 2, "created_at": "1660665100", "deletions": 0, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "e0e42b28667f532efb0c485745b7fb48c554f1ae", "merged_at": "1660742840", "merged_by": "cmsbuild", "milestone": "CMSSW_12_5_X", "number": 39085, "release-notes": [], "review_comments": 0, "state": "closed", "title": "tighter selection in pp_on_AA era for iterations still using pp defaults", "updated_at": "1660742840", "user": "mandrenguyen"}