{"additions": 132, "auther_ref": "from-CMSSW_12_0_X_2021-06-09-2300-Remove-duplicate-CLCTs-LCTs", "auther_sha": "5286f3aadb0f5989aed1e3fe4a417ccab108da12", "author": "dildick", "body": "#### PR description:\r\n\r\nRemove duplicate CLCTs and LCTs from trigger path in L1T CSC DQM to better compare with DAQ path. Duplicates are (C)LCTs that have the same properties as (C)LCTs found before by the emulator, except for the BX, which is off by +1. These are typically not in the CSC DAQ because the L1A will only pick up the first one, not the second one. \r\n\r\n#### PR validation:\r\n\r\nTested on 10k events from B904 cosmic data run taken today. This run had a fixed CLCT slope mapping in the CCLUT algorithm - seems to be working now. In all, good agreement can be seen for CLCTs. \r\n\r\nThere are still discrepancies for CLCTs, which can be attributed to (1) too many CLCTs in emulation, (2) too few CLCTs in emulation. (1) cannot be easily fixed I think since we don't know where the L1A is in the emulation. (2) might be worthwhile to look at because it points to real flaws in the CLCT emulation algorithm.\r\n\r\nValidation plots added also below:\r\n\r\n[CSC_dataVsEmul_B904_Cosmic_Run_210609_142357.pdf](https://github.com/cms-sw/cmssw/files/6628263/CSC_dataVsEmul_B904_Cosmic_Run_210609_142357.pdf)\r\n\r\nI should note that the comparison was done for a pretrigger zone with size 5. CSC trigger devs are still debating whether or not this is something we should pursue. In the code now we set the pretrigger zone to 224, meaning that we accept any CLCT 2BX after a pretrigger, as opposed to a trigger that is spatially matched to the pretrigger.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nN/A\r\n\r\nBefore submitting your pull requests, make sure you followed this checklist:\r\n- verify that the PR is really intended for the chosen branch\r\n- verify that changes follow [CMS Naming, Coding, And Style Rules](http://cms-sw.github.io/cms_coding_rules.html)\r\n- verify that the PR passes the basic test procedure suggested in the [CMSSW PR instructions](https://cms-sw.github.io/PRWorkflow.html)\r\n\r\n@tahuang1991 ", "branch": "master", "changed_files": 4, "closed_at": "1623330455", "comments": 12, "commits": 2, "created_at": "1623291487", "deletions": 35, "labels": ["code-checks-approved", "dqm-approved", "fully-signed", "orp-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "773ed53e4c8bd06932dcfa8f59a0166d8ef01a2f", "merged_at": "1623330454", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 34073, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Remove duplicate CLCTs and LCTs from trigger path in L1T CSC DQM", "updated_at": "1623330455", "user": "dildick"}