{"additions": 7, "auther_ref": "l1to2o_ESGetToken_fix_part2", "auther_sha": "0e675061b02ec7636f1a7f726647b7f6dcac2834", "author": "panoskatsoulis", "body": "#### PR description:\r\n\r\nThis PR is complementary to #37602 for fixing several issues of the L1o2o in 12_3 onward.\r\nOne of the main problems was that since the producers for the requested ES Rcds are now run in construction time, several exceptions that where handled in the `produce()` method of the L1 `L1CondDBPayloadWriterExt` module now are impossible to be handled properly.\r\n\r\nAfter the P5 deployment of the changes included in 37602, one last case has been found where an exception was thrown when the key of a single subsystem was already included in the db and in this case the o2o procedure was stopped for this subsystem (with an exception to be handled by the code block in `produce()`).\r\nhttps://github.com/panoskatsoulis/cmssw/blob/0e675061b02ec7636f1a7f726647b7f6dcac2834/CondTools/L1Trigger/interface/L1ConfigOnlineProdBase.h#L123-L157\r\n\r\nThis PR includes cfg modifications needed for forcing the L1 online producers to run no matter if the resulting object exist in the db (however will not be uploaded if it already exist)\r\nIt's required for cases where the following happens\r\n- L1system 1 **exists**\r\n- L1system 2 **exists**\r\n- L1system 3 **new key**\r\n\r\n#### PR validation:\r\nThis modification is tested in Prep and also is used atm as local custom patch for the L1 O2O Jobs at P5 (without problems)\r\nThe unit tests implemented in 37602 didn't catch this problem because the local sqlite file from the data repo was not prepared for this \"real-case\" scenario that occurred when we tested with more keys.\r\nSo, the file in https://github.com/cms-data/L1TriggerConfig-L1TConfigProducers is meant to be updated too for better future testing.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\nNot sure if a backport is needed\r\nAtm these mods are implemented in a custom patch on the `conddb-1` machine.\r\nIn case more 12_3 releases are going to be deployed for the o2o machines at P5 a backport is also required.", "branch": "master", "changed_files": 7, "closed_at": "1652177717", "comments": 13, "commits": 1, "created_at": "1652096066", "deletions": 7, "labels": ["l1-approved", "fully-signed", "tests-approved", "db-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "1f74939332ab708f5d29759393f6f3e790b6c47e", "merged_at": "1652177716", "merged_by": "cmsbuild", "milestone": "CMSSW_12_4_X", "number": 37861, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Enable forceGeneration for L1 O2O online producers", "updated_at": "1652177717", "user": "panoskatsoulis"}