{"additions": 32, "auther_ref": "dynamicWeightChoiceGenInfoToLumiCache", "auther_sha": "2f520adfc925ad6b66ea40de1a37a3a17c2c5b10", "author": "wddgit", "body": "#### PR description:\r\n\r\nMove DynamicWeightChoiceGenInfo into a LuminosityBlockCache. The primary goal for this change is to have DynamicWeightChoiceGenInfo always be set properly. Currently, it appears in the code that there is a possibility for it to use some values from an earlier lumi because all the values it contains are not always set at begin lumi. I'm not sure if this ever actually happens in practice. That would depend on the input.\r\n\r\nThe Core group's motivation to look at this code is that we are currently surveying all CMSSW to look for problems that a new Framework behavior might cause. The new behavior allows a stream to skip a lumi if at the time the stream is starting on the lumi at least one other stream has processed the lumi and all the events were already processed. Specifically the stream would skip the stream begin lumi and stream end lumi transitions. The performance advantage related to this occurs when there is an event that takes an extremely long time to process. That stream cannot finish its current lumi or any subsequent lumis. As other streams finish subsequent lumis, the limit on concurrent lumi is reached and all the other streams get stuck.\r\n\r\nThis lumi skipping would cause modules that rely on values set in previous lumis to get non reproducible results if those previous lumis might or might not have been skipped.\r\n\r\nAfter this change, each weight choice object will be recreated from nothing for each lumi. This was already occurring for the first lumi in each run (but not later lumis in the run).\r\n\r\nThis change also has some side benefits.\r\n\r\n* The weight choice is only initialized once per lumi instead of once per lumi per stream.\r\n* There is only one copy in memory per lumi instead of one per stream per lumi.\r\n* The weight choice object will be in the LuminosityBlockCache and that is similar to the way the other weight choice object is already in the RunCache.\r\n* There were two constant vectors that I pulled out of the cache entirely and just made constexpr arrays.\r\n\r\nThe biggest change in the code is that a large block of code was moved from streamBeginLuminosityBlock to globalBeginLuminosityBlock.\r\n\r\nUnless I made a mistake, I believe the results should be identical before and after. Exactly the same things should be happening during begin lumi to set the values in the weight choice object.\r\n\r\n#### PR validation:\r\n\r\nIt builds. There is no unit test. I would greatly appreciate if an expert on this part of the code could run a test and verify that this does not break anything (and review what I've done). Alternatively, if you can point me to a test that runs this module, then I will try it.\r\n\r\nFYI @makortel ", "branch": "master", "changed_files": 1, "comments": 15, "commits": 1, "created_at": "1705530011", "deletions": 21, "labels": ["pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "xpog-pending"], "milestone": "CMSSW_14_0_X", "number": 43739, "release-notes": [], "review_comments": 0, "state": "open", "title": "Move DynamicWeightChoiceGenInfo into a LuminosityBlockCache", "updated_at": "1705936122", "user": "wddgit"}