{"additions": 13358, "auther_ref": "from-CMSSW_12_1_X_KB_v1", "auther_sha": "b8d8a961017b1bf6dbdc6b5b40de1bd702e77a5b", "author": "kbunkow", "body": "#### PR description:\r\n\r\nThis PR contains a new version of the L1 Trigger Overlap Muon Track Finder (OMTF) emulator:  L1Trigger/L1TMuonOverlapPhase1. It should replace the current OMTF emulator L1Trigger/L1TMuonOverlap. The changes in the codes are so significant that we decided to create the new package (L1TMuonOverlapPhase1) rather than updating the old one (L1TMuonOverlap). At some point, L1TMuonOverlap can be removed from the CMSSW (for the moment keeping both packages allows comparing the results easily) . \r\n\r\nThe OMTF algorithm for the Run3 was significantly improved, these improvements decrease the rate while keeping slightly higher efficiency than the Run2 algorithm.\r\nThe L1TMuonOverlapPhase1 can emulate properly the OMTF firmware version with the above-mentioned improvements (this firmware is already deployed in the P5 and was used during the CRUZET).\r\nAdditionally, L1TMuonOverlapPhase1 emulates properly the Run2 OMTF firmware  the data-to-emulator agreement on the 2018D data is slightly better for the L1TMuonOverlapPhase1 than for the L1TMuonOverlap.\r\n\r\nBesides the new package there are also changes in the CondFormats needed to configure the OMTF emulator:\r\nCondFormats/L1TObjects/interface/L1TMuonOverlapParams.h\r\nThere is one more parameter added in the L1TMuonOverlapParams, which is needed for Run3 OMTF algorithm. This change is fully backward compatible, i.e. both L1TMuonOverlapPhase1 and  L1TMuonOverlap work correctly with the Run2 records which dont have this new parameter.\r\nL1TMuonOverlapParams record for the Run3 OMTF algorithm is not yet in the database, if needed the L1TMuonOverlapPhase1 can be configured to emulate the Run3 algorithm with the use of the L1Trigger/L1TMuonOverlapPhase1/python/fakeOmtfParams_cff.py\r\n\r\nThese two files are also updated:\r\nDQM/L1TMonitor/python/L1TStage2Emulator_cff.py\r\nand\r\nL1Trigger/L1TMuon/python/simDigis_cff.py\r\nin both cases switching to use the new emulator i.e. L1Trigger.L1TMuonOverlapPhase1.simOmtfDigis_cfi\r\n\r\n\r\n#### PR validation:\r\n\r\nI run the recommended test:\r\nrunTheMatrix.py -l limited -i all ibeos\r\nand the result is:\r\n39 38 37 28 18 4 1 1 1 tests passed, 0 0 0 0 0 0 0 0 0 failed\r\n\r\nAlso, I run the DQM data-to-emulator comparison (cmsRun DQM/Integration/python/clients/l1tstage2emulator_dqm_sourceclient-live_cfg.py with) for a few data files. Both for the recent cosmic run in which the updated OMTF firmware was used, and for the 2018D collision data the data-to-emulator disagreements are at the level of 1%, so similar (or slightly less) than in the case of the old emulator L1TMuonOverlap. The reasons for the disagreements are understood (and unfortunately are very difficult to fix).\r\n\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\nThis PR is not a backport\r\n\r\n", "branch": "master", "changed_files": 100, "comments": 38, "commits": 9, "created_at": "1630505634", "deletions": 4, "labels": ["dqm-pending", "l1-pending", "alca-pending", "db-pending", "pending-signatures", "orp-pending", "tests-started", "requires-external", "code-checks-approved"], "milestone": "CMSSW_12_1_X", "number": 35111, "release-notes": [], "review_comments": 99, "state": "open", "title": "new package L1Trigger/L1TMuonOverlapPhase1 (new version of the L1 Trigger Overlap Muon Track Finder (OMTF) emulator)", "updated_at": "1632495657", "user": "kbunkow"}