{"additions": 145, "auther_ref": "localConnectInSiteLocalConfig", "auther_sha": "f48be34ecba70c0c10a2e15a7adf9de8e930f19b", "author": "wddgit", "body": "#### PR description:\r\n\r\nAdd support for setting the connection string in PoolDBESSource based on the site local config XML file and the global tag. Here is an example of of how to modify the XML file:  \r\n\r\n```\r\n<site-local-config>\r\n<site name=\"DUMMY\">\r\n   ...\r\n   <calib-data>\r\n      ...\r\n      <local-connect>\r\n         <connectString prefix=\"anything1\" suffix=\"anything2\"/>\r\n      </local-connect>\r\n...\r\n```\r\n\r\nIf a non-empty globaltag is in the PoolDBESSource configuration and ```<local-connect>``` is in the XML file as shown above, then the connection string will be overwritten by the result of concatenating the prefix plus the globaltag plus the suffix. The prefix and suffix are from the XML file and can be set to anything or nothing. \r\n\r\nAn exception will be thrown if ```<local-connect>``` and ```<frontier-connect>``` are both set in the same XML file.\r\n\r\nIt is also possible to override the prefix and suffix from the configuration of the SiteLocalConfigService. It is also possible to force overwriting of the connection string in the same way.\r\n\r\nThis is primarily intended for use at sites where the worker nodes do not have network connectivity and the data normally retrieved from a database must be put into a local file.\r\n\r\n#### PR validation:\r\n\r\nExtended SiteLocalConfig unit tests to cover these new variables.\r\n\r\nThis should not change any behavior or results until a site local config XML file modified or the override configuration parameters are used. Existing tests of PoolDBESSource verify that. \r\n\r\nWe have not yet tested this on remote worker nodes that do not have network connectivity. The intent is to do that testing after the PR is merged and if necessary make further changes.\r\n", "branch": "master", "changed_files": 15, "closed_at": "1604103313", "comments": 58, "commits": 2, "created_at": "1600796667", "deletions": 62, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "core-approved", "db-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "c06e9221654dec0bb2bcad6c30960f02fdc26c45", "merged_at": "1604103313", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 31544, "release-notes": [], "review_comments": 11, "state": "closed", "title": "Allow setting connect string from SiteLocalConfig", "updated_at": "1604103314", "user": "wddgit"}