{"additions": 13, "auther_ref": "master", "auther_sha": "e472f882c9969b629e94b2beb81332318b577b1c", "author": "syuvivida", "body": "#### PR description:\r\nWe are working on the upgrade of online DQM machines [0][1]. There will be a few months that we share the same CMSSW code between the new and the current machines. \r\nIn the current (old) DQM machines, the disks of bu-c2f11-09-01 and bu-c2f11-13-01 are mounted on our fu machines as /fff/BU0.  Event display clients `visualization-live` and `visualization-live-secondInstance` produce output root files at /fff/BU0/output. \r\n\r\nHowever, the mount point (path) has changed in the new online DQM machines [1]. In order to use the same event display client codes for both old and new machines and also to make the path name more flexible, we replace the output path with an input argument (with a default value of `/fff/BU0/output`). The old machines will use an old hltd version and take the default value of the argument `outputBaseDir`, while the input values for the new machines will be determined by hltd and startDqmRun.sh. \r\n\r\nWe also plan to have a test of data transfer from DAQ to the new online DQM machines during the TS1 [2] and deploy this PR in the new online DQM machines. The update of hltd and startDqmRun.sh is already done by @smorovic \r\n\r\n[0] [twiki about the upgrade of DQM machines](https://twiki.cern.ch/twiki/bin/view/CMS/DQMUpgradeOnlineMachines)\r\n[1] [JIRA ticket that includes the communication with DAQ](https://its.cern.ch/jira/browse/CMSONS-14012)\r\n[2] [JIRA ticket of the tests during TS1](https://its.cern.ch/jira/browse/CMSONS-14652)\r\n\r\n#### PR validation:\r\n\r\n- This PR has been tested at lxplus by running the event display clients standalone with `CMSSW_13_2_X_2023-06-15-1100`.\r\n- This PR has been tested at the current (old) DQM playback machines and ran without problem when using the default value of the input argument. \r\n\r\n", "branch": "master", "changed_files": 3, "comments": 4, "commits": 1, "created_at": "1686905186", "deletions": 2, "labels": ["dqm-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_13_2_X", "number": 41986, "release-notes": [], "review_comments": 0, "state": "open", "title": "Online DQM: replace the hard-coded output directory name of event display clients with an input argument", "updated_at": "1686922806", "user": "syuvivida"}