{"additions": 800, "auther_ref": "10_5_0_pre1-new-output-module", "auther_sha": "3baa3e4f6f75a7996a73584d3f4387e0449006df", "author": "smorovic", "body": "This is DAQ (HLT/Filter Farm) output module implementation based on limited::OutputModule. This implementation removes limitation of handling only one LS at the time present in current one DAQ module.\r\n\r\n- New module also rely on changes introduced here: https://github.com/cms-sw/cmssw/pull/21830\r\n\r\n- StreamerOutputModuleBase (inheriting one::OutputModule) base is restructured and serializer code (shared with the new, limited implementation) extracted to a common class which can be used by both one and limited module. Currently, \"base\" is used by: DQM test module, Streamer writer module and previous DAQ output module which we'll still keep.\r\n\r\n- new module is called EvFOutputModule while previous DAQ module remains as ShmStreamConsumer (this name is currently still used in production configurations).\r\n\r\n- Limited OutputModule transitions used to write event and end global lumisection are const functions. There are a few problems associated with this, for which a workaround is to apply const_cast:\r\n\r\n1. This is too strict for streamer serializer, which is therefore included in a helper class stored in RunCache. Serializer keeps internally a buffer which is reallocated only if too small to accommodate serialized event. To allow access, const_cast is applied in event write callback.\r\n\r\n2. File writer in LuminosityBlockCache object also needs const_cast in event write and global EoL ( where file is written to / closed). Also it needs to update the object to do per-LS event count bookkeeping.\r\n\r\n3. JSON writer, which is initialized once with JSON definitions, is also stored in RunCache, and needs to be allowed modification at the time of global EoL.\r\n\r\n- Those const_casts should be thread-safe since this limited output module strictly requires concurrencyLimit = 1 at runtime, and will throw exception if another configuration value is set.\r\n", "branch": "master", "changed_files": 14, "comments": 2, "commits": 8, "created_at": "1550245531", "deletions": 316, "labels": ["code-checks-pending", "comparison-pending", "core-pending", "daq-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-pending"], "milestone": "CMSSW_10_5_X", "number": 25951, "release-notes": [], "review_comments": 0, "state": "open", "title": "DAQ limited output module (10_5_X)", "updated_at": "1550245604", "user": "smorovic"}