{"additions": 742, "auther_ref": "scouting_nano_test_14_2_0_pre1", "auther_sha": "23702028dcf034af87023a4f29f175bfb9074b58", "author": "patinkaew", "body": "(This is currently a draft PR to help facilitate initial code review. If this gets green light, we will remove this line and change to actual PR)\r\n\r\n#### PR description:\r\n\r\nThis PR improves ScoutingNano integration with autoNano. This mainly concerns using ScoutingNano flavour in combination with other nano flavours. The primary use case is in scouting vs offline object comparison studies using ScoutingPFMonitor datasets. Currently, ScoutingNano configuration replaces ```nanoSequence``` which is also used in standard nano, making combining ScoutingNano with standard NanoAOD unclear and difficult. While there exist recipes to compose scouting+standard, they are not intuitive and do not use the autoNano functionalities. Hence, this PR implements changes to allow combining scouting+standard with autoNano. This is achieved by creating new ```scoutingNanoSequence``` in the configuration file and not altering standard ```nanoSequence```. For combining scouting+standard, both ```scoutingNanoSequence``` and ```nanoSequence``` will be scheduled on different paths to run. Additionally, in principle, ScoutingNano will be able to combine with other nano flavours in autoNano as well.\r\n\r\nThe changes also aims to better integrate with T0 processing workflow to prepare for scouting+standard NanoAOD production for ScoutingPFMonitor dataset in the future.\r\n\r\nIn addition, we use this opportunity to also\r\n- Apply general code clean up.\r\n- Implement customise functions for use with ```cmsDriver.py --customise```:\r\n   - add back scouting tracks and PF candidates after they were dropped in the previous PR for private production\r\n- Reclustered jets use already-implemented energy fractions as opposed to recalculation as expressed in SimplePFJetFlatTable producer.\r\n\r\nAn accompanying documentation for this change is also available [1]. Examples using autoNano are provided and checked.\r\n\r\n#### PR validation:\r\n\r\nPass all tests from ```scram b runtests use-ibeos```\r\n```\r\nCreating test log file logs/el9_amd64_gcc12/testing.log\r\n>> Created tmp/el9_amd64_gcc12/das_client/dasgoclient\r\nPass   51s ... Configuration/Applications/TestConfigurationApplicationsConfigBuilder\r\n>> Creating project symlinks\r\nPass   13s ... PhysicsTools/NanoAOD/testPhysicsToolsNanoAODTP\r\n>> Test sequence completed for CMSSW CMSSW_14_2_0_pre1\r\n```\r\nPass all tests from ```runTheMatrix.py -l limited -i all --ibeos```\r\n```\r\n44 43 41 36 19 1 1 1 1 1 1 tests passed, 0 0 0 0 0 0 0 0 0 0 0 failed\r\n```\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis is not a backport and there is currently no plan for a backport.\r\n\r\n[1] https://codimd.web.cern.ch/s/_sVpKamo5", "branch": "master", "changed_files": 3, "comments": 8, "commits": 1, "created_at": "1729850634", "deletions": 516, "labels": ["pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "xpog-pending"], "milestone": "CMSSW_14_2_X", "number": 46516, "release-notes": [], "review_comments": 0, "state": "open", "title": "Improve ScoutingNano integration with autoNano", "updated_at": "1730459268", "user": "patinkaew"}