{"additions": 67, "auther_ref": "add-dd4hep-db-wfs", "auther_sha": "9fbb5c0936bae2ac7026b11cbb8d6eacc20da10e", "author": "cvuosalo", "body": "Up to now, DD4hep workflows have read geometry from XML files. This PR provides the capability for a DD4hep workflow to be configured to read geometry from the DB. Note that the DD4hep ideal geometry description DB payload is not completely finished (see PR #34111), but this PR was tested with a preliminary version of the payload to see that DD4hep simulation could read and process it.\r\n\r\nFurther steps are still needed:\r\n1. PR 34111 needs to be completed (it is very close).\r\n2. The DD4hep Run 3 ideal geometry description DB payload needs to be uploaded to the DB.\r\n3. A DD4hep workflow that reads geometry from the DB needs to be defined.\r\n4. That new DD4hep workflow needs to be added to the PR and IB tests.\r\n\r\nFor non-DD4hep workflows, changes were kept to a minimum to ensure that existing workflows would not be altered. The new file `GeometryDDDSimDB_cff.py` to be used by existing DDD workflows is identical to the original `GeometrySimDB_cff.py` that was used by these workflows previously.\r\n\r\nThe `hcalSimDBConstants_cff.py` file in this PR is from recently merged PR #34267.\r\n\r\nThis PR was tested with unit tests, workflow 11634.0, PR tests, and modified workflow 11634.911 that read from the DB.", "branch": "master", "changed_files": 8, "closed_at": "1625366894", "comments": 88, "commits": 2, "created_at": "1624412539", "deletions": 15, "labels": ["code-checks-approved", "fully-signed", "geometry-approved", "operations-approved", "orp-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "fb175308977c61f64ca27eea9a805ac235b68f34", "merged_at": "1625366894", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 34219, "release-notes": [], "review_comments": 23, "state": "closed", "title": "[DD4hep] Enable Run 3 DD4hep workflows to read geometry from DB", "updated_at": "1625366894", "user": "cvuosalo"}