{"additions": 1814, "auther_ref": "MPI_updates", "auther_sha": "24a2662f2eb00198269b82ebf734228020763cd4", "author": "fwyzard", "body": "This PR is a work in progress.\r\nPlease do not leave comments about the file names and organisation, as they will change quite often as the development progresses.\r\n\r\nNote that the MPI approach used is known to be very basic and somewhat limited, but this is currently a lower priority.\r\n\r\n#### PR description:\r\n\r\nThis implementation foresees two CMSSW processes running in parallel, on the same or different machines:\r\n    - a \"driver\" process;\r\n    - a \"follower\" process.\r\n\r\nThe driver process is free to analyze any run/lumi/event from any source.\r\nAn \"MPIDriver\" module runs inside the driver process, listens to all stream transitions (begin/end stream, begin/end run, begin/end lumi, new event) and reads an arbitrary list of event data products.\r\nThe MPIDriver module connects over MPI to the follower process; it will signal the same transitions to the follower process, and transfer to it the event data products it reads.\r\n\r\nThe follower process uses a dedicated source, an \"MPISource\" module, to recreate the same run, lumi and event transitions received from the driver process.\r\nThe MPISource connects to the MPIDriver module in the driver process, and will generate in the local process the same run and lumi transitions and events that it receives; it will populate the local event with the data product received from the driver, along with an additional product used to keep track of the driver process rank and stream.\r\n\r\nAn automated test is available in the test/ directory.\r\n\r\nCurrent limitations:\r\n    - support a single stream\r\n    - support a single \"follower\"\r\n    - transfer only per-event data products\r\n\r\n#### PR validation:\r\n\r\nThis PR includes an automated unit test.", "branch": "master", "changed_files": 25, "comments": 23, "commits": 5, "created_at": "1610412286", "deletions": 71, "labels": ["pending-signatures", "tests-pending", "orp-pending", "code-checks-rejected", "heterogeneous-pending"], "milestone": "CMSSW_12_4_X", "number": 32632, "release-notes": [], "review_comments": 0, "state": "open", "title": "Implement a simple CMSSW client/server over MPI", "updated_at": "1646982095", "user": "fwyzard"}