{"additions": 534, "auther_ref": "l1met_jump", "auther_sha": "af82bf2ca97c7bb94e56f486bafb654a450f9bb9", "author": "JunwonTomOh", "body": "PR description:\r\nThis PR introduces two new L1 MET calculation algorithms and related implementations:\r\n\r\nA new MET emulator using polynomial interpolation has been added. This algorithm was not present in the existing emulator framework and enables smoother, resource-efficient computation of MET using a fitted interpolation curve.\r\n\r\nA corresponding extension was made to the existing MET producer to include this new interpolation-based method. This allows users to evaluate and deploy the interpolated MET algorithm directly in CMSSW workflows.\r\n\r\nThe PR also adds a new algorithm named JUMP (Jet Uncertainty-aware MET Prediction), which uses jet energy resolution information to correct MET in high pileup conditions. Both the producer and the emulator for JUMP were developed from scratch.\r\nDPS Note publicly available on CDS: CMS DP-2025/023\r\n\r\nThese additions aim to enhance MET performance in challenging pileup scenarios and facilitate hardware emulation and validation of new MET strategies.\r\n\r\nPR validation:\r\nAll new algorithms have been tested using the FastPUPPI\r\nUsed /eos/cms/store/cmst3/group/l1tr/FastPUPPI/14_2_X/fpinputs_140X/v0/TTToSemileptonic_PU200\r\n\r\nTo support the validation of these algorithms, reference plots prepared by @thesps can be found here:\r\nhttps://ssummers.web.cern.ch/CMS/TauJetsMET/V44JUMP/ba40f8a/\r\n\r\n@thesps ", "branch": "master", "changed_files": 6, "comments": 27, "commits": 6, "created_at": "1749789217", "deletions": 202, "labels": ["l1-pending", "pending-signatures", "orp-pending", "tests-started", "upgrade-pending", "requires-external", "code-checks-approved"], "milestone": "CMSSW_15_1_X", "number": 48308, "release-notes": [], "review_comments": 37, "state": "open", "title": "[L1T] Update L1T MET and Add JUMP algorithm (Phase 2)", "updated_at": "1757441189", "user": "JunwonTomOh"}