{"additions": 123, "auther_ref": "EGM_EtaExtendedEle", "auther_sha": "ffa1bfecee8a3c03abf0c582101904011d33604f", "author": "swagata87", "body": "#### PR description:\r\n\r\nThis PR aims to improve electron reconstruction efficiency in high eta region, 2.5<|eta|<3.0. \r\n\r\nMotivation: EEEs can be important for many analyses, one example is measurement of weak mixing angle using forward-backward asymmetry of DY events.\r\n \r\nCurrently, electron reconstruction efficiency sharply falls off after around |eta|=2.5. This is because GSF tracking tends to fail in high eta, as the outer tracker coverage ends and we are left with only the inner tracker layers. Two parameters were identified, whose cut-values need to be relaxed, to improve GSF tracking efficiency in high eta region; they are the following:\r\n```\r\n(1) process.TrajectoryFilterForElectrons.minimumNumberOfHits = cms.int32(3)  ### default was 5\r\n(2) process.GsfElectronFittingSmoother.MinNumberOfHits = cms.int32(3)  #### default was 5 \r\n```\r\nHowever, this change was made only for high eta electrons, keeping the parameters' cut values same in low eta. \r\n\r\nNote that while we expect EEEs to enter 12_1 and MC samples to be produced with it, the PF Electron ID and energy regression for EEEs would likely be suboptimal. So a temporary switch is added to prevent EEEs to enter particle flow. When 12_1 samples will be available, we will retrain PF electron ID and energy regression including EEEs, and we will put in the updates in 12_2 while removing this switch and allowing EEEs to the particle flow. This is done as an intermediate, safe approach.\r\n\r\n#### PR validation:\r\nSome checks were made using 1000 double-electron gun events. \r\nThis plot shows electron eta distribution(from AOD); default CMSSW in blue and after merging this branch in green. More electrons are reconstructed in high eta, but there is no change in other regions.\r\n<img width=\"500\" alt=\"Screen Shot 2021-09-16 at 19 19 56\" src=\"https://user-images.githubusercontent.com/5052706/133657017-71110abc-4b26-4629-b6e4-0910b577d51f.png\">\r\n\r\nThis is general track eta distribution(from AOD), showing no change, as intended.\r\n<img width=\"500\" alt=\"Screen Shot 2021-09-16 at 19 30 01\" src=\"https://user-images.githubusercontent.com/5052706/133658106-45f7c932-754a-4fd6-a2db-10bfbff217c9.png\">\r\n\r\n`runTheMatrix.py -l  12434.0 ` ran fine (ttbar 2023)\r\n\r\nThis PR is not a backport.\r\nBackport not needed.\r\n\r\nThis work is done together with Shilpi and Yash; in collaboration with PF group (Josh, Kenichi, Kenneth et. al) and with help from tracking experts (Mia et. al). Thanks to Marino(HLT-STORM) for helping with HLT customisation. \r\n", "branch": "master", "changed_files": 9, "comments": 21, "commits": 10, "created_at": "1631807607", "deletions": 11, "labels": ["reconstruction-pending", "hlt-pending", "pending-signatures", "orp-pending", "tests-started", "code-checks-approved"], "milestone": "CMSSW_12_1_X", "number": 35309, "release-notes": [], "review_comments": 21, "state": "open", "title": "[EGM] Eta-Extended-Electrons (EEE)", "updated_at": "1632430302", "user": "swagata87"}