{"additions": 637, "auther_ref": "CaloL1OfflineDQM", "auther_sha": "befefd9ba12b6071fd43d5920ef23f2649ac33cf", "author": "aloeliger", "body": "#### PR description:\r\n\r\nA new CaloL1 DQM offline module in \"Global\" format has been introduced to comply with the concurrent LS processing introduced for the offline DQM as a part of #25090. This offline module is largely a duplicate of the online version of the L1TStage2CaloLayer1 module, but with 7 monitoring elements removed, and changed to be a DQMGlobalEDAnalyzer instead of DQMOneEDAnalyzer. Monitoring elements have been moved to a dedicated CaloL1Information namespace and data structure as part of the DQMGlobalEDAnalyzer template. A duplicate of the online _cfi.py has been created for the offline module, and the overall offline L1DQM sequence L1TriggerDqmOffline_cff.py has been adjusted to add this module into the offline workflow.\r\n\r\n#### PR validation:\r\n\r\nAll code compiles, and I have checked that a min bias data workflow reproduces the same histograms between the old online module and new offline module. I have also checked runTheMatrix test workflows and any failures seem due to failing to find or open remote files. As well, the PR seems to pass the basic test procedure suggested in the [CMSSW PR instructions](https://cms-sw.github.io/PRWorkflow.html).\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nThis PR is not a backport", "branch": "master", "changed_files": 4, "closed_at": "1604388838", "comments": 44, "commits": 4, "created_at": "1601970673", "deletions": 0, "labels": ["code-checks-approved", "comparison-available", "dqm-pending", "l1-pending", "orp-pending", "pending-signatures", "requires-external", "tests-approved"], "milestone": "CMSSW_11_2_X", "number": 31678, "release-notes": [], "review_comments": 3, "state": "closed", "title": "Add new CaloL1 offline DQM module and configuration", "updated_at": "1604388838", "user": "aloeliger"}