{"additions": 50, "auther_ref": "composition_es_source_fix", "auther_sha": "8bdd5b1294718d9522519b1f3218a284fe7c8e47", "author": "CTPPS", "body": "This PR contains fixes and improvements of CTPPSCompositeESSource which is used in the [PPS direct simulation](https://twiki.cern.ch/twiki/bin/viewauth/CMS/TaggedProtonsDirectSimulation). The chages include:\r\n 1) add produce methods for alignment ES data\r\n 2) add missing findingRecord calls for geometry ES data - this bug prevented updating geometry up to now\r\n 3) generate new profile only once per transition - performance optimisation\r\n 4) improved documentation\r\n\r\n\r\n#### PR validation:\r\n\r\nTwo comparison sheets are attached below. Blue = before this PR, red dashed after this PR.\r\n\r\n[dirsim_cmp.pdf](https://github.com/cms-sw/cmssw/files/5801519/dirsim_cmp.pdf): test of the PPS direct simulation. Most of the differences are compatible with a different order of random-number generation due to the point 3) above. The large difference in the top-right corner is expected. Up to now (blue histogram), the geometry was not updated and stayed in the 2016 pre-TS2 configuration where all RPs in sector 56 were functional and inserted closed to the beam. With this PR (red dashed histogram), the geometry is updated during the simulation, thus also sampling the 2016 post-TS2 period, where one RP in the sector 56 was not functional and not inserted in the LHC beam pipe. This obviously reflects in lower yield of reconstructed protons in that sector.\r\n\r\n[reco_cmp.pdf](https://github.com/cms-sw/cmssw/files/5801521/reco_cmp.pdf): test of Run2 data reco - no change, as expected.\r\n\r\n\r\n", "branch": "master", "changed_files": 1, "closed_at": "1610630213", "comments": 7, "commits": 1, "created_at": "1610445916", "deletions": 11, "labels": ["alca-approved", "code-checks-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "99e7f4bafb11e9fc4b98cf8926dfcbba223cd78e", "merged_at": "1610630213", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 32640, "release-notes": [], "review_comments": 0, "state": "closed", "title": "PPS: fix/improvement of CompositeESSource", "updated_at": "1610630213", "user": "jan-kaspar"}