{"additions": 581, "auther_ref": "RemoveMutableHcalDbHelperClean", "auther_sha": "817d9ce0e8893c0fdc96efcb1f8803df00339248", "author": "kpedro88", "body": "Several HCAL DB objects (`HcalElectronicsMap`, `HcalDcsMap`, `HcalFrontEndMap`, `HcalSiPMCharacteristics`) follow a common pattern: a serialized vector of items along with one or more transient vectors of the same items sorted in a different order. Because these objects were allowed to be constructed piecemeal (one item inserted at a time), it was necessary to declare the transient members as mutables (with the associated locking, etc.) in case the object was modified while being accessed by multiple threads and the transient members needed to be re-sorted. However, in practice this sort of modification would only occur when the objects were being constructed (usually for insertion into the conditions database), never during subsequent accesses by consumers.\r\n\r\nTo make the code simpler and easier to understand/maintain, I reorganized these four objects so they must be constructed in one shot. Each class has an associated `Helper` which collects all the inserted items. When the class is constructed, it automatically fills and sorts the transient members. If the class is initialized from the conditions database, the `REGISTER_PLUGIN_INIT` macro is used to ensure the transient members are properly instantiated. The requirement of one-shot construction led to a new function in `HcalDbASCIIIO` called `createObject()` which returns a `unique_ptr` (instead of `getObject()` which acts on the contents of a `unique_ptr` created elsewhere).\r\n\r\nI also noticed some duplicate functionality (`sortById()` and `findById()` functions), which I simplified into common template functions in a new `HcalObjectAddons` namespace.\r\n\r\nThis PR should not change any physics results - code refactoring/improvement only.\r\n\r\nattn: @abdoulline, @bsunanda, @Dr15Jones ", "branch": "master", "changed_files": 21, "closed_at": "1494944923", "comments": 27, "commits": 8, "created_at": "1493835516", "deletions": 647, "labels": ["alca-approved", "comparison-available", "db-approved", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "64bd2fdb6a157711df8ca97b4a173a16b92894b2", "merged_at": "1494944923", "merged_by": "cmsbuild", "milestone": "CMSSW_9_2_X", "number": 18556, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Remove mutables from HCAL DB objects and reduce code duplication", "updated_at": "1494944923", "user": "kpedro88"}