{"additions": 58, "auther_ref": "CCCTF_Tuning", "auther_sha": "0a45240c747368357d6961929f777138eb4453bc", "author": "rovere", "body": "## Executive Summary\n\nThis PR is the first tuning of the cluster charge cut (CCC) that tries to recover hits-on-track on real data, while keeping the same performances in terms of efficiency, fake-rate and timing on Monte Carlo.\n\nIt is not excluded that some minor fine tuning will be needed in the course of the release, depending also on the outcome of the full release validation with this first set of changes.\n### Monte Carlo\n\nThe standard set of tracking MTV validation plots for a TTBar sample (35PU@25ns) that compares this PR against a recent IB are available at this [link](https://roverepublic.web.cern.ch/roverepublic/MTV_ProposedTuning2/). The main points to notice are:\n- overall the performance in terms of efficiency is quite the same, except for a small loss at very low pt (could be a further fine-tune will come trying to recover also this tiny fraction) [see here](https://roverepublic.web.cern.ch/roverepublic/MTV_ProposedTuning2/plots_summary_highPurity/summary.pdf)\n- The fake-rate increase from an ~8% to a ~10%, but this, in a sense, is kind of unavoidable, given the nature of this PR (recovering hits implies also adding some fake ones, unfortunately). Again, [see here](https://roverepublic.web.cern.ch/roverepublic/MTV_ProposedTuning2/plots_summary_highPurity/summary.pdf) for plots. Anyway we believe this level of fake is still ok, especially since it is computed with quite loose requirements. And we do not want to hold this any further.\n- in terms of timing, from private measurements, the reco time goes from 7.9 sec/ev to 8 sec/ev, so basically we do not observe any slowdown.\n- Unfortunately the MC simulation does not properly simulate the loss of hit-collection-efficiency we see on data: in order to see the real effects, we also privately reconstructed 1K event from 260627.\n### Data (SingleMuon, Run 260627)\n#### Hits on Track\n\nThe results are nicely summarized [here](https://www.dropbox.com/s/07wcxcccy5m1nxh/hits.png?dl=0)\n- Legend:\n  - black: this PR\n  - blue: an intermediate tuning\n  - orange: recent IB w/o this PR\n  - red: prompt-reco on the full statistics\n- Comments\n  - this PR recovers ~2 hits on track on the full eta range (black vs orange).\n  - the red is above the orange simply because it integrates the full run, including the last part at \"low-lumi\"\n#### Hit Efficiency\n\nThe plot is available [here](https://www.dropbox.com/s/hqdfptbbpr12la3/globalEfficiencies.png?dl=0). There are clear improvements in all SiStrip detectors, especially in TIB and TOB. More plots available from within CERN only [here](http://mrovere-dqmgui-slc6.cern.ch:8060/dqm/dev/start?runnr=260627;dataset=/SingleMuon/ReReco260627_ProposedTuning2_80X/DQMIO;sampletype=offline_data;filter=all;referencepos=overlay;referenceshow=all;referenceobj1=other%3A%3A/RelValTTbar/CMSSW_8_0_0_ProposedTuning2/DQMIO%3A;referenceobj2=other%3A%3A/SingleMuon/ReReco260627_ProposedTuning_80X/DQMIO%3A;referenceobj3=other%3A%3A/SingleMuon/ReReco260627_80X/DQMIO%3A;referenceobj4=other%3A%3A/SingleMuon/Run2015D-PromptReco-v4/DQMIO%3A;search=effi;striptype=object;stripruns=;stripaxis=run;stripomit=none;workspace=Everything;size=M;root=Tracking/TrackParameters/highPurityTracks/pt_1/HitEffFromHitPattern;focus=;zoom=no;).\n#### SiStrip Cluster Charge Plots\n\nFew plots are available [here for TIB](https://www.dropbox.com/s/uef4x5izi8k5075/TIB_Charge.png?dl=0) and [here for TOB](https://www.dropbox.com/s/hgyhxziw3l84cy1/TOB_Charge.png?dl=0). From these plots it is quite clear the effect of the current PR.\n#### Timing\n\nTiming wise, I observed no significant slowdown comparing 80X vanilla reco and 80X+this PR reco.\n## New CCC Logic\n\nThe cluster charge cut is now applied in 2 different ways:\n- as en estimator, while deciding if a hit is compatible or not. This is the CCC that we have been using during 2015@25ns data taking. For the first 4 iterations the threshold of this cut has been lowered to 800 (was 1620/1945), while for all the latter, the thresholds are identical to what was already there.\n- as a trajectory filter. The first 4 iterations will accept at most 2 hits (either consecutive or not) whose charge is in the range 800;1620 (the current Loose threshold). The exception is the LowPt iteration, that will only accept one such hit (the reason being that there is not much gain in pushing it up to 2 for this iteration).\n- All the logic beyond the first 4 iterations has been unchanged, in order to contain timing and fake-rate.\n## Miscellanea\n\nThis PR contains also a customise for HLT in order to avoid crashes@HLT due to the fact that a parameter has been changed from a simple double to a refToPset_, in order to keep the symmetry with all other CCC cuts. I leave the \"integration\" of the customize into the HLT Menu to HLT experts\n\n@mtosi \n", "branch": "CMSSW_8_0_X", "changed_files": 12, "closed_at": "1450053058", "comments": 28, "commits": 11, "created_at": "1449603194", "deletions": 16, "labels": ["comparison-available", "fully-signed", "hlt-approved", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "a809fadc2466e1b71be16290fb7e99fe810837ca", "merged_at": "1450053058", "merged_by": "cmsbuild", "milestone": "CMSSW_8_0_X", "number": 12718, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Ccctf tuning", "updated_at": "1450101160", "user": "rovere"}