{"additions": 340, "auther_ref": "from-CMSSW_12_1_X_2021-08-04-1100-CCLUT-script-use9bitquality", "auther_sha": "ce8cc4feb481f09677b86b53c82031d80ea4e574", "author": "dildick", "body": "#### PR description:\r\n\r\nThe CCLUT algorithm was implemented in Virtex-6 OTMBs ME1234/1. The older TMBs (ME1/3, ME1234/2) are based on Virtex-2 (XC2V4000). Presently, the logic resources are so strained that we have to simplify parts of the CCLUT algorithm in order to fit. \r\n\r\nTo this end we're developing **CCLUT Version 2.0**. Two changes are made to reduce the resource usage: \r\n* The 9-bit quality word is removed from the LUT. This word is actually not even used in the simulation. Nor is it used in firmware. So it was basically an empty 9-bit word. This reduces the size of the result space from 18 bits to 9 bits. \r\n* In addition, we're adding 11-bit hit patterns (as opposed to 12-bit patterns). See https://github.com/cms-data/L1Trigger-CSCTriggerPrimitives/pull/12. This reduces the size of the LUT by half.\r\n\r\nWe have decided to only have CCLUT version 2.0 in the OTMBs, but not yet in the TMBs (and not have it for start-up Run-3). R&D still ongoing how to fit the logic in the FPGA. We will split up TMB from OTMB in the code with separate switches. An update was made in the `CSCL1TPLookupTableEP` producer module so that it loads the text files for `CSCL1TPLookupTableCCLUT` from the correct directory.\r\n\r\nI tested the modified CCLUT code on data from this Summer to verify that it still works. That appears to be the case indeed. \r\n[CSC_dataVsEmul_B904_Cosmic_Run_210701_135109.pdf](https://github.com/cms-sw/cmssw/files/7182825/CSC_dataVsEmul_B904_Cosmic_Run_210701_135109.pdf)\r\nI should note that the LCT quality plot does not look as expected. This is because the CSC algorithm assumes a 2-bit quality code, and the firmware uses a 3-bit quality code. I will try to synchronize the definitions soon.\r\n\r\nThe code is not enabled yet, and is being tested with the B904 ME1/1, ME2/1 and ME4/2 test-stand in the coming weeks. Results from a test data run taken on September 17 shows poor agreement between data and emulation. In particular the comparator codes do not match yet.\r\n[CSC_dataVsEmul_B904_Cosmic_Run_210917_122106.pdf](https://github.com/cms-sw/cmssw/files/7188176/CSC_dataVsEmul_B904_Cosmic_Run_210917_122106.pdf)\r\n\r\n#### PR validation:\r\n\r\nCode compiles. No LUTs for simulation are affected. There should be no change in any workflow.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nN/A\r\n\r\nBefore submitting your pull requests, make sure you followed this checklist:\r\n- verify that the PR is really intended for the chosen branch\r\n- verify that changes follow [CMS Naming, Coding, And Style Rules](http://cms-sw.github.io/cms_coding_rules.html)\r\n- verify that the PR passes the basic test procedure suggested in the [CMSSW PR instructions](https://cms-sw.github.io/PRWorkflow.html)\r\n\r\n@tahuang1991 ", "branch": "master", "changed_files": 18, "comments": 49, "commits": 5, "created_at": "1628092811", "deletions": 108, "labels": ["simulation-pending", "l1-pending", "alca-approved", "daq-approved", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_12_1_X", "number": 34780, "release-notes": [], "review_comments": 0, "state": "open", "title": "CCLUT version 2.0 for the Run-3 CSC trigger (CCLUT-18)", "updated_at": "1632547867", "user": "dildick"}