{"additions": 561, "auther_ref": "13_1_X_pNetTaus", "auther_sha": "663d2a5a7b7a09d0523cd572e7b0262def00b71d", "author": "mbluj", "body": "#### PR description:\r\n\r\nThis PR adds ParticleNet info (extended in #40745) to taus stored in NanoAOD. The additional information are as follows:\r\n* ParticleNet discriminators vs jets, electrons and muons,\r\n* decay mode corresponding with the ParticleNet tau node with the highest score,\r\n* correction for tau pt,\r\n*  charge assignment confidence (signed),\r\n * ParticleNet scores for individual decay-modes (normalised to the sum of the scores for all tau nodes).\r\n\r\nIn addition to adding the above information to already existing taus reconstructed with the HPS algorithm (and passing the loosest WP of at least one of its discriminants vs jets) \"recovery\" taus are added which correspond with CHSAK4 jets with ParticleNet discriminant vs jets passing WP (>0.05) with an efficiency of ~97% for genuine taus. Also HPS taus passing this WP of ParticleNet vs jet discriminant and not passing other discriminants vs jets are stored (however their fraction is at permille level).\r\n\r\nThe ParticleNet information and \"recovery\" taus are added with a new \"hybrid tau\" producer which matches CHSAK4 jets with ParticleNet taggers with HPS-taus. The producer can be in principle used also as part of miniAOD sequences.\r\n\r\nBackport of this PR is planned to CMSSW_13_0 series.\r\n\r\n#### PR validation:\r\n\r\nTested successfully with custom NanoAOD workflows based on standard NanoAOD setups for RunIISummer20UL18NanoAODv11 and Run3Summer22NanoAODv11 as well as with the \"limited\" set of matrix tests. \r\n", "branch": "master", "changed_files": 4, "closed_at": "1682606054", "comments": 17, "commits": 10, "created_at": "1681381868", "deletions": 24, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "xpog-approved", "tau"], "merge_commit_sha": "b0bd03ff76cdaba944df86c0199d6c393c3b0c93", "merged_at": "1682606054", "merged_by": "cmsbuild", "milestone": "CMSSW_13_1_X", "number": 41333, "release-notes": [], "review_comments": 17, "state": "closed", "title": "Add ParticleNet info to taus in NanoAOD", "updated_at": "1682606054", "user": "mbluj"}