{"additions": 51, "auther_ref": "checkAncestorsBeforeAssert", "auther_sha": "4b1e652e458fcedae4969f225d93890c96fb1fe7", "author": "wddgit", "body": "#### PR description:\r\n\r\nWhen using secondary file input it is required that the secondary files be ancestors of the primary files. There is a check that exists for this that will throw an exception with a helpful message if this requirement is violated. Unfortunately, there was a bug that allowed an assertion to fail when the requirement was violated before the check was done.\r\n\r\nThis moves the assertion until after the check is completed (see checkHistoryConsistency in PoolSource.cc). The changes are done such that the behavior is identical in every function stack different than the one that caused the problem.\r\n\r\nIt came out a little more complex than I had hoped because there were multiple other code stacks and various dependencies that prevented just moving a single line of code. There were a couple alternatives:\r\n\r\n1. Simply remove the assert. There will be an exception in every case that I know about even without the assert. It is only there as a safety precaution in some complex code.\r\n\r\n2. Refactor the code. It might come out simpler, but the changes would be more extensive.\r\n\r\nSee #33716 and https://hypernews.cern.ch/HyperNews/CMS/get/edmFramework/3921/1/1/1/1/1/1/1/3/2/1.html\r\n\r\n#### PR validation:\r\n\r\nRelies on existing tests. I also manually tested the changes on the input files where the problem was originally reported.\r\n", "branch": "master", "changed_files": 8, "closed_at": "1621291747", "comments": 7, "commits": 1, "created_at": "1621013384", "deletions": 28, "labels": ["code-checks-approved", "core-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "0be4768008e1a18abd9a09280043c1760e87f8cc", "merged_at": "1621291747", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 33736, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Delay assert until after secondary file ancestor check", "updated_at": "1621291748", "user": "wddgit"}