{"additions": 1509, "auther_ref": "gs-vstudies2", "auther_sha": "2e3c3aae982b5f9b4c76768e1a5e12ee4dd5460f", "author": "gsorrentino18", "body": "#### PR description:\r\nThis PR introduces a new plugin for studying the association between RECO and SIM vertices, and between tracks and vertices.\r\n\r\nIt has been developed in the context of the MTD validation and it is based on the private code for vertex analysis, by @werdmann, and on the PrimaryVertexAnalyzer4PUSlimmed plugin [1], by @Rovere.\r\n\r\nThe basic structure of the code is described below:\r\n\r\n-First, two auxiliary classes are built, named simPrimaryVertex and recoPrimaryVertex, respectively holding the information of simulated and reconstructed vertices.\r\n-Reconstructed tracks are associated to a SIM vertex in the getMatchedTP function, using tracking particles.\r\n-The association between a SIM and a RECO vertex is done in the matchReco2Sim function, that works as follows:\r\n\r\nFor each RECO vertex, a loop on SIM vertices and then a loop on the reconstructed tracks of the RECO vertex are done. If a track is matched to a tracking particle of a given SIM vertex, two weights (named wos and wnt) are evaluated for that vertex, exploiting the weight with which the track has contributed to the vertex-fit. The RECO vertex is then matched with the SIM that has the highest wos. If the wos-matching leaves a SIM vertex unmatched, the algorithm tries to perform the matching using wnt weight. \r\n\r\n-Vertices and tracks plots are filled; resolution plots and pulls for tracks are filled in different categories of pT and MTD MVA.\r\n-An optional set of plots for dedicated studies has also been implemented, which can be switched on using the appropriate flag.\r\n\r\n[1] https://github.com/cms-sw/cmssw/blob/master/Validation/RecoVertex/src/PrimaryVertexAnalyzer4PUSlimmed.cc\r\n\r\n#### PR validation:\r\n\r\nThe new plugin has been tested in the CMSSW_12_1_0_pre3. \r\n\r\nThe new plots adds:\r\n23.47 KiB MTD/Vertices\r\nto the previous size of all the MTD plots:\r\n1135.12 KiB MTD/ETL\r\n241.82 KiB MTD/BTL\r\n17.45 KiB MTD/Tracks\r\n\r\nThe following plots of time resolution for matched tracks and vertices have been obtained with 10 TTbar events with 200PU (WF 34834.0).\r\n\r\n![vres](https://user-images.githubusercontent.com/39314729/135423392-39290bd2-9cfb-4fbf-9d24-2049e224cdaa.png)\r\n![trackres-highMVA](https://user-images.githubusercontent.com/39314729/135423396-92cf0334-3f26-48a0-89cd-992aa59c292f.png)\r\n", "branch": "master", "changed_files": 4, "closed_at": "1633081228", "comments": 8, "commits": 3, "created_at": "1632986355", "deletions": 4, "labels": ["dqm-approved", "simulation-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "e296573a4d38af085640c8878f7c09368e5dc835", "merged_at": "1633081228", "merged_by": "cmsbuild", "milestone": "CMSSW_12_1_X", "number": 35482, "release-notes": [], "review_comments": 0, "state": "closed", "title": "New DQM plugin for monitoring the association of vertices and tracks", "updated_at": "1633081228", "user": "gsorrentino18"}