{"additions": 97, "auther_ref": "ReproducablePS_1320pre1", "auther_sha": "ee4e6daa10dffa26f892f195d5178407269b49bf", "author": "Sam-Harper", "body": "#### PR description:\r\n\r\nThis PR adds an option to HLTPrescaler to make it reproducible when doing repeated measurements. \r\n\r\nHLTPrescaler has a seed which is the event number of the first module the event sees. This breaks coherence between streams to have a uniform sampling in time.  The downside is that the prescales are not reproduceable between jobs (unless single stream) which can complicate measurements sometimes, for example timing measurements as an increase may be due to an expensive path running or not.  It would be nice to have the ability to rule this out when comparing measurements and understand how big of an effect this is. \r\n\r\nThe downside of this is that this option is dangerous in that it should not be applied to p5 running and if it was mistakenly done, it would very difficult to impossible to spot. \r\n\r\nSo we need to make sure that there are fool proof mechanisms to stop it even being deployed online. I would suggest two things\r\n\r\n1) make it unsetable in confdb, this is why I made it optional, its my understanding this wont even show up in the confdb gui\r\n2) add a menu check in the hilton for this\r\n\r\nWhat do people think?\r\n\r\n\r\n\r\n#### PR validation:\r\n\r\nI added a config  testHLTPrescalerSeeds_cfy.py\r\n\r\nThe following is tests based on 10000 events, a prescale of 10 and 10 streams.  The default option (achieved by either not specifing or specifying negative) continues to be random.  The reproducible one now shows the expected clumping behaviour. \r\n\r\nEvent numbers selected with seed not specified:\r\n![image](https://github.com/cms-sw/cmssw/assets/5021403/4039f03f-b76f-470c-8861-55b473865223)\r\nOutput with  selected with seed set to -1\r\n![image](https://github.com/cms-sw/cmssw/assets/5021403/aed432dc-a30b-4e49-9a20-0185f3d56ea1)\r\nOutput with  a seed of 0\r\n![image](https://github.com/cms-sw/cmssw/assets/5021403/2dc92640-cc05-4aec-8d8b-149be2e6bfa9)\r\n\r\n", "branch": "master", "changed_files": 3, "closed_at": "1705493954", "comments": 6, "commits": 1, "created_at": "1705492690", "deletions": 1, "labels": ["hlt-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_14_0_X", "number": 43730, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Adding an option to make the HLTPrescaler reproducable for studies", "updated_at": "1705494208", "user": "Sam-Harper"}