{"additions": 1387, "auther_ref": "ROOT_MPI_HOST_CUDA", "auther_sha": "426803df17ab8426d558cb668124f465bd8e6d3b", "author": "AliinCern", "body": "#### Program description:\r\nIn this program, we transfer data from one machine to GPU remotely in different approaches using MPI and CUDA.\r\n\r\n#### Program Validation:\r\nWe have successfully compiled it with scram b runtests\r\n\r\n#### Program Mechanism:\r\nThere are three approaches of transferring data, we call them parts:\r\nPart 1: Transfer data from Root pageable memory to Host pageable memory using MPI, then allocate memory in GPU using \r\n            cudaMalloc. Finally, transfer data from Host pageable memory to GPU using cudaMemcpy.\r\nPart 2: Transfer data from Root pageable memory to Host Pinned memory using MPI and cudaMallocHost, then allocate \r\n            memory in GPU using cudaMalloc. Finally, transfer data from Host Pinned memory to GPU using cudaMemcpy.\r\nPart 3: Allocate memory in GPU using cudaMalloc, then transfer data from Root pageable memory to GPU memory \r\n            using MPI.\r\n\r\n#### Program Measurements:\r\nThere are seven sections that we have measure time elapse:\r\n1) Time preparation from Root To Host.\r\n2) Time preparation from Host to GPU.\r\n3) Time operation on GPU, measured by Root.\r\n4) Time operation on GPU, measured by Host.\r\n5) Time operation on GPU, measured by Device.\r\n6) Time preparation from Host to Root.\r\n\r\n#### Program command line options are:\r\n[-np] number of processes or processors that you would like to run.\r\n[-s] size of vectors that you would like to send, the type is float and there are two vectors.\r\n[-t] number of repeating task on the Device(GPU) side.\r\n[-a] number of repeating the part.\r\n[-p] choice of what part to run in the program.\r\n[-q] print Stander Deviation.\r\n[-f] save the results into a file for each part.\r\n[-h] for help.", "branch": "master", "changed_files": 2, "comments": 1, "commits": 1, "created_at": "1647969083", "deletions": 1, "labels": ["pending-signatures", "tests-pending", "orp-pending", "code-checks-rejected", "heterogeneous-pending"], "milestone": "CMSSW_12_4_X", "number": 37309, "release-notes": [], "review_comments": 0, "state": "open", "title": "mpiCudaGeneric is a program transfer data from a machine to another with GPU using MPI and CUDA.", "updated_at": "1647970109", "user": "AliinCern"}