{"additions": 458, "auther_ref": "mtvMva", "auther_sha": "e10a1e6dfd5fb1966cb28aefc538cae2520aec59", "author": "makortel", "body": "This PR extends MultiTrackValidator (and the plotting scripts) to optionally monitor track selection MVA variables. The motivation is to provide a monitoring tool for track selection MVA tuning.\r\n\r\nThe monitoring is enabled only for the `trackValidatorBuildingTrackingOnly` module (monitoring the \"built tracks\"), because the MVA variables are easily available for those, and the track collection of an iteration N is not biased by the existing track selection of itereration N. The plots include\r\n* Distributions of the MVA variable for true and fake tracks\r\n* Efficiency and fake rate vs. cut on the MVA variable\r\n  * for this I had to extend `DQMGenericClient` to be able to do the accumulation for the \"cumulative histograms\" also in the other direction\r\n     * not sure if the \"ascending\"/\"descending\" nomenclature is the clearest one, better suggestions are welcome\r\n  * from these we can make ROC curves\r\n* Plotting includes also the selection efficiencies of true and fake tracks as a function of the cut to allow direct cross-check with TMVA plots\r\n* Iterations with multiple MVA selections (like initialStep) are treated as follows\r\n  * For the first MVA, histograms are filled for all tracks\r\n  * For the second MVA and onwards, histograms are filled only for the not-yet-selected tracks. There are separate histograms for loose-selected and highPurity-selected tracks.\r\n  * The order of MVA's is the one in `ClassifierMerger.inputClassifiers` of that iteration.\r\n\r\nIn addition this PR fixes a minor bug in `makeTrackValidationPlots.py` (without any options it makes plots for the \"pT>0.9 GeV\" folders, while that should be active only with `--ptcut` option).\r\n\r\nTested in CMSSW_8_1_0_pre15, no changes expected in standard workflows. New histograms should appear in \"trackingOnly\" workflows (e.g. 1325.1, 10024.1), but there should be no changes in existing histograms.\r\n\r\n@rovere @VinInn ", "branch": "CMSSW_8_1_X", "changed_files": 15, "closed_at": "1479226800", "comments": 17, "commits": 8, "created_at": "1478867636", "deletions": 30, "labels": ["comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "35c450c5824b1ff9018736cda556831e5b7e4422", "merged_at": "1479226800", "merged_by": "cmsbuild", "milestone": "Next CMSSW_8_1_X", "number": 16559, "release-notes": [], "review_comments": 1, "state": "closed", "title": "Monitor track selection MVAs in MultiTrackValidator", "updated_at": "1479385165", "user": "makortel"}