{"additions": 834, "auther_ref": "timingupdate93x", "auther_sha": "213e0b30330353334956383b27ad143b4114420a", "author": "bendavid", "body": "Update low level assignment of MIP timing to tracks.  (Implement acceptance cuts, improved handling of fake tracks, and fixes the handling of displaced tracks)\r\n\r\nUpdate 4D Vertexing (including the changes in https://github.com/cms-sw/cmssw/pull/19935)\r\n\r\nUpdates to integration of timing in reconstruction (but no change to default behaviour or collections beyond the time stored in pfcandidates, which remains unused downstream)\r\n\r\nAddition of timing to packed candidates  (but this is only partially useful unless miniaod is moved to the 4d vertices, currently not possible to have both sets of vertices in parallel, so miniaod stays with the non-timing vertices by default)\r\n\r\nAODSIM produced with this pull request included can be easily processed into consistent miniaod with timing for further timing studies, so it would be useful to have for further TDR production.\r\n\r\nThere should be no changes to default reco/collections/miniaod beyond the not-used-downstream timestamps in the PFCandidates and PackedCandidates as said, but also understood if the code changes are considered too large to integrate for HGCal TDR production.  These changes accumulated into our development branches for quite a while because we had so far not managed to disentangle them from changes to the default reco behaviour as finally done here.\r\n\r\n@lgray\r\n", "branch": "master", "changed_files": 35, "closed_at": "1506156824", "comments": 203, "commits": 51, "created_at": "1504196215", "deletions": 352, "labels": ["analysis-pending", "code-checks-approved", "comparison-available", "core-approved", "orp-pending", "pending-signatures", "reconstruction-approved", "simulation-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "958576f46d054819e1e27640cfce7907534ef41e", "merged_at": "1506156824", "merged_by": "cmsbuild", "milestone": "CMSSW_9_4_X", "number": 20338, "release-notes": [], "review_comments": 73, "state": "closed", "title": "Updates to precision timing integration in reconstruction and miniaod", "updated_at": "1506156824", "user": "bendavid"}