{"additions": 590, "auther_ref": "l1t-1042", "auther_sha": "d5cd6f16e7057b60a6eefa608c2f20d64ae8e2df", "author": "cecilecaillol", "body": "#### PR description:\r\n\r\nThis PR adds to the DemonstratorTools package the ability to write test vectors for the GTT to GT links. This is in addition to the existing files which contain the TF to GTT inputs, the converted track words created by the GTT common framework, and the GTT to Correlator Layer 1 link. Following the interface document, there are 4 links in total represented in these new files. The links contain words for jets/sums, hadronic taus, light mesons, and isolated tracks/vertices. Some of the formats specified in the interface document have not been written yet. In those cases, 64-bit packets willed with 0s were added in place of the words. In order to check that the 64-bit hexadecimal packets written to the file were correct, a few more branches were added to the L1TrackObjectsNtuple. Local PR: https://github.com/cms-l1t-offline/cmssw/pull/1042\r\n\r\nIt also adds to the DemonstratorTools package the ability to write test vectors for outputs from the L1TrackSelectionProducer module. This emulates two firmware modules, one which filters tracks based on the track parameters and another which filters them based on their distance to the primary vertex. These two new files will be created in addition to all the existing test vectors. The format for these files matches the existing track inputs, but with certain track words zeroed out if the tracks are not selected. Local PR: https://github.com/cms-l1t-offline/cmssw/pull/1043\r\n\r\nRight now the L1TrackerEtMissEmulationProducer and the DemonstratorTools package assume a TF to GTT link ordering of the 18 links to have the first 9 be from all of the phi sectors and to care the -eta tracks. The second 9 links would carry the positive eta tracks. However, the GTT firmware and the TF group have been assuming that the -eta and +eta links would be paired, where the first two carry -eta and +eta for sector 0, the second pair does the same for sector 1, and so on. This PR also converts the code to using the latter scheme. Local PR: https://github.com/cms-l1t-offline/cmssw/pull/1044\r\n\r\n\r\n#### PR validation:\r\n\r\nFrom Alexx Perloff: \"A set of test vectors was created for the GTT. These test vectors were then compared to the emulator outputs saved in the L1TrackObjectNtuples. I checked by hand that the hexadecimal values saved in the test vectors corresponded to the floating point values saved in the ROOT ntuple (after appropriate un-digitization). I also compared these values to the floating point simulation values in the ROOT ntuple to make sure the simulation and emulation values were close. Everything seems to check out.\"\r\n\r\nThe code has also passed the recommended code checks:\r\n\r\nscram b code-checks\r\nscram b code-format", "branch": "master", "changed_files": 17, "closed_at": "1666586043", "comments": 34, "commits": 13, "created_at": "1663328666", "deletions": 66, "labels": ["l1-approved", "fully-signed", "tests-approved", "orp-approved", "upgrade-approved", "code-checks-approved"], "merge_commit_sha": "59b1cc4b08aa05bcca7c0e41a9cdd5132649ed1c", "merged_at": "1666586043", "merged_by": "cmsbuild", "milestone": "CMSSW_12_6_X", "number": 39422, "release-notes": [], "review_comments": 8, "state": "closed", "title": "[L1T] Phase-2, Create GTT to GT test vectors, and test vectors from the L1TrackSelectionProducer outputs", "updated_at": "1666586044", "user": "cecilecaillol"}