{"additions": 194, "auther_ref": "lumiruninfoproducer_ecalPUautoswitch", "auther_sha": "8b1c0b485b2ed3fc3ba052d3b809b27e2892cb46", "author": "bendavid", "body": "This supersedes https://github.com/cms-sw/cmssw/pull/6128.\n\nVery basic producer for LumiInfoRunHeader is added.  There are two different instances of this producer, one running in DIGI and the other in RECO, with different (configuration-level) behaviour.\n\nCurrently only the bunch spacing is filled.\n\nThe lumiInfoRunHeaderMC has the bunch spacing set at configuration level, with ConfigBuilder automatically setting it to match the configured pileup scenario.  (It runs BEFORE the mixing module in the digi sequence though, to facilitate the eventual plan of having the mixing module steer itself based on this product).  The producer can also be configured to treat the run number as if it were real data (for run-dependent mc purposes)\n\nThe lumiInfoRunHeader running in RECO has an if (isRealData) statement.  For data there is a hardcoded list of runs for now.  For MC the product is simply copied from lumiInfoRunHeaderMC.\n\nThe lumiInfoRunHeaderMC has been added to the sim event content, but I have NOT added the lumiInfoRunHeader yet to any reco or aod content (it is currently used as a transient product in any case in the ecal local reco).  Proper lumi event content configs should be created at some point to cover this.\n\nTested 50ns, 25ns, data, fastsim, and heavy ion workflows (plus the weird 101.0 that was problematic before)\n\nEcal local reco is also adapted to use the lumiInfoRunHeader to switch between 25ns and 50ns behaviour.\n", "branch": "CMSSW_7_3_X", "changed_files": 21, "closed_at": "1416387884", "comments": 12, "commits": 10, "created_at": "1415390158", "deletions": 14, "labels": ["comparison-pending", "dqm-approved", "fastsim-pending", "operations-pending", "pending-signatures", "reconstruction-rejected", "simulation-pending", "tests-rejected"], "milestone": "Next CMSSW_7_3_X", "number": 6281, "release-notes": [], "review_comments": 22, "state": "closed", "title": "Add placeholder producer for new LumiInfoRunHeader and use in EcalLocalReco", "updated_at": "1416389843", "user": "bendavid"}