{"additions": 833, "auther_ref": "zdc-tp-emulation-13_3_X", "auther_sha": "8f4459aa56486eb00e5ed441130744d1d3a99509", "author": "Michael-Krohn", "body": "#### PR description:\r\n\r\nThis PR performs the calculation of ZDC trigger primitives by emulating the calculation within HCAL uHTRs and is needed for the upcoming heavy ion data taking. The calculation pulls the relevant conditions from CondDB to calculate the look-up-tables (LUTs) on the fly and convert the ADC to energy in each ZDC trigger channel. The emulated ZDC digis are added to the simHcalTriggerPrimitiveDigis collection which are then passed to the L1Trigger/L1TZDC package and then on to the uGT. There are two ZDC digis that are passed to the uGT. These are the energy sums across each of the plus and minus sides of the ZDC detector. Individual digis are also created for the 18 individual ZDC channels (9 per side). These digis are not passed further up the chain to L1, but can be used to study possible new ZDC triggers in the future. The ZDC digis correspond to new HcalTrigTowerDetId's that have been defined with ieta=+/-42. The algorithm that calculates the ZDC energy sums matches the algorithm that is in the uHTR firmware.\r\n\r\nThe PR mimics the logic that was done in this PR#42634 (https://github.com/cms-sw/cmssw/pull/42634), except that the ZDC trigger primitive calculation is done within the existing HCAL software, which enables the easy access to on detector conditions, as well as verifying that the LUTs calculation are identical on-detector and off-detector.\r\n\r\n#### PR validation:\r\n\r\nA basic technical test was performed: runTheMatrix.py -l limited -i all --ibeos\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport, however we would like to submit a backport to 13_2_X", "branch": "master", "changed_files": 16, "comments": 40, "commits": 3, "created_at": "1695089883", "deletions": 368, "labels": ["alca-pending", "db-pending", "geometry-pending", "l1-approved", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_13_3_X", "number": 42818, "release-notes": [], "review_comments": 4, "state": "open", "title": "ZDC trigger primitive emulation and HCAL look up table generation", "updated_at": "1697210683", "user": "Michael-Krohn"}