{"additions": 408, "auther_ref": "exceptionTryToContinue", "auther_sha": "27df62ddfa8b0d999a83be4f560d4ea8dc0812dd", "author": "Dr15Jones", "body": "#### PR description:\r\n\r\nRemoved SkipEvent and FailPath exception handling in favor of TryToContinue. The new handling option will cause a job to continue on event processing if an exception associated to TryToContinue is thrown. For the event which had the exception, \r\n- If a module is marked as `shouldTryToContinue()` in the configuration, it will be eligible to be run even if a TryToContinue exception happens. Marked modules will also not propagate a TryToContinue exception to the rest of the system whether the exception happened during prefetching or while running the module. If a marked module  is on a Path, it will not propagate the exception to the Path. However, if another module on the Path is dependent on the throwing module and is not marked then the Path will still fail (see next item).\r\n- all Paths with a module that is directly or indirectly dependent on the module which threw will be marked as having an exception. Any modules on the Path which are directly or indirectly dependent upon the throwing module will not be run, unless the dependent module is marked `shouldTryToContinue()`. Any modules on the Path not already scheduled will not be run, including those marked as `shouldTryToContinue()`. Those which were scheduled and independent of the thrown module will still be run.\r\n- Unscheduled modules which depend on the throwing module will not be run, unless they are marked as `shouldTryToContinue()`. Unscheduled modules which are independent may still be run if their data is requested.\r\n\r\n#### PR validation:\r\n\r\nAll the framework unit tests (including the newly added ones) pass.", "branch": "master", "changed_files": 28, "closed_at": "1692888907", "comments": 54, "commits": 9, "created_at": "1690910349", "deletions": 133, "labels": ["alca-approved", "core-approved", "dqm-approved", "reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "trk"], "merge_commit_sha": "0b4b3cf74a9e8e46a432268e9d9310d2cd884ac9", "merged_at": "1692888907", "merged_by": "cmsbuild", "milestone": "CMSSW_13_3_X", "number": 42441, "release-notes": [], "review_comments": 9, "state": "closed", "title": "Added TryToContinue exception handling to cmsRun", "updated_at": "1692888907", "user": "Dr15Jones"}