{"additions": 111, "auther_ref": "HIHFFilter_MiniAOD_112X", "auther_sha": "e930c5323e7bd5872dbd50bbcdbbb9572430a29d", "author": "denerslemos", "body": "Dear All,\r\n\r\nThis PR is made to include the HF event filters in the Heavy Ions miniAOD workflow. This is expected to be included only for the eras \"pp_on_AA_2018\" and \"pp_on_PbPb_run3\". Since the towerMaker collection is not saved in miniAOD this filters need be stored in the miniAOD content. To include that filters, a EDProducer was created to run on PAT and store a vector of integers with size 4 which each position in this vector has the minimum number of towers above some threshold between the two HF sides (TMath::Min(nTowerHF+,nTowerHF-)), which means:\r\n\r\n- vector[0] = N of minimum HF towers above 2 GeV\r\n- vector[1] = N of minimum HF towers above 3 GeV\r\n- vector[2] = N of minimum HF towers above 4 GeV\r\n- vector[3] = N of minimum HF towers above 5 GeV\r\n\r\nTests comparing miniAOD and AOD was made, and the result of the application of the filters are exactly the same in both. For example, using hfCoincFilter2Th4 filter (which requires 2 HF+/- towers above 4 GeV) both AOD and miniAOD has 5723 passed events and 1237 failed events (total events: 6960 for MB sample). Also, the number of tracks removed for both AOD (generalTracks with highPurity and pT > 0.5 GeV) and miniAOD (packedPFcandidates) was exactly the same: 142. In this studies the vector increases the size of the miniAOD in ~6 bytes per event. You can find more details of this slides:\r\n\r\nhttps://www.dropbox.com/s/susuzaanbk3jb3h/HIHFFilter.pdf?dl=0\r\n\r\nThe studies below was made in 103X, and was also tested in 112X using \"runTheMatrix.py -l limited -i all --ibeos\", in special workflow 159. The versions 103X and 112X returns exactly the same results on the tests.\r\n\r\n@mandrenguyen @YeonjuGo @pjwinnetou\r\n\r\nBest,\r\n\r\nDener Lemos", "branch": "master", "changed_files": 4, "closed_at": "1595939665", "comments": 13, "commits": 5, "created_at": "1595001482", "deletions": 0, "labels": ["analysis-pending", "code-checks-rejected", "comparison-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-pending"], "milestone": "CMSSW_11_2_X", "number": 30810, "release-notes": [], "review_comments": 18, "state": "closed", "title": "Add the HF Filters in Heavy Ions miniAOD", "updated_at": "1595939665", "user": "denerslemos"}