{"additions": 3057, "auther_ref": "mkFitIntegration", "auther_sha": "78094ae37211e4fcc9f84a6ef4f669f9c637ca6d", "author": "trackreco", "body": "#### PR description:\r\n\r\nThis PR updates MkFit to support multiple tracking iterations. For now, preliminary tuning, and an option to switch pattern recognition to MkFit, is provided for initialStep, lowPtQuadStep, highPtTripletStep, lowPtTripletStep, detachedQuadStep, pixelLessStep, and tobTecStep. Work for tuning for these as well as the later iterations continues in parallel. This PR adds Modifiers for each of these iterations (plus detachedTripletStep and mixedTripletStep) to allow switching any set of them to be switched to MkFit, and a ModifierChain to switch them all (this is intended only as a temporary solution, with a single Modifier to switch all iterations seen as the longer term solution once a satisfactory tuning has been achieved).\r\n\r\nIn addition this PR includes\r\n* Physics fix to use 1D strip hits in the barrel\r\n* Move all geometry-related code to an ESProduct from EDProducers\r\n* Customize function to replace pattern recognition in HLT iter0 to MkFit, enabled in the X.7 workflow\r\n* Support for strip cluster charge cut per iteration\r\n* Option to limit the internal concurrency in MkFit to 1 with `tbb::task_arena`, in order to be able to account all computations in EDModule timing measurements (like framework timers or FastTimerService)\r\n* Some technical optimization\r\n\r\nIn addition to the physics tuning there are several technical issues remaining that will be addressed in future PR(s).\r\n\r\nThe JSON files for per-iteration parameters will be moved to cms-data (and removed from the commit history) after the PR review is otherwise complete.\r\n\r\nRequires https://github.com/cms-sw/cmsdist/pull/6917\r\n\r\nFYI @mtosi @vmariani @mmusich \r\n\r\n#### PR validation:\r\n\r\nTested workflows 11634.0 and 11634.7 run.\r\n\r\nMTV plots comparing MkFit (enabled in all the aforementioned iterations) to CKF can be found from http://uaf-10.t2.ucsd.edu/~mmasciov/MkFit_multiIteration_forPR/plots_500evts_lessIters_all/. The plots were done in CMSSW_11_2_0 with ttbar+PU 50 with realistic 2021 conditions. The mkFit was compiled with gcc for SSE3 in red (setup in the external pull request), and icc for AVX2 in black, run on Skylake Gold on a single thread.\r\n", "branch": "master", "changed_files": 62, "closed_at": "1623851989", "comments": 84, "commits": 20, "created_at": "1621551067", "deletions": 662, "labels": ["code-checks-approved", "dqm-approved", "fully-signed", "hlt-approved", "operations-approved", "orp-approved", "pdmv-approved", "reconstruction-approved", "requires-external", "tests-approved", "upgrade-approved"], "merge_commit_sha": "bf3047e414545d6a732a581942dd23f4415af0b9", "merged_at": "1623851988", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 33802, "release-notes": [], "review_comments": 80, "state": "closed", "title": "Update MkFit to support multiple iterations", "updated_at": "1623851989", "user": "makortel"}