{"additions": 807, "auther_ref": "concurrentLumi_SiPixelQuality", "auther_sha": "02e3094e8f94140acb8f97f117dcfc108dd362c2", "author": "tocheng", "body": "#### PR description:\r\nSiPixelStatusProducer was first written as a One EDProducer to produce SiPixelCalZeroBias ALCARECO in ExpressPhysics stream.\r\nTo make it compatible with concurrent lumiblock processing, this PR changes it to be a stream module.\r\nParameters such as \"resetNlumi\" are obsolete and removed after moving to stream EDProducer,\r\nas the module will now only put product to each lumi block not combining product for several lumiblock sections.\r\n\r\nSiPixelTopoFinder class is design to contain maps that contains the tracker FED, geometry and topology.\r\nGlobalCache is contructed to make sure these maps will only be produced when tracker FED, geometry or topology changes across run.\r\n\r\nglobalEndLumiBlockSummary is used to summarize partial digi occupancy and FED error information from each instance of the module and globalEndLumiBlockProducer combines particle information and put the product into current Lumiblock.\r\n\r\nThe rest of the codes are basically the same as they were, just change of the structures.\r\n\r\n#### PR validation:\r\n\r\nThe product of the EDProducer, digi occupancy, can be dumped into text file for each lumi section.\r\nThe text file is the same before and after this PR, and the same when changing the concurrentLlumiBlock from one to two in the SiPixelCalZeroBias production using the config file in CalibTracker/SiPixelQuality/test/step3_SiPixelCalZeroBias_RAW2DIGI_RECO_ALCA.py.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nThis PR is not a backport\r\n\r\nBefore submitting your pull requests, make sure you followed this checklist:\r\n- verify that the PR is really intended for the chosen branch\r\n- verify that changes follow [CMS Naming, Coding, And Style Rules](http://cms-sw.github.io/cms_coding_rules.html)\r\n- verify that the PR passes the basic test procedure suggested in the [CMSSW PR instructions](https://cms-sw.github.io/PRWorkflow.html)\r\n", "branch": "master", "changed_files": 16, "closed_at": "1605256758", "comments": 25, "commits": 21, "created_at": "1604389563", "deletions": 503, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "198b3c8f04b59702145f2197d09b246bb5a1816c", "merged_at": "1605256758", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 32012, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Make SiPixelStatusProducer a stream EDProducer for concurrent lumiblock processing", "updated_at": "1605256758", "user": "tocheng"}