{"additions": 159, "auther_ref": "manu_RDF_2", "auther_sha": "8dc53b3a4a50fa442ce1e1530a3f20b6b7055642", "author": "manuel-gonzalez-henandez", "body": "#### PR description:\r\n\r\nThis pull request proposes a solution to the issue outlined in https://gitlab.cern.ch/cms-gen/gen_tasklist/-/issues/9. The ResonanceDecayFilter was not correctly accounting for the total number of tried events, leading to an incorrect cross section calculation (as the branching ratio was omitted). To address this, I introduced a counter in ResonanceDecayFilterHook.h to track the number of events vetoed by the filter, along with a function to reset the counter after each event. This data is then passed from Pythia8Hadronizer.cc to GenFilterEfficiencyProducer.cc using an object of the class ResonanceDecayFilterCounter I created.\r\n\r\nThe counter is applied only to the weight counts and not to the event counts, as requested by PDMV, to ensure the event-level GenFilter efficiency excludes the ResonanceDecayFilter information. This exclusion allows PDMV to accurately determine the number of LHE events required to generate a specific number of Gen events.\r\n\r\nAdditionally, I introduced the input_genfilter_efficiency variable in GenXsecAnalyzer.cc to ensure that when the ResonanceDecayFilter is enabled, the filter efficiency is always calculated using weight counts (where the filter information is stored) instead of event counts. This adjustment ensures consistent efficiency calculations for both LO and NLO processes and includes the filters contribution.\r\n\r\nFurthermore, now it is possible to use matching between mother and daughter particles like:\r\n'ResonanceDecayFilter:matching = on'\r\nTo indicate the matched decays, it is possible to use just one vector\r\n'ResonanceDecayFilter:matchedDecays ={m1: dau11 dau12, m2: dau21 dau22,, mN: dauN1  dauNM}'\r\nor split into small vectors\r\n'ResonanceDecayFilter:matchedDecays = {m1: dau11 dau12}',\r\n'ResonanceDecayFilter:matchedDecays += {m2: dau21 dau22}',\r\n'ResonanceDecayFilter:matchedDecays += {mN: dauN1  dauNM}' # N-body decays are allowed\r\n\r\nExpected changes to the output are as follows:\r\n1. In the GenFilter luminosity block of the final root file, the sumtotal_w and sumtotal_w2 values now incorporate the ResonanceDecayFilter information, reflecting the true total number of tried events.\r\n2. In GenXsecAnalyzer.cc, the \"Filter efficiency (taking into account weights)\" now includes this filters contribution, which accounts for the branching ratio. Consequently, the final cross section and equivalent luminosity are calculated correctly, incorporating the branching ratio.\r\n\r\nBe careful: if the decay properties are modified in Pythia (e.g. 'onIfMatch') and the ResonanceDecayFilter is used, the filter efficiency could not be the same as the branching ratio.\r\n\r\n#### PR validation:\r\n\r\nTo verify the correctness of the cross section calculation, I used the LO Radion_GF_HH_M300_narrow gridpack (as referenced in https://gitlab.cern.ch/cms-gen/gen_tasklist/-/issues/9) and a simple NLO ttbar custom gridpack that I generated for testing. In both cases, the resulting cross section was calculated correctly.\r\n\r\nI also performed the checks outlined in https://cms-sw.github.io/PRWorkflow.html. I executed the runTheMatrix suite of tests. The mistakes obtained by the tests were \"No such file or directory\" caused by missing root files. . To investigate further, I ran the same runTheMatrix tests using an unmodified version of CMSSW and observed identical errors. This strongly indicates that the issues are unrelated to my modifications.\r\n\r\nThis PR is a backport to the PR #46725 (Fix cross section when using ResonanceDecayFilter) because there were some issues related to code-checks (the patches given by the bot were impossible to implement).\r\n\r\n", "branch": "master", "changed_files": 8, "comments": 7, "commits": 2, "created_at": "1750659705", "deletions": 69, "labels": ["generators-pending", "pending-signatures", "tests-pending", "orp-pending", "backport", "code-checks-approved"], "milestone": "CMSSW_15_1_X", "number": 48383, "release-notes": [], "review_comments": 0, "state": "open", "title": "Pythia8 ResonanceDecayFilter Fix", "updated_at": "1757480208", "user": "manuel-gonzalez-henandez"}