{"additions": 56846, "auther_ref": "tfpx-subdisks-1230pre2", "auther_sha": "4f7f7a4190a8204b15d6028163a1ed57d90f5723", "author": "adewit", "body": "#### PR description:\r\n\r\nThis adds a new Phase 2 tracker geometry (T30). It is similar to T21/T24, with the main changes occurring in TFPX and TEPX, and a minor change in the OT (updated TB2S module spacing). All sensors in the IT are 25x100 um2 planar \r\n\r\nThe changes in TFPX and TEPX are:\r\n- More realistic TFPX module placement (global shift in z positions of the disks, increase in dphi between the modules around 90 degrees, small rotation of modules around global z axis, dependent on the module position)\r\n- Re-ordering of the module placement on the dees in TFPX\r\n\r\nAs a consequence of the last point, a new hierarchy level (subdisk) has been introduced for the forward pixel to address issues observed in the tracking (not all hits from one TP entering the same track, leading to a high prevalence of additional tracks with only a few hits). This new hierarchy level required the addition of a new detID schema, which is used both in TFPX and TEPX, where the same approach is useful.\r\n\r\nMore information, and validation of these changes, can be found [in these slides](https://indico.cern.ch/event/1072175/contributions/4649242/attachments/2362724/4033640/TFEPX_AdW_1012.pdf), where T30 is labelled TX1.\r\n\r\nNote: the new hierarchy level, and associated further changes to the code, is only used in T30 for the moment. All other tracker geometries use the already existing phase 2 detID schema and are not affected by the changes implemented here.\r\n\r\n@emiglior FYI\r\n\r\n#### PR validation:\r\n\r\n- Checked runTheMatrix workflows run without errors (including workflows not using the new detID schema)\r\n- Checked position of the modules matches that expected in the mechanical design\r\n- Analysis of tracking validation plots and other diagnostic tests as detailed [here](https://indico.cern.ch/event/1072175/contributions/4649242/attachments/2362724/4033640/TFEPX_AdW_1012.pdf)\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nNot a backport\r\n\r\n", "branch": "master", "changed_files": 50, "closed_at": "1644540399", "comments": 73, "commits": 14, "created_at": "1641807260", "deletions": 273, "labels": ["alca-approved", "geometry-approved", "l1-approved", "operations-approved", "reconstruction-approved", "fully-signed", "tests-approved", "pdmv-approved", "orp-approved", "urgent", "upgrade-approved", "code-checks-approved"], "merge_commit_sha": "09bb0b76d6c22947de05c50a46c8ae254c504b97", "merged_at": "1644540399", "merged_by": "cmsbuild", "milestone": "CMSSW_12_3_X", "number": 36660, "release-notes": [], "review_comments": 49, "state": "closed", "title": "Phase2 tracker: add T30 (geometry with more realistic TFPX)", "updated_at": "1644540399", "user": "adewit"}