{"additions": 101, "auther_ref": "dev_fixLayerClustering", "auther_sha": "77bd69ad6794eb68c122d354ff13a6ead79c9e2a", "author": "jsamudio", "body": "#### PR description:\r\n\r\nThis PR is made to address an issue with the output of the Alpaka PFClusterProducer. During development for #48248 we found that the output cluster SoA (primarily energy, x, y, and z values) was not consistent with the output from `RecoParticleFlow/PFClusterProducer/plugins/LegacyPFClusterProducer.cc` after a legacy position algorithm was run on the rechit fractions. In practice, we have never used the cluster SoA information so this was not affecting anything until the multi-depth clustering development. In order to avoid an intermediate copy to the CPU to run the legacy position algorithm before passing off to multi-depth clustering on the GPU, this PR fixes the output layer cluster SoA such that it is fully consistent with the results from running the intermediate legacy algorithm. Thus, for downstream consumers on the GPU, the SoA can be immediately used.\r\n\r\n#### PR validation:\r\n\r\nThe PR was validated by comparing the values going in and out of  `RecoParticleFlow/PFClusterProducer/plugins/alpaka/PFClusterSoAPositionUpdater.cc` from #48248 for consistency. This intermediate plugin uses the same CPU position algorithm as the SoA to legacy converter, but produces an updated SoA instead. Additionally, in testing the multi-depth clustering developments the Alpaka vs Legacy comparisons were checked and consistent between using the intermediate module as input, and taking the SoAs straight from the Alpaka layer cluster producer.\r\n\r\nThe `.42X` workflows were checked and succeed.\r\n\r\nNot a backport.\r\n\r\n@hatakeyamak @alexstrel @makortel @fwyzard \r\n", "branch": "master", "changed_files": 1, "comments": 3, "commits": 1, "created_at": "1769031013", "deletions": 39, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_16_1_X", "number": 49894, "release-notes": [], "review_comments": 0, "state": "open", "title": "Fix PFCluster SoA output of Alpaka PFClusterProducer", "updated_at": "1769031095", "user": "jsamudio"}