{"additions": 4527, "auther_ref": "fc-mtdtb-20251029", "auther_sha": "352b9f3dada4d0a644c9272f6b0179381ba8aa06", "author": "fabiocos", "body": "#### PR description:\r\n\r\nIn this PR a new ```Geometry/MTDTBCommonData``` package is added, following what is done for HGCAL, to enable test beam campaigns simulation for MTD subdetectors. For the time being the packages addresses the September 2025 BTL test beam, in the two possible configurations with teh DUT in front of the reference module and the DUT behind the same reference.\r\n\r\nGeometry configurations are obtained from the regular full CMS geometry, extracting only MTD, and modifying BTL so as to have only the component used for the test beam. The beam vertex and particle gun are configured so as to have the correct angles wrt the Detector Under Test (DUT), i.e. mimicking 45 degrees along CMS eta for the DUT in front of the reference module, and 52 degrees along CMS phi for the DUT 30 cm behind the reference module. The reference module in this case is simulated as a simple passive LYSO block.\r\n\r\nThe whole regular numbering scheme is used with a very minimal modification in the topology code. The DUT behind scenario is shown in the figure below, showing the tray envelope from which the sensor module used as active element is taken.\r\n\r\n<img width=\"476\" height=\"389\" alt=\"Screenshot 2026-01-22 at 11 22 48\" src=\"https://github.com/user-attachments/assets/b5fc7bd9-9f8f-40d5-82d8-2f92f001c2dc\" />\r\n\r\nWith the opportunity a modification of the rotation in ```BeamProfileVtxGenerator``` is proposed, as signs seem to be opposite compared to what available in literature, and would point to a shift of the beam center in teh opposite direction than expected.\r\n\r\nWorkflows are provided to run beam generation, SIM, DIGI e local reconstruction, to allow a direct comparison of the simulation with real data.\r\n\r\n#### PR validation:\r\n\r\nWorkflows runs on several events without issues, providing the desired collections. No analysis has been performed though so far.", "branch": "master", "changed_files": 33, "comments": 12, "commits": 4, "created_at": "1770122945", "deletions": 6, "labels": ["simulation-pending", "geometry-approved", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_16_1_X", "number": 50013, "release-notes": [], "review_comments": 4, "state": "open", "title": "MTD geometry and simulation: geometry scenarios and workflows to simulate BTL 2025 test beam", "updated_at": "1770967921", "user": "fabiocos"}