{"additions": 2829, "auther_ref": "EcalPhase2SimReco_11_1_X", "auther_sha": "56838fe6b38b58c53e9891ede07ec624122b27f6", "author": "RSalvatico", "body": "#### PR description:\r\n\r\nThe PR contains the code necessary to run the Phase2 simulation of the EB (ECAL Barrel) calorimeter up to the digitisation step. Most of it was duplicated from the current code and adapted to describe the Phase2 configuration, which, for instance, should contain no references to EE (ECAL Endcap) and ES (ECAL Preshower). Thanks to the duplication, **the newly introduced code DOES NOT affect standard simulation and reconstruction sequences in any way.**\r\n\r\nIt is possible to select whether to use the Phase1 or Phase2 sequences when running an event generation (GEN,SIM, DIGI steps), by loading the Phase1 or Phase2 configuration files. An example is given by:\r\n \r\n- SimCalorimetry/EcalSimProducers/test/SingleElectron_cfi_py_GEN_IDEAL_withECALDigi_Ph1.py (Phase1)\r\n\r\n- SimCalorimetry/EcalSimProducers/test/SingleElectron_cfi_py_GEN_IDEAL_withECALDigi_newshape.py (Phase2)\r\n\r\nWhen the Phase2 sequence is run, every signal in EB is sampled at 160 MHz for a total of 16 samples, according to the specifics of the Phase2 electronics. Two possible gains are applied to the signal samples: gain 10 and gain 1. The new EB digitisation is stored inside the simEcalUnsuppressedDigis collection, in which the digis are composed by 12 bits containing the ADC values (as for Phase1), plus a 13th bit containing the gain information: 0 if gain 10, 1 if gain 1. \r\n\r\n#### PR validation:\r\n\r\nThe material included in the PR was validated mainly by generating particles (electrons) of different energies and checking how the signals they produced in EB were digitised. This was achieved by running the GEN,SIM,DIGI sequences in:\r\n\r\n- SimCalorimetry/EcalSimProducers/test/SingleElectron_cfi_py_GEN_IDEAL_withECALDigi_Ph1.py (Phase1)\r\n\r\n- SimCalorimetry/EcalSimProducers/test/SingleElectron_cfi_py_GEN_IDEAL_withECALDigi_newshape.py (Phase2) \r\n\r\nand by reading their output files through the respective Phase1 and Phase2 analyzers, located in:\r\n\r\n- SimCalorimetry/PhaseIAnalyzer/\r\n\r\n- SimCalorimetry/PhaseIIAnalyzer/\r\n\r\nThe analyzers can be run with \"cmsRun ConfFile_cfg.py\", situated in the python/ folder of the two directories above. They produce a number of histograms, containing for instance the location of the signals as read by the EB electronics, and the gain they were read out with.\r\nThe tests showed that the desired digitisation behaviour was obtained for the Phase2 sequence, while the Phase1 behaviour still reflects the current one.", "branch": "master", "changed_files": 87, "closed_at": "1603267283", "comments": 142, "commits": 14, "created_at": "1585900482", "deletions": 518, "labels": ["alca-pending", "analysis-pending", "code-checks-approved", "comparison-pending", "db-pending", "dqm-pending", "generators-pending", "operations-pending", "orp-pending", "pending-signatures", "reconstruction-rejected", "simulation-pending", "tests-pending", "upgrade-pending"], "milestone": "CMSSW_11_2_X", "number": 29386, "release-notes": [], "review_comments": 317, "state": "closed", "title": "Ecal phase2 sim reco 11 1 x", "updated_at": "1603267283", "user": "RSalvatico"}