{"additions": 617, "auther_ref": "nt2_unpacking-12_5_X", "auther_sha": "e06897d979bb0a0071e8bd606cc7ec5a9a915834", "author": "forthommel", "body": "#### PR description:\r\n\r\nWe introduce the unpacker and DIGI-level data format for the new TOTEM T2 telescope (or nT2) to operate in Autumn 2022 special pp and HI runs.\r\nnT2 digis are reflecting the registers commonly used for detectors with timing capability: channel, GEOid, and channel status marker for the labelling, and leading+trailing edges measurements for the timing part.\r\nAdditionally, a new DetId object (derived from CTPPSDetId to avoid code duplication) is introduced for the mapping of all channels/tiles in each plane of both arms.\r\n\r\nThis new detector is assigned the FED ID 577, initially used along run 2 as a TOTEM trigger counter and since then unused. Therefore, it replaces this counter unpacking in the PPS standard sequence. For the purpose of the end of 2022 HI run a nT2-only sequence will be introduced in a follow-up PR including the DIGI-to-RecHit conversion (thanks to the addition and usage of the geometry CondFormat linking digis to spatial coordinates).\r\n\r\nFinally, work is ongoing on the DQM component, and will also be the object of a follow-up PR.\r\n\r\n#### PR validation:\r\n\r\nA fake mapping of nT2 channels was introduced to redirect the PPS diamond detector (sharing a common VFAT frame payload) into the nT2 raw-to-digi unpacker. Although the diamond data format does not follow nT2's the bitwise readout of all frames was performed successfully following the data format implemented by TOTEM DAQ experts.\r\nThis mapping is left as an example, to be replaced with the actual one after the detector installation, and converted into a payload to be GT'ed.\r\n\r\nFurthermore, the usual matrix tests passed flawlessly.", "branch": "master", "changed_files": 21, "closed_at": "1659826924", "comments": 48, "commits": 14, "created_at": "1659026538", "deletions": 20, "labels": ["alca-approved", "daq-approved", "reconstruction-approved", "simulation-approved", "fully-signed", "tests-approved", "orp-approved", "new-feature", "code-checks-approved", "ctpps"], "merge_commit_sha": "848a3dbe239bd74b0f40b7bd2987b92141f8b557", "merged_at": "1659826924", "merged_by": "cmsbuild", "milestone": "CMSSW_12_5_X", "number": 38886, "release-notes": [], "review_comments": 2, "state": "closed", "title": "TOTEM nT2 unpacker", "updated_at": "1659826924", "user": "forthommel"}