{"additions": 291, "auther_ref": "CMSSW_7_5_3_patch1/hiRun2TLR", "auther_sha": "3eaf9cce3a863a50d25150d105aee95e7ad99110", "author": "slava77", "body": "- HeavyIonsRun2 scenario for T0 processing: created based on ppRun2 \n  - (the old Run1 HI scenario seems somewhat outdated compared to pp and ppRun2; I found it easier to spawn from ppRun2. The run1 HI scenario still runs. Chances are, the Run1 part may need an update to be able to run replays to get realistic resource load scale tests.)\n  - to go with this, the suggested customization for interactive Run2 data running is Configuration/DataProcessing/RecoTLR.customiseRun2CommonHI\n- The HI sequence didn't work out of the box due to a somewhat bogus setup of the HLT Tau DQM: this was fixed by turning off matching to reco objects (most actually don't exist in HI sequence: caloMet, hpsPFTauProducer, gedGsfElectrons). \n  - The L1 part of the tau sequence in this case at least has some non-trivial output (no reco object matching is applied -> plots get filled).\n  - Instead of removing the module completely I found it easier to modify the configuration in  DQMOffline/Configuration/python/DQMOfflineHeavyIons_cff.py\n  - Someone in HI should review the contents of DQMOfflineHeavyIons.\n- additionally I cleaned up slightly the pp RecoTLR (some refactoring to reduce copy-paste)\n\nTested on pp run 256729 with \n\n```\npython Configuration/DataProcessing/test/RunPromptReco.py --scenario HeavyIonsRun2\\\n --reco --aod --dqmio --global-tag 75X_dataRun2_v5 --alcareco TkAlMinBiasHI+SiStripCalMinBias\\\n --lfn=/store/data/Run2015D/DoubleEG/RAW/v1/000/256/729/00000/9271C53F-805D-E511-B380-02163E01449B.root\n```\n\n@mandrenguyen \n\nAlso tested on short matrix (pp and HI workflows) in CMSSW_7_5_3_patch1\n- there are no differences in pp workflows (including PromptReco workflow check)\n- there are expected differences in the HLT/TauOffline/PFTaus/L1  plots: L1 taus are now plotted without the matching requirement with the offline reco objects (nonexistent in HI)\n", "branch": "CMSSW_7_5_X", "changed_files": 6, "closed_at": "1444714163", "comments": 6, "commits": 4, "created_at": "1444685938", "deletions": 46, "labels": ["comparison-available", "dqm-pending", "operations-pending", "orp-pending", "pending-signatures", "tests-approved"], "merge_commit_sha": "ef5a5aeeeb29c90e31ac75a95ae56c38a6bd6346", "merged_at": "1444714163", "merged_by": "davidlange6", "milestone": "CMSSW_7_5_X", "number": 11741, "release-notes": [], "review_comments": 0, "state": "closed", "title": "heavyIonsRun2 scenario for data processing", "updated_at": "1444716053", "user": "slava77"}