{"additions": 92, "auther_ref": "MuonShowerInformationFiller-sorting", "auther_sha": "324d91dd1c7a18f79a22b2264c82f373b3c42d58", "author": "dan131riley", "body": "#### PR description:\r\n\r\nMuonShowerInformationFiller has several sorts over the muon hits that use comparison functions involving complex calculations.  This has two problems, (1) the comparison function is executed O(n*log(n)), so the same complex calculations are performed multiple times, and (2) when vector instructions are enabled, the values calculated may not be completely stable, which may make the sort ill-defined.  See issue #33663 for details.\r\n\r\nThis PR replaces the use of `stable_sort` with a custom sort function that pre-calculates and caches the values to be sorted, performs an index sort on the cached values, and constructs the output container.  This reduces the number of complex calculations to O(n), at some cost in complexity and memory usage.  In practice this is measured to reduce the CPU time for a typical sort by 2/3.  It also fixes the segmentation faults.\r\n\r\nIn addition, this PR also corrects two places where I believe the in-place sorting of `stable_sort` was incorrectly sorting the input containers to two functions.\r\n\r\nIt would arguably be better for the MuonShowerInformationFiller to define its own hit type that caches the global coordinates and derived quantities; however, that would be a much more intrusive change, where this PR is fairly minimal.\r\n\r\n#### PR validation:\r\n\r\nWorkflow 136.844 runs successfully in a Skylake IB, spot checks of the sort results found the results to be identical.  Mostly technical fix, but may cause small physics changes due to the correction of the inadvertent sorts.", "branch": "master", "changed_files": 2, "closed_at": "1676563158", "comments": 11, "commits": 2, "created_at": "1675352769", "deletions": 40, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "muon"], "merge_commit_sha": "ef21ee90a2bd1f4bec60f455603aed0293371018", "merged_at": "1676563158", "merged_by": "cmsbuild", "milestone": "CMSSW_13_1_X", "number": 40675, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Use an indexed sort for expensive comparisons in MuonShowerInformationFiller", "updated_at": "1676563159", "user": "dan131riley"}