{"additions": 6583, "auther_ref": "ape-parallel-and-print", "auther_sha": "f9c6483085b0b418b902e9a516ff9161c9a49fad", "author": "mteroerd", "body": "Since the print migration was done only a few days ago, this was not included in the code that I worked on. Therefore, I also did the neccessary changes for print migration to the files I modified.\r\n-------\r\n\r\nThis PR includes an update of the APE tool to make the parallel skimming of data and parallel APE measurements possible in a more convenient way.\r\n\r\nThese changes are mainly for an easier handling of multi-IOV campaigns and an in general faster workflow.\r\n\r\n\r\n\r\n1. Commit 19c9637 fixes a typo in Alignment/APEEstimation/macros/DrawPlot.C that was introduced in a previous pull request when fixing a different issue.\r\n\r\n2. Commit 7af754e reworks parts of the skimming tool and adds a new python script that automatically renames and copies the skimming result files to a desired location. Also, multiple skims can be performed in parallel.\r\n\r\n3. Commit f9c6483 adds the autoSubmitter.py python script which can perform all iterations of an APE measurement automatically and can do multiple measurements in parallel. It also has a basic error handling and can resume measurements if the script was stopped for any reason. \r\nFor this, the _cfg.py files in Alignment/APEEstimation/test/cfgTemplate were also modified to allow for custom folder names for input and output files, but it was ensured that the old workflow is still possible without making any changes.\r\n\r\n", "branch": "master", "changed_files": 53, "closed_at": "1532884269", "comments": 3, "commits": 41, "created_at": "1532883795", "deletions": 823, "labels": ["alca-pending", "code-checks-approved", "comparison-pending", "core-pending", "daq-pending", "generators-pending", "hlt-pending", "l1-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "simulation-pending", "tests-pending", "upgrade-pending"], "milestone": "CMSSW_10_3_X", "number": 24126, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Parallel APE measurements and skims (+ print migration)", "updated_at": "1532884269", "user": "mteroerd"}