{"additions": 961, "auther_ref": "geoFix121ib_120X", "auther_sha": "dfba27ba72e391a9f8b7cdd79b01500c9b68886b", "author": "CTPPS", "body": "#### PR description:\r\n\r\nThis is a backport of #35380 to CMSSW_12_0_1.\r\n\r\nThis PR addresses a few minor corrections on the PPS geometry in the Pixel sensors and complies the material names in the reco geometry as stated in #34927. The position of the Silicon wafers has been move down to 250um w.r.t. the bottom foil and the envelopes with sensors ad flexible cables has been enlarged to avoid volume overlaps. Besides, the U shape of the Aluminum supports has been changed to a plain squared piece. A detailed list of the file changes and visualization of the new changes in the Pixel sensors is given in this [twiki](https://twiki.cern.ch/twiki/bin/view/CMS/PPSPixelGeometryFix1210pre2).\r\n\r\nIncludes updated on both DDD and dd4hep files and keeps the default dict2021Geometry.py for 12_0.\r\n\r\n#### PR validation:\r\n\r\nThe new changes in the geometry have been validated with the full CMS geometry dump for visualization and overlap check with tolerance 0.01, plus direct and full simulation to confirm hits in both pixel and timing detectors. The position of the pixel sensors have been checked with direct simulation [here](https://twiki.cern.ch/twiki/bin/view/CMS/PPSPixelGeometryFix1210pre2#Comparisons_on_pixel_distance).\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nPR  #35380, needed to update PPS geometry for Run3.\r\n\r\nAll changes follow the Naming Rules for new XML files in geometry.\r\nAll workflow tests done.\r\n\r\nFYI @fabferro @jan-kaspar", "branch": "CMSSW_12_0_X", "changed_files": 10, "closed_at": "1632419426", "comments": 3, "commits": 7, "created_at": "1632409238", "deletions": 10, "labels": ["geometry-pending", "pending-signatures", "orp-pending", "tests-started", "upgrade-pending"], "milestone": "CMSSW_12_0_X", "number": 35387, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Backport of fixes on PPS geometry ", "updated_at": "1632419626", "user": "diemort"}