{"additions": 1662, "auther_ref": "phase1pixeldqm-framework-second", "auther_sha": "1f198f33ac30fb083bf909c93beba226f5620c7e", "author": "schneiml", "body": "This is a follow-up on #13798. It is probably still not ready to be merged, but much closer now. (FYI: @fioriNTU @davidcarbonis )\n\nThe history has been completely rewritten to base on  CMSSW_8_1_0_pre2, w/o any alignment commits. Also, by default we don't depend on Alignment any more, instead an extension to TrackerTopology provides the required information. \n\nItems to discuss:\n- Configuration with eras. This hopefully does not break anythig introduced by other PRs and also does not break anything for phase0. (FYI: @makortel )\n- Large parts of the Configuration (P5, cosmics, HI, Validation, Certification...) are not updated yet.\n- The extension to TrackerTopology. This is not yet tested to even compile with all the dependent packages. I don't expect anything to break, but given that a slightly different formulation of the code caused something that looked a lot like a compiler bug, we should be careful.\n- This also raises the question of whether the extension is fine as it is. It is slightly redundant with stuff in Alignment (by design) and also in GeometricSearchTracker et. al., however these present a very uncomfortable format for the use case here. Also, I don't know of any other place that can interact with string names.\n- The dependency cycle with the SiPixelPhase1Common package remains. it could be removed easily if we decide to, but it seems to be done like that in most of the (Tracker-)DQM. (FYI: @smuzaffar )\n- We also don't have a full list of new packages in place yet.\n- All helper classes/object are local to the plugins now. However, for performance/mem reasons we might want to have some stuff global again (full set of module IDs etc.). Also a global string-to-id mapping table (shared by SiPixelPhase1 DQM plugins) could come in very handy for harvesting. (FYI: @VinInn )\n- We might or might not want to split this in two PRs, one that introduces the (empty) config for the new DQM (and might break things) and one that adds the new code (large, but should not break things). Maybe even one more for the TrackerTopology change with its huge dependency list.\n\nNote that this is entriely untested for now, due to compiling it takes for ever and I took that time to open this PR... (Some problems already spotted, commits will follow)\n", "branch": "CMSSW_8_1_X", "changed_files": 23, "closed_at": "1461861612", "comments": 10, "commits": 60, "created_at": "1460361559", "deletions": 47, "labels": ["comparison-available", "dqm-pending", "new-package-pending", "orp-pending", "pending-signatures", "reconstruction-rejected", "simulation-pending", "tests-approved"], "milestone": "Next CMSSW_8_1_X", "number": 14015, "release-notes": [], "review_comments": 8, "state": "closed", "title": "Phase 1 Pixel DQM (RFC 2)", "updated_at": "1461861612", "user": "schneiml"}