{"additions": 118, "auther_ref": "Calo_CICADA_Unpacker_PR", "auther_sha": "077e16de136872bdaa077a14340f9f837e021699", "author": "aloeliger", "body": "### PR description:\r\n\r\nThis PR adds an unpacker to the L1T Calo Layer 1 Unpacking Setup to explicitly unpack CICADA (found in FED 1356, AMC slot 7). This PR relies on data-types introduced in it's companion PR https://github.com/cms-sw/cmssw/pull/44222. https://github.com/cms-sw/cmssw/pull/44222 Unpacks the uGT received CICADA scores, while this PR unpacks the Calo sent CICADA scores.\r\n\r\n### PR validation:\r\n\r\nAll code compiles and has had code formatting applied. This Unpacker has also been tested against events with the CaloSummary/CICADA cards in DAQ. A screenshot of some debugging output of the development of the unpacker is attached. On the left side you can see the unpacked data from FED 1356, which matches the dumped FED output seen on the right (CICADA/CaloSummary highlighted)\r\n\r\n![image](https://github.com/cms-sw/cmssw/assets/28607665/c043c249-e872-464c-8dd0-a385dffebeb1)\r\n\r\nAlso shown is a demonstration that the correct CICADA bits are received in the correct order, and the resulting constructed score, matched to the expected hex number (when transformed into a 16 bit fixed-point number, with 8 integer bits, and 8 bits after the decimal point, to within machine epsilon, or display precision).\r\n\r\n### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport, and is not expected to need a backport. It is however, a feature of an upcoming data-taking tool, so it is not impossible that a backport will be requested for it.\r\n\r\n\r\n@eyigitba @slaurila FYI, this is one of the DPG requested pieces for CICADA that we have made for our own commissioning purposes now. Packers will be made when we are satisfied with commissioning progress using these unpackers.", "branch": "master", "changed_files": 7, "comments": 5, "commits": 1, "created_at": "1716536709", "deletions": 1, "labels": ["l1-pending", "pending-signatures", "orp-pending", "tests-started", "requires-external", "code-checks-approved"], "milestone": "CMSSW_14_1_X", "number": 45037, "release-notes": [], "review_comments": 0, "state": "open", "title": "Add Unpacker for L1T Calo Layer 1 to unpack CICADA", "updated_at": "1716537153", "user": "aloeliger"}