{"additions": 262, "auther_ref": "fc-fixGeom", "auther_sha": "e10d7458a82d1c515cf32bce3dd4804255b5888b", "author": "fabiocos", "body": "During studies for the choice of the optimal layout, a problem in the PSImHit geometrical information has been reported by @abenagli . The exit point looks to be incompatible with the phsyical dimension of the crystals.\r\n\r\nThis is caused by a bug introduced at the time of the code cleaning in #23625 , as the conversion to local coordinates for post-step points is done using the post-step reference frame, that might be not the one of the crystal but of the mother volume in case the border is crossed during the step. The original functionality of MtdSD is now restored.\r\n\r\nDuring the investigation I realized that the possibility to define the time slice unit was foreseen in the configuration but not really implemented in the code. This is now fixed, and the value is set back to the 10 ps (originally hardcoded in the code, now a parameter that can be changed through the MtdSD PSet in g4SimHits).\r\n\r\nDuring the debugging, I have implemented a new geometry test module TestMTDPosition that dumps the position of centers and one corner of the crystals. It can be used to quickly inspect the DD description of the sensitive detectors and compare it with the dump of the Geant4 import provided by SimG4Core/PrintGeomInfo utilities. At the same time a minor fix has been done to the TestMTDNumbering module (were CaloSD was always incorrectly printed at the end).\r\n\r\nWith this fix the reported problem has disappeared (checking 100 events of wf 22407.0, it was appearing already at event 2). It has also been verified that the value of the time slice unit is correctly set depending on the choice.", "branch": "master", "changed_files": 7, "closed_at": "1540454317", "comments": 18, "commits": 2, "created_at": "1540099048", "deletions": 8, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "geometry-approved", "orp-approved", "simulation-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "356b10e4b165c6cab3b304edce7e28c3cbb2b6b7", "merged_at": "1540454317", "merged_by": "cmsbuild", "milestone": "CMSSW_10_4_X", "number": 24954, "release-notes": [], "review_comments": 4, "state": "closed", "title": "MTD: fix TimingSD calculation of post-step local point and time slice unit definition, add SD geometry dump module", "updated_at": "1540454323", "user": "fabiocos"}