{"additions": 1862, "auther_ref": "pyld-chk-migrate2", "auther_sha": "93227952fa2f4b466e5843abd81434ba9cc6e38e", "author": "cvuosalo", "body": "The geometry DB payload tester is a tool for an expert to compare newly created geometry DB payloads with the XML geometry and with the geometry in the DB to make sure that the new payloads are correct. It has only existed as a DDD version, and this PR provides a DD4hep version.\r\n\r\nIncluded in this PR is a change to turn off the INFO and WARNING messages from inside of DD4hep. With DD4hep running in production, it is not needed to have these messages appearing in every log of simulation. In future, a configurable option can be considered to enable or disable these messages at run time.\r\n\r\nNote that the design of the DB payload tester script is very brittle. It depends on many other scripts, which it copies and edits. Changes in these scripts could cause the main script to fail. This design is carried over from the original DDD DB payload tester script. It would be good to re-design the main script in this PR to remove the copy-and-edit mechanism, but I'm not sure what new design would work.\r\n\r\nThis PR makes several improvements over the original DDD script. It adds a test for the GEM reco geometry payload. It updates the CALO reco geometry test to compare with Run 3 CALO reco geometry reference values instead of values from 2009. It removes false positives from several tests, where the tests were indicating geometry differences even though there were no real differences. It standardizes the output of several tests to make comparisons easier and more reliable.\r\n\r\nIn a few files, unnecessary dependence on DDD was removed.\r\n\r\n#### PR validation:\r\n\r\nThe script was tested with sample Run 3 geometry DB payloads that were compared with the current Run 3 geometry in XML and in the DB.\r\n\r\nNote that this PR should have no effect on any workflow.", "branch": "master", "changed_files": 49, "comments": 17, "commits": 3, "created_at": "1654282689", "deletions": 46, "labels": ["simulation-pending", "dqm-pending", "geometry-pending", "pending-signatures", "tests-approved", "orp-pending", "db-approved", "upgrade-pending", "code-checks-approved"], "milestone": "CMSSW_12_5_X", "number": 38239, "release-notes": [], "review_comments": 0, "state": "open", "title": "[DD4hep] Migrate geometry DB payload tester to DD4hep", "updated_at": "1654541827", "user": "cvuosalo"}