{"additions": 12843, "auther_ref": "hcaldqm_newdev_v1", "auther_sha": "9922e661e0b7e6be657f361a1872df542016e64e", "author": "vkhristenko", "body": "This is the 2nd iteration of updates for HCAL DQM. We need that by the time collisions arrive...\n\nThings that are majorly updated:\n1) previously, I used std::vector<> to hold the MonitorElements, however now it is boost::unordered_map<uint32_t, T> It's integrated with the use of DataFormats/HcalDetId classes. \n2) DQM/HcalCommon adds some additional classes for Electronics <-> Detector Conversions - all of that is again heavily based on DataFormats/HcalDetId classes\n3) DQM Harvesting is added + reportSummaryMap to show up for the Summary Workspace in DQM GUI\n4) 2 new Monitioring Tasks are added: TPComparisonTask and DigiComparisonTask. These 2 modules are for VME vs uTCA (HBHE) comparison. because of doing reco twice makes workflow very slow... \nThese guys are suppposed to be used in Online DQM only - not in Offline Workflows. That will require a special config for them and will be discussed with Central DQM people...\n\nA few things that have partially been accommodated from David Lange's comments:\n1) Constants - FED Constants have been replaced by the central values (from FEDNumbering...) reassigned...\nOther constants will  have to be migrated later...\n2) const refs, in Utilities.h I fixed places where there were no const refs - I've tried to put them everywhere where it was neccessary - I realize that it's a performance problem\n3) Templating is not done at the moment - but that should be done for 810\n\nI realize that this PR is quite big once again... but I think it should be the last one of such size....\nI've tested 3 runTheMatrix tests - all successful.\n\nLet me know...\nVK\n", "branch": "CMSSW_8_0_X", "changed_files": 102, "closed_at": "1460624477", "comments": 2, "commits": 6, "created_at": "1456951639", "deletions": 5268, "labels": ["comparison-pending", "dqm-rejected", "orp-pending", "pending-signatures", "tests-pending"], "milestone": "CMSSW_8_0_X", "number": 13561, "release-notes": [], "review_comments": 0, "state": "closed", "title": "HCAL DQM Updates in preparation for Collissions", "updated_at": "1460624477", "user": "vkhristenko"}