{"additions": 145, "auther_ref": "dqm-force-per-lumi", "auther_sha": "d4dd4a41193109c50c820ecaa0085dfbbd7b02e4", "author": "schneiml", "body": "#### PR description:\r\n\r\nThis PR enables per-lumisection saving of *all* DQM output for the UL rereco. This wish came up for machine learning studies targeting per-LS data certification or online monitoring.\r\n\r\nIn prompt reco, we have per-LS DQM output available due to how Tier0 processes only ~1 LS per job, and the per-job DQMIO output files are available. It would be very nice to have the same granularity of data preserved for the UL rereco, which in addition provides the full run2 dataset processed using the same software.\r\n\r\nThis is safe to do for most of DQM, since HARVESTING will re-generate per run/job statistics from the per-lumisection snapshots. It is not save for legacy modules that modify MEs at non-standard times or that do not support merging correctly; none of these should exist in RECO/DQM step since the threaded migration, but since there are still a few, I apply the change only to the non-legacy MEs.\r\n\r\n#### PR validation:\r\n\r\nValidated on a modified `136.85` that crosses a lumi boundary: `runTheMatrix.py -l 136.85 --command '--customise_commands \"if process.process == \\\"reHLT\\\": process.source.skipEvents=cms.untracked.uint32(3800)\\n\"' --ibeos -t 8`. Will need some special attention during relval since the DQMIO output file size will increase.\r\n\r\nKnown problems:\r\n- Various \"known unstable\" plots change behaviour. These change behaviour on trivial changes such as adding debug output, and might be caused by race conditions.\r\n- The behaviour of per-lumi plots in harvesting changes. This can lead to \"double counting\" in the existing offline per-lumi harvesting code, and cause subtly incorrect results. Since there is very little such code, I manually adapted the places I could find; however, due to the freedom that harvesting code has, I can not guarantee that these are all cases.", "branch": "master", "changed_files": 31, "comments": 188, "commits": 18, "created_at": "1553186370", "deletions": 120, "labels": ["code-checks-approved", "comparison-pending", "dqm-pending", "operations-pending", "orp-pending", "pending-signatures", "tests-pending"], "milestone": "CMSSW_10_6_X", "number": 26232, "release-notes": [], "review_comments": 0, "state": "open", "title": "Save DQM output per lumisection for UL rereco", "updated_at": "1555309287", "user": "schneiml"}