{"additions": 207, "auther_ref": "CR_local_error_bugfix", "auther_sha": "8858fd69e4a399c7b570004373efa538b5392ff2", "author": "OzAmram", "body": "This PR introduces a bug fix to the Cluster Repair CPE to solves the degradation in high pT trackng performance seen recently. The issue was traced back to ClusterRepair not implementing the functionality present in the PixelCPETemplateReco for the errors of the cluster splitting used in the Jet Core cluster splitting. \r\nThis PR also includes a fix for a case in which the ClusterRepair CPE was discrepant with respect to the Template CPE: the errors of edge hits which the 2D reco was not run on which were not being set to the special values used in the template CPE. This fix also defines these errors as constants in the base class rather than having them as two sets of 'magic numbers' in the code. \r\n\r\nThe PR is an immediate fix for the high pT tracking issue and the plan is that there will be a longer term restructuring of the Template and ClusterRepair CPE's so as to avoid duplicated code. \r\n\r\n@vberta Has done testing to show that this PR does recover the performance loss in high pT tracking, with slides shown [here](https://indico.cern.ch/event/934809/contributions/4015468/attachments/2101571/3533198/presentation_CRissue_OzFixTest4PR.pdf).\r\n\r\nThere was also a quick test done on the edge hit errors to ensure that the new PR does indeed match the output of the 1D template reco for edge hits where the 2D reco is not run. Results are [here](https://cernbox.cern.ch/index.php/s/vxbIHE0zUeXBtUz)\r\n\r\n@mmusich @tsusa @VinInn @tvami @pmaksim1 @cmantill @mtosi", "branch": "master", "changed_files": 3, "closed_at": "1600812876", "comments": 36, "commits": 3, "created_at": "1600173800", "deletions": 191, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "7d1fef459f5d1f718eeebccdaa9d8c5b660945ab", "merged_at": "1600812876", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 31469, "release-notes": [], "review_comments": 4, "state": "closed", "title": "PixelCPEClusterRepair Local Errors Bugfix", "updated_at": "1600812876", "user": "OzAmram"}