{"additions": 58, "auther_ref": "semiRandomInitL1PSCounter_124X", "auther_sha": "0b1a2f4740db9f3f9d16d7c1bd077e98668b40c8", "author": "missirol", "body": "backport of #37506\r\n\r\n#### PR description:\r\n\r\nThis PR adds a new option, disabled by default, in `L1TGlobalProducer`. It is a verbatim backport to `12_4_X`, and it would be useful for HLT studies that require the L1T re-emulation.\r\n\r\nFrom the description of the original PR by @silviodonato:\r\n\r\n>The standard behavior of the L1 trigger prescaler is to start a counter from the prescale value (eg. 1000) and then reduce it of one unit every time the corresponding L1 trigger is accepted. Once the counter reach 0, the L1 trigger is consider to pass also the L1 prescale, and the counter goes back to the prescale value. The counter is reset at the beginning of each lumisection (unless you enable #37395)\r\n>\r\n>This PR adds the option to set the initial prescale value of the PS counter from PS to a semirandom value taken in the range [0, PS]. This option is required to avoid that running on a heavily prescaled sample (eg. ZeroBias) the PS counter never reach 0 and therefore no events pass the prescaler. Starting on a random value, the average rate will be closer to the actual rate that we would see in the actual datataking (at P5 the L1 trigger evaluate a huge number of events per LS).\r\n>\r\n>The \"semi-random\" refers to the `std::srand` function which gives a reproducible sequence of random numbers. However the reproducibility is not preserved when running with multithreading because I use also the event number as input of the random number generator. The current L1 trigger precaler does not preserve the reproducibility when multi-threading is on.\r\n>\r\n>This PR is somehow related to #37395.\r\n\r\n#### PR validation:\r\n\r\nRelies on the validation done for the original PR.\r\n\r\n#### If this PR is a backport, please specify the original PR and why you need to backport that PR:\r\n\r\n#37506\r\n\r\nStudies relevant to the development of Run-3 HLT menus.", "branch": "CMSSW_12_4_X", "changed_files": 4, "comments": 6, "commits": 1, "created_at": "1654258718", "deletions": 4, "labels": ["l1-approved", "fully-signed", "tests-approved", "orp-pending", "backport-ok"], "milestone": "CMSSW_12_4_X", "number": 38233, "release-notes": [], "review_comments": 0, "state": "open", "title": "Semi-random initial value in the L1 trigger prescale counter [`12_4_X`]", "updated_at": "1654580218", "user": "missirol"}