{"additions": 294, "auther_ref": "cmsTritonUpdates", "auther_sha": "e24f36272789d033f0196e050c206aa50766c0ad", "author": "fastmachinelearning", "body": "#### PR description:\r\n\r\nThis PR includes several updates to support production-style tests at several sites, including T2_US_Purdue, other T2s, and NERSC. There are also some important fixes for bugs that were found during the course of testing.\r\n\r\nNew features/changes:\r\n* A failed response to a repository index query is now interpreted to indicate that the server should be skipped. (The new load balancer developed at Purdue will intercept the repository index query and return an error if it detects that a GPU is saturated.)\r\n* A site can provide a local GPU server using environment variables `$SONIC_LOCAL_BALANCER_HOST` and `$SONIC_LOCAL_BALANCER_PORT`, set via `cmsset_local.sh` in `SITECONF`. (This is a temporary solution that is eventually expected to migrate to something more standardized, similar to `storage.json`. It is introduced here to facilitate tests at other T2 sites to gain operational experience before determining the final form of this configuration.)\r\n* Separate message category called `TritonDiscovery` to enable tracking/debugging of production-style jobs without requiring full verbosity. (This can be seen as an interim step toward full provenance tracking.)\r\n    * Along these lines, improve handling of verbose output options in test script.\r\n* Support is added for `podman` and `podman-hpc` to launch Triton containers (useful at NERSC).\r\n* Failures of optional server requests are no longer treated as exceptions, to avoid unnecessary job failures.\r\n\r\nBug fixes:\r\n* Modify some apptainer workarounds (remove an old one, add a new one...)\r\n* Check for the presence of a GPU in the `cmsTriton` server launching script, rather than in Python. (Production-style jobs can dump the Python config on a local node and then reuse it on a worker node, so any system calls happen on the local node and may not give the right answer for the worker node as to the presence of a GPU.)\r\n* Fix a bug in the implementation of thread controls for models on the CPU fallback server.\r\n\r\nThere are some interface changes (related to supporting more container engines and checking for local GPUs), which are documented.\r\n\r\n#### PR validation:\r\n\r\nUnit tests succeed. Site-specific options have been tested successfully at the appropriate sites.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNot a backport and not intended to be backported.\r\n", "branch": "master", "changed_files": 9, "comments": 29, "commits": 16, "created_at": "1718029069", "deletions": 125, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-pending", "code-checks-approved", "heterogeneous-approved"], "milestone": "CMSSW_14_1_X", "number": 45182, "release-notes": [], "review_comments": 3, "state": "open", "title": "SONIC updates for site support", "updated_at": "1722950391", "user": "kpedro88"}