{"additions": 400, "auther_ref": "csc_bad_channels_handling_in_rechit_building_updated_for_unganged_me11a", "auther_sha": "023d77683beb19321671bf59e5c5e66d6ff854b1", "author": "ptcox", "body": "[Directed at  73X]. This updates CSC bad channel handling in local reco to allow extension to unganged ME11A channels. Amazingly tricky to do this because the extra channels are appended to the bad channels conditions data. At the same time I decided it was more sensible to change the way the bad channels data are handled. Until now, each time the conditions data changes, the bad channels information was unpacked and stored in a large vector - one 80-bit bitset for the 80 strip channels of each layer in the CSC system: there are 3240 layers in the system. There is also a 112-bitset for the possible bad wiregroups in each layer. However, with unganged ME11A instead of 80 strip channels, we'd have to increase to 64+48=112 bits for the bad strip channels too. So I've changed the approach so the bitsets for a given layer are filled only when that layer is being reconstructed. This saves on storage at the expense of computing time, which is basically trivial. This change is made in CSCConditions, a class in CalibMuon/CSCCalibration, which is our interface to CSC conditions data. There are NO changes to actual conditions data handling - just how the local reco accesses it once it is available. This is done in RecoLocalMuon/CSCRecHitD, where rechits are built. CSCConditions is also used in SimMuon/CSCDigitizer, but the bad channels part is NOT used there (since we don't know how to simulate bad channels even if we know somewhere in the complex change from detector element to read-out signal something is broken.) So there is NO change to Sim code. I added a new test analyzer for the bad channels handling in CSCRecHitD, called CSCRecoBadChannelsAnalyzer. This has a new config in CSCRecHitD/test. I also updated the sample config file for the rechit builder to 72X/73X level. This is run_on_raw_72X.py also in CSCRecHitD/test. I have run on 2500 events from a real data 2012 SingleMu raw relval sample and dumped all rechits built and find identical output for the new code and the old code. I have also run runTheMatrix.py -s --useInput all and this completes with no errors.\n", "branch": "CMSSW_7_3_X", "changed_files": 11, "closed_at": "1412839044", "comments": 39, "commits": 13, "created_at": "1412624724", "deletions": 82, "labels": ["alca-approved", "comparison-available", "fully-signed", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "bf9c140fdf5f381470d0adec4aaa452327fb7d34", "merged_at": "1412839044", "merged_by": "nclopezo", "milestone": "Next CMSSW_7_3_X", "number": 5713, "release-notes": [], "review_comments": 8, "state": "closed", "title": "csc bad channels handling in rechit building updated for unganged me11a", "updated_at": "1412850713", "user": "ptcox"}