{"additions": 417, "auther_ref": "coreSupportForConcurrentDBESSource", "auther_sha": "0daeda2ed74c432755a8ead0081160c70688c091", "author": "wddgit", "body": "#### PR description:\r\n\r\nAdd to Core support needed for CondDBESSource so that\r\nit can be upgraded for concurrent IOVs. These are requirements\r\nI found as I actually implemented the code to migrate CondDBESSource\r\nto support concurrent IOVs. They are in addition to the changes recently\r\nmerged with PR #26592. There are 6 separate commits, each a separate\r\nfeature. The first 3 will only be needed by CondDBESSource. The second\r\ntwo are extra checks for pathological cases, useful in general. The last a\r\nnew unit test.\r\n\r\n1. Notify a DataProxy when a new IOV actually begins.\r\n2. During job initialization explicitly inform how many concurrent\r\nIOVs will be allowed for each record.\r\n3. Include setIntervalFor calls in the global mutex already used for\r\nDataProxy calls producing data.\r\n4. More carefully reset resources in the LuminosityBlockProcessingStatus\r\nobject.\r\n5. Don't allow the number of concurrent IOVs to be greater than the number\r\nof streams or concurrent lumis.\r\n6. Add a new unit test for concurrent IOVs particularly covering new features\r\nlisted above.\r\n\r\nNote the PR migrating CondDBESSource is ready and I intend to submit\r\nit immediately after this PR is merged.\r\n\r\n#### PR validation:\r\n\r\nNew unit test. Note that until the future PR implementing concurrentIOVs\r\nfor CondDBESSource is submitted, this should not cause any noticeable\r\nchange in behavior.\r\n\r\n#### if this PR is a backport please specify the original PR:\r\n\r\nNot a backport.\r\n", "branch": "master", "changed_files": 21, "closed_at": "1568271486", "comments": 26, "commits": 9, "created_at": "1567789660", "deletions": 33, "labels": ["code-checks-approved", "comparison-available", "core-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "7fece42e889ac6792e64c72509e7d28dfce2e9a1", "merged_at": "1568271486", "merged_by": "cmsbuild", "milestone": "CMSSW_11_0_X", "number": 27948, "release-notes": [], "review_comments": 6, "state": "closed", "title": "Core support for concurrent IOVs in CondDBESSource", "updated_at": "1568271487", "user": "wddgit"}