{"additions": 577, "auther_ref": "fo_nt2_unpacker2", "auther_sha": "ccceb7192b313d861e78dc375fe0b4afe7910a31", "author": "CTPPS", "body": "#### PR description:\r\n\r\nFor the TOTEM special run around 25.6.2023, the new T2 telescope will be used to veto diffractive p+p collisions, when measuring the elastic and total p+p cross section.\r\nThe T2 offline code needed to be updated since the common TOTEM/PPS raw data unpacking was previously mapping each payload to a unique (FED ID, GOH ID, fibre)-triplet, but now 2 T2 channels are connected to each fibre, so a single T2 VFAT frame has two payloads. Therefore the xml mapping for T2 in 2023 was updated with a fourth keyword. The xml mapping is preliminary and will still be updated at least for arm 4-5, and pending final validation of physical connectivity.\r\n\r\nThe T2 firmware data format read in by the unpacker was changed from version 2.0 to final version 2.2, so the T2Digi DataFormat class was also changed.\r\nTOTEM/PPS diamond-specific timing calibration was also removed from the T2 RecHit chain.\r\n\r\n#### PR validation:\r\n\r\nThe PR was tested with a streamer file ( run 364983, available in my lxplus directory: ~foljemar/public/) produced by emulated T2 firmware v2.1 (T2 Frame format: https://github.com/CTPPS/cmssw/files/11351944/FrameFormat_V1.xlsx ).\r\n\r\nThe input mapping was successfully used to create T2Digis with the correct input values for leading and trailing edges, ID's and other bits, and the correct number of T2Digis (twice the number of T2 frames). If you run the new T2 test file in RecoPPS/Local/test on the streamer file above, you will get a hwID mismatch since only the upper 8 bits were non-0 in version 2.1.\r\n\r\nI also tested that turning off the new T2 multipayload mapping parser didn't crash on test data, and that the shared TOTEM mapping code changes did not affect DQM plots for TOTEM Timing diamond & Tracking strip detectors, for streamer files from the recent run 366192. \r\n@fabferro likewise checked that no changes in other PPS detectors were observed, see https://github.com/CTPPS/cmssw/pull/73#issuecomment-1527230561\r\nThe runTheMatrix tests all passed just now. \r\nHere I squashed the commits together, the same commits without squashing can be found in CTPPS/cmssw:fo_nt2_unpacker branch.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nSince the 13_1_X cycle will not be used for p+p data taking, we may need to backport to a special TOTEM-only point release of 13_0_X, so the T2 data can be checked at the DQM level during data taking in the special run.\r\n\r\n", "branch": "master", "changed_files": 25, "closed_at": "1683717395", "comments": 41, "commits": 3, "created_at": "1682868275", "deletions": 72, "labels": ["alca-approved", "reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "requires-external", "code-checks-approved", "ctpps"], "merge_commit_sha": "7cfd23548f9e5e73d84e2bb56b5c67fa1a1ec2ed", "merged_at": "1683717395", "merged_by": "cmsbuild", "milestone": "CMSSW_13_2_X", "number": 41472, "release-notes": [], "review_comments": 18, "state": "closed", "title": "New T2 multi-channel payload unpacker for special TOTEM run in June", "updated_at": "1686383392", "user": "oljemark"}