{"additions": 41, "auther_ref": "phase2_generic_errors_fix", "auther_sha": "ad9f4e3e4ffb2eb9ead70f2784710091914cc1de", "author": "OzAmram", "body": "This is the PR intending to fix the loss in the phase 2 tracking performance (efficiency and fakerate) since the 11_1_0 and later releases.\r\n\r\nWe presented about the ongoing issues in several places, most recently at the Tracking POG meeting [here](https://indico.cern.ch/event/912823/contributions/3841072/attachments/2027324/3391939/phase2_det_angle_update_april26.pdf)\r\n\r\nThe PR contains updated template and genError conditions that fix a slight Lorentz Angle mismatch that was introduced in the last conditions.\r\n\r\nIt also introduces a new configuration option for the generic CPE which allows one to use the hardcoded errors when the CPE is called without local track angles (ie in the seeding step) the database values (genErrors) when called with local track angles. This option is turned on only for the phase 2 configuration of the generic CPE. \r\n\r\nThere should be no changes in any phase 1 workflows. \r\n\r\nWe have run the tracking validation comparing the performance of the current CMSSW, the performance before the introduction of the templates for phase 2 and this proposed fix. The plots are [here](http://cmantill.web.cern.ch/cmantill/phase2/PU200_ComparisonCMSSW_11_1_0_pre6/plots/). We see that this fix does indeed fix the efficiency loss and fakerate increase seen in the current release as compared to the 11_0_0 releases. \r\nThere is still an increase in the chi^2 observed for eta > 1.5 or so as compared to the 11_0_0 releases. This has been traced back to the templates having a smaller error for FPIX local x than the hardcoded values, but looking at the pull distributions it seems this is actually the more correct error (RMS with template is ~1 and with hardcoded errors ~0.75). It is believed that the reason the chi^/2dof is larger than 1 is due to a known issue, that the material budget is underestimated, not the CPE's. \r\n\r\n@mmusich @tsusa @mtosi @emiglior @cmantill @tvami @pmaksim1 @JanFSchulte @jalimena @perrotta @slava77 \r\n", "branch": "master", "changed_files": 5, "closed_at": "1589297873", "comments": 24, "commits": 7, "created_at": "1588953074", "deletions": 31, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "ec679864eef1be3e3ea223a9aff4e9746804a25d", "merged_at": "1589297873", "merged_by": "cmsbuild", "milestone": "CMSSW_11_1_X", "number": 29783, "release-notes": [], "review_comments": 6, "state": "closed", "title": "Phase2 Updated Pixel Conditions and GenericCPE Seeding Errors Fix", "updated_at": "1589297873", "user": "OzAmram"}