{"additions": 0, "auther_ref": "removeMTCCHLTrigger", "auther_sha": "b2f9f0219dfb1d22504d2dc5900da35e5a0dbf42", "author": "wddgit", "body": "#### PR description:\r\n\r\nRemove module MTCCHLTrigger\r\n\r\nThe primary motivation for this change is to delete uses of getManyByType so that we can delete the function getManyByType from the Framework without breaking compilation.\r\n\r\nNothing in CMSSW references MTCCHLTrigger. There has been no substantive code development there in more than 10 years.\r\n\r\nThis module has been broken since 2015 at least. The Framework has been throwing an exception when getManyByType is called without a call to consumesMany since 2015. We've just finished a large migration where all code calling both consumesMany and getManyByType was replaced by GetterOfProducts or was removed in some other way. The function consumesMany has been deleted entirely from the Framework. The only uses of getManyByType that are left are the ones where consumeMany was not called. All these have been broken since 2015. The Framework will throw an exception if these calls to getManyByType are executed.\r\n\r\nThis module also has a call to getByLabel with no corresponding call to consumes. That will also fail.\r\n\r\nIt seems there is not enough other content in the module to make it worth saving.\r\n\r\nAlternatively, I could migrate the module to use consumes and GetterOfProducts. I will do that if requested but it does not seem worth the effort. Also deleting dead code is a positive thing. It decreases maintenance efforts and build time.\r\n\r\n#### PR validation:\r\n\r\nNo testing needed. Nothing uses this module, it's already broken, and this just deletes it.\r\n", "branch": "master", "changed_files": 3, "closed_at": "1689438478", "comments": 8, "commits": 1, "created_at": "1689342262", "deletions": 79, "labels": ["daq-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "91743f2e1f5b62cce1586e30ca425ab1607ab673", "merged_at": "1689438478", "merged_by": "cmsbuild", "milestone": "CMSSW_13_2_X", "number": 42269, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Remove MTCCHLTrigger", "updated_at": "1689438478", "user": "wddgit"}