{"additions": 42, "auther_ref": "EMTF_DQMPlot_Fixes_9_19_25", "auther_sha": "5f4d7b26107225b82100f97b68c916263da4692f", "author": "kmorrison314", "body": "#### PR description:\r\n\r\nThe proposed changes look to fix minor errors in the EMTF Errors Plot and the gemChamberVFATBX* / gemVFATBXPerChamber* Plots. \r\n\r\nDue to changes in the variable names of EMTF Errors in 2022, the EMTF Errors plot has not displaying the proper errors and instead has been following the Run 2 convention. This code update adds a Run 3 flag to the EMTF DQM code which when true produces the proper error plot while maintaining the option for Run 2 error plots to be produced. \r\n\r\nThe proposed fix for the GEM plots is the result of an error in the calculation of the VFAT number. This error was due to the mis-designation of GEM Partition number which changes between hardware and software.\r\n\r\n#### PR validation:\r\n\r\nIn order to validate these changes, the new DQM code was run over a Run 3 file with the Run 3 flag to confirm that the proper plot was produced. In addition, the DQM was run with a forced error to ensure that the plot was filling properly.\r\n\r\nEDIT: All of the standard checks were completed (scram b distclean, scram b -j 8, scram build code-checks, scram build code-format)\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis is not a backport request, though if deemed necessary, it would be backported for all of Run 3\r\n", "branch": "master", "changed_files": 3, "comments": 4, "commits": 3, "created_at": "1758705312", "deletions": 20, "labels": ["dqm-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_16_0_X", "number": 48979, "release-notes": [], "review_comments": 0, "state": "open", "title": "[L1T] EMTF DQM Errors Plot and GEM Plot Minor Fixes", "updated_at": "1758718927", "user": "kmorrison314"}