{"additions": 395, "auther_ref": "CMSSW_9_1_X_tau-pog_miniAOD-tauMVAs", "auther_sha": "48fa4c5dd8687ed4bb3608334eae249bfd9b1be6", "author": "cms-tau-pog", "body": "This is a PR that had been stalled on 90X since cmssw was just in the transition to 91X. Comments from RECO formerly made here (https://github.com/cms-sw/cmssw/pull/17624) have now been addressed and the PR migrated to 91X. I'm copying the comments of the former PR here once again to make clear hat this is about. Note that these developments are most relevant for current analyses so upon integration they will require backports down to 81X.  \r\n\r\nDear colleagues,\r\n\r\nthis pull request comprises three developments that have been made to facilitate the access to new TauID information that is now available based on trainings made on the whole 2016 dataset.\r\n\r\n * configuring access to the new MVATauID training that has been made on the full 2016 dataset.\r\n * introducing a bypass for a variable that could be missing on miniAOD (phiAtEcalEntrace) -- when set to true by configuration this variable can be approximated from existing miniAOD information. This is in the first place in preparation for a backport to 80X, where this issue occurs. By default and for CMSSW>=8_1_X the parameter will be false.\r\n * adding a producer plugin (PATTauIDEmbedder) that allows to write a slimmedTau collection back into the EDM event content with updated MVAIsolation and MVA electron identification.\r\n\r\nAll these changes are \"high level\" with effect only on the analysis level on already existing miniAOD. They are meant for the currently ongoing analyses with the actual target to be backported down to CMSSW_8_0_X.\r\n\r\nNeither unit/matrixTests nor DQM plots tracking physics performance should be affected by these changes.\r\n\r\nCheers,\r\nRoger", "branch": "master", "changed_files": 17, "closed_at": "1493707100", "comments": 37, "commits": 22, "created_at": "1491471346", "deletions": 226, "labels": ["analysis-pending", "comparison-available", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "dadb6641a5efe59fc23bdd565a5b6562e5e7543d", "merged_at": "1493707100", "merged_by": "davidlange6", "milestone": "CMSSW_9_1_X", "number": 18244, "release-notes": [], "review_comments": 28, "state": "closed", "title": "Developments to provide facilitated access to new TauID information (all high level changes) ", "updated_at": "1510909840", "user": "roger-wolf"}