{"additions": 15, "auther_ref": "clarify-elem-names", "auther_sha": "89068ebe33bd77004f5d75c25a7bae2f11634a7a", "author": "cvuosalo", "body": "Elementary materials inside ROOT and Geant4 use two names, called variously the \"name\" and \"title\" or the \"name\" and \"symbol\". With DD4hep, redefined elements were given the second name \"CMS element\" because it was thought that this second name was not used. However, it does show up in Geant4 GDML and causes confusion when multiple elements all have \"CMS element\" as a second name.\r\n\r\nIt should be noted that our code uses ROOT elements unchanged by default, unless they have atomic masses that differ from the standard atomic masses specified for Geant4, in which case the elements are redefined.\r\n\r\nThis PR leaves ROOT elements unchanged, but for those elements our code redefines to make their atomic masses match the Geant4 standard, their two names are made to match each other. Thus, ROOT elements have names like \"HYDROGEN (H)\", while redefined elements have names like \"Oxygen (Oxygen)\". The format of the names doesn't matter as long as the names are unique.\r\n\r\nThis PR also promotes to Warning messages about composite materials that have undefined components. It is planned to make this condition an exception, with the Warning message as a first step to allow changing any remaining cases in Phase 2 before the exception is implemented.\r\n\r\nA simple fix of the DD4hep overlap check config is also included in this PR.\r\n\r\n#### PR validation:\r\n\r\nThe `SimG4Core/PrintGeomInfo/test/python/g4OverlapCheckDD4hep_cfg.py` was run to check the Geant4 materials list and the GDML file to verify that they contain unique element names for both names.\r\n\r\nNo backport is needed.", "branch": "master", "changed_files": 2, "closed_at": "1637277132", "comments": 10, "commits": 2, "created_at": "1637104811", "deletions": 13, "labels": ["geometry-approved", "simulation-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "f901f5be218d19065b0e65ebd7f1b629eb3f15b2", "merged_at": "1637277132", "merged_by": "cmsbuild", "milestone": "CMSSW_12_2_X", "number": 36149, "release-notes": [], "review_comments": 0, "state": "closed", "title": "[DD4hep] Add second name to elementary materials for Geant4 GDML", "updated_at": "1637277133", "user": "cvuosalo"}