{"additions": 305, "auther_ref": "make-alignment-great-again", "auther_sha": "7cdaf2641a26b1efc6d1e74d06ab97111049da16", "author": "ghellwig", "body": "This algorithm consistently introduces the notion of randomness into the determination of tracker alignment conditions.\r\n\r\nIt simultaneously determines the parameters of the TrackerAlignmentRcd, TrackerAlignmentErrorExtendedRcd, TrackerSurfaceDeformationRcd, SiPixelLorentzAngleRcd, SiStripLorentzAngleRcd, and SiStripBackPlaneCorrectionRcd.\r\n\r\nThe algorithm is GREAt because it does not even require data. Hence it is the natural choice when predicting the alignment prior to data taking.\r\n\r\nFor the same reason it allows to disentangle the CMS and LHC schedule from the alignment expert's vacation plans because the alignment can be derived at any point in time.\r\n\r\nIn addition to the above-mentioned convenience features it also shows unprecedented performance improvements:\r\n - It's extremely fast! All the above-mentioned records are derived almost instantly, thereby dramatically reducing the time budget of normally 1-2 weeks.  \r\n - Due to its inherent GREAt-ness, validation is not required anymore. Thus the total time between the request of a new alignment and the delivery can be reduced to a few seconds.\r\n\r\nIt also solves the typical problem of conventional algorithms that have to deal with complaints about delays caused by the missing tracker alignment conditions. The first complaints about delay typically arise several days, sometimes weeks, before all inputs of the conventional algorithms are available. The extreme reduction of the required inputs for the GREAtAlgorithm fully avoids this problem in a straight forward fashion.\r\n\r\nNOTE: The implementation of this alignment algorithm is unique as it requires no data. Thus the overhead of the AligmentProducer framework is elegantly circumvented.\r\n\r\nattn.; @hroskes, @connorpa, @mschrode", "branch": "master", "changed_files": 4, "closed_at": "1522860835", "comments": 16, "commits": 1, "created_at": "1522530543", "deletions": 0, "labels": ["alca-pending", "code-checks-approved", "comparison-available", "new-package-pending", "orp-pending", "pending-signatures", "tests-approved"], "milestone": "CMSSW_10_2_X", "number": 22816, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Introduce GREAt algorithm.", "updated_at": "1522860851", "user": "ghellwig"}