{"additions": 811, "auther_ref": "CMSSW_12_4_0_pre2_particleNet_SONIC", "auther_sha": "27267a5fab7175b5dc5dbe4e8bdc5bb413ca61ca", "author": "wpmccormack", "body": "#### PR description:\r\n\r\nThis PR introduces a producer for ParticleNet using SONIC for co-processor-enabled inferences-as-a-service.  The main versions of ParticleNet are all included (AK4, AK8 general, MassDecorrelation, and MassRegression), as are configs for both ONNX versions and PyTorch versions of the models.  For more information on the status of SONIC, please refer to this presentation to JetMET DPG: https://indico.cern.ch/event/1143469/contributions/4799423/attachments/2416540/4135308/March_28_JetMET_SONIC.pdf. Please note that the producer introduced here does not affect the main ParticleNet producer in any way (https://github.com/cms-sw/cmssw/blob/master/RecoBTag/ONNXRuntime/plugins/BoostedJetONNXJetTagsProducer.cc). This is an alternate way to run the standard ParticleNet model using inference as a service. As noted in the linked slides, this producer has been validated locally on Tier 2 resources and at scale with cloud computing, but with this PR, we hope to perform more \"official\" production tests.  Again, this producer does not any workflow unless explicitly called. A helper-function macro is slightly modified, as are a few config files. There will be an accompanying PR into https://github.com/cms-data/RecoBTag-Combined, which adds needed model files.\r\n\r\nTagging @kpedro88 @yongbinfeng @violatingcp @nhanvtran @jmduarte\r\n\r\n#### PR validation:\r\n\r\nThis PR was tested on LPC using a Triton server running on the GPU-enabled AILab machines at FermiLab. Tests have also been performed using the ParticleNet SONIC producer at Purdue T2 and in Google Cloud. When the producer is not called, there is no performance impact, and when it is called, the Jet Tagging results are the same as for the generic ParticleNet producer.", "branch": "master", "changed_files": 15, "comments": 25, "commits": 4, "created_at": "1652709096", "deletions": 138, "labels": ["reconstruction-pending", "operations-pending", "pending-signatures", "orp-pending", "tests-started", "requires-external", "code-checks-approved", "btv-pog-pending", "btv"], "milestone": "CMSSW_12_5_X", "number": 37964, "release-notes": [], "review_comments": 12, "state": "open", "title": "Adding SONIC ParticleNet Producer to CMSSW", "updated_at": "1654849860", "user": "wpmccormack"}