{"additions": 23, "auther_ref": "Aug25_int10_approxClusters", "auther_sha": "0e3e268a52636360d11704f62a21cb4c5ee8fcc9", "author": "abaty", "body": "This PR is aimed at significantly reducing the size of the RAW' data format which uses the Approximated Cluster class, as the current implementation is not fully optimized.  This is the subsequent PR for improving the format which is mentioned at the end of the first paragraph in the description of PR #38423.\r\n\r\nThe space savings is accomplished by changing the full-precision float class members of SiStripApproximatedCluster to integer data types having limited precision.  In the case of the cluster width and average charge, values are rounded to the nearest whole number.  For the barycenter, rounding to one decimal place was found to give a good tradeoff of tracking performance and space savings .  To avoid using a floating point number, the barycenter is multiplied by 10 and stored as a 16-bit integer, and is converted back when regenerating the cluster collection from approximated clusters.  This reduces the approximated cluster collection size by 37% over the current implementation, and the SiStrip detector payload by 45% compared to the conventional RAW format.  A small loss (~0.5%) of inclusive tracks was observed, but largely disappears when applying analysis-type track selections.  (More info on our tests at [1], which was discussed in our data format working group)\r\n\r\nThis PR also incorporates two suggestions from @makortel for cleaning up the approximated cluster code [2,3].\r\n\r\n[1] https://twiki.cern.ch/twiki/pub/Main/HIDetectorReadout2020/ApproxClusters_integer10th_Aug25.pdf\r\n[2] https://github.com/cms-sw/cmssw/commit/8871eff2433649ccd801afc52edc00bbcf2f54d2\r\n[3] https://github.com/cms-sw/cmssw/commit/0492f1f0803339ca24396a0429fb8b0c51aae72b\r\n\r\n#### PR validation:\r\n\r\nThis PR can be tested using WF 140.58 and checking step2 to verify the smaller approx. cluster size.  Step 3 can be used to check physics performance and tracking differences.\r\n\r\n@icali @mandrenguyen \r\n\r\n", "branch": "master", "changed_files": 6, "closed_at": "1661519622", "comments": 10, "commits": 2, "created_at": "1661439350", "deletions": 20, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "bc79ae185250b2653b7f6046eb55292d1e28729b", "merged_at": "1661519622", "merged_by": "cmsbuild", "milestone": "CMSSW_12_5_X", "number": 39199, "release-notes": [], "review_comments": 5, "state": "closed", "title": "Reduction of RAW' data size via adjustment of approx. cluster member data types", "updated_at": "1661519622", "user": "abaty"}