{"additions": 10202, "auther_ref": "ProcessBlockPersistence21", "auther_sha": "6ecbb2770f75104fb50632bceee21124bc9a7531", "author": "wddgit", "body": "#### PR description:\r\n\r\nImplements persistence for ProcessBlock products.\r\n\r\nThis continues the work started in #30117, which implemented the non-persistent part of the ProcessBlock feature of the Framework.\r\n\r\nI am currently working on updating the TWIKI documentation related to ProcessBlock.  At the moment this PR is being submitted, the documentation only covers the non-persistent parts of the ProcessBlock feature. My plan is that within a few days the content of this PR will be described in more detail there. Currently, the TWIKI page is located here: \r\n\r\nhttps://twiki.cern.ch/twiki/bin/view/CMSPublic/SWGuideProcessBlockData\r\n\r\n#### PR validation:\r\n\r\nThis PR adds many unit tests that cover all the features added by the PR.\r\n\r\nThis PR should have almost no effect at all on existing workflows. There is nothing outside of the new unit tests that creates persistent ProcessBlock products. A file written without any kept ProcessBlock products will be identical to a file written by a version of CMSSW that predates this PR. If no ProcessBlock products are read from input or kept in the output the added overheads in terms of CPU and memory should be negligible. And the behavior and output of a cmsRun job should not be affected at all.\r\n\r\nNothing should change in the output of existing workflows until future code changes are merged that cause ProcessBlock products to be saved to output files.\r\n", "branch": "master", "changed_files": 224, "closed_at": "1626603725", "comments": 37, "commits": 26, "created_at": "1622746464", "deletions": 1095, "labels": ["code-checks-approved", "core-approved", "dqm-approved", "fully-signed", "orp-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "7e1bd4eeba8079d871a9dce744c32997c27ce53e", "merged_at": "1626603725", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 33969, "release-notes": [], "review_comments": 130, "state": "closed", "title": "Implement persistence for ProcessBlock products", "updated_at": "1626603725", "user": "wddgit"}