{"additions": 95, "auther_ref": "esconsumesL1TriggerL1THGCal", "auther_sha": "7b98ac97f646d6b1af20053904d40aa5f7531936", "author": "makortel", "body": "#### PR description:\r\n\r\nIn addition of using ESGetToken in HGCalTriggerGeometryESProducer (as part of #26748), this PR suggests to use raw pointers instead of `ESHandle` for the contained products in HGCalTriggerGeometryBase and derived classes.\r\n\r\nThis change does alter the behavior, as now the existence of the input products is always checked in the ESProducer (earlier it was checked at the first time when the HGCalTriggerGeometryBase or -derived class accessed the input products).\r\n\r\n~~There is one caveat though. Currently the ESProducer tries to read CaloGeometry, and if either CaloGeometry is not available or does not have the expected content, the ESProducer reads 3 HGCalGeometry products. With the solution in this PR, all 4 objects would get produced in the (eventual) prefetching, which is not necessarily what we want. On the other hand, (based on my understanding of the code) memory-wise this issue would only affect HGCal < V9 geometries, but I don't know how relevant those workflows still are. In addition, in principle the `phase2_hgcalV9` modifier could be used to control the behavior of this ESProducer.~~ In addition, the ESProducer is modified to use the `phase2_hgcalV9` modifier to control whether to read the CaloGeometry (for V7/V8 geometries) or 3 HGCalGeometry objects (V9 and beyond).\r\n\r\n#### PR validation:\r\n\r\nCode compiles.", "branch": "master", "changed_files": 11, "closed_at": "1561659332", "comments": 21, "commits": 4, "created_at": "1560874466", "deletions": 102, "labels": ["code-checks-approved", "comparison-available", "l1-pending", "orp-approved", "pending-signatures", "tests-approved", "upgrade-approved"], "merge_commit_sha": "6dfed1fdb97b7521d5fe0a344ad9f44af3f0bda4", "merged_at": "1561659332", "merged_by": "cmsbuild", "milestone": "CMSSW_11_0_X", "number": 27242, "release-notes": [], "review_comments": 8, "state": "closed", "title": "Modernize HGCalTriggerGeometryESProducer", "updated_at": "1561659332", "user": "makortel"}