{"additions": 1535, "auther_ref": "GenericTPDQM920", "auther_sha": "9636bcf9626f001993f6d941c1b598a8b7eb3a13", "author": "Sam-Harper", "body": "This a re-submission of https://github.com/cms-sw/cmssw/pull/18969 which went all bit wrong and I have zero time to fix.  I have copied over the PR text below.\r\n\r\nThis also modifies VID producers not to crash on missing object input collections. This was necessary and the reason why is discussed in the comments of the change.  Finally it makes backwards compatible changes to GenericTriggerEventFlag so I dont need to pass in the EDProducer address and at the same time makes it movable by turning the last pointer to a std::unique_ptr\r\n\r\nOriginal PR text:\r\n\r\nThis is an initial version of the E/gamma T&P offline DQM. This code is near feature complete and produces correct output (as far as I can tell) . However there are some layout and naming issues which I would like to solicit suggestions for before this PR is considered for integration.\r\n\r\nThe goal of this class is to be object agnostic, hence the templating.\r\n\r\nThe idea is very simple.\r\n\r\nSelect the event with a trigger. Require the tag to pass an HLT requirement & selection requirement. Require the probes to pass other selection requirements to entire the sample. Mass and opposite sign requirements are then applied.\r\nThere are then a series of histograms associated with each filter we wish to measure, one for all probe passing sample cuts and probes then passing the filter.\r\nThere are various levels of tag, probe kinematic and trigger selection: all t&p pairs (ie tag in barrel, passing tag trigger), all histograms of a filter (ie requiring Et to be > threshold, tag to pass an additional trigger, ie the single leg of a double legged trigger), and a specific histogram (ie requiring the probe to be in the endcap to measure the turn on in the endcap region only).\r\n\r\nAll the magic is in https://github.com/Sam-Harper/cmssw/blob/32a8b63ed2afd1a80771776d7c441b40cd3367bb/DQMOffline/Trigger/interface/HLTTagAndProbeEff.h\r\n\r\nThere are 3 main classes\r\n\r\nHLTTagAndProbeEff : creates tag and probe pairs and then passes the pairs to the histograms.\r\n\r\nHLTDQMHistColl : corresponds to a single filter for which we wish to measure the efficiency. Can apply additional selection to the tag & probe (ie restricting them to certain Et, eta ranges, requiring the tag to pass additional HLT requirements). Contains all the individual histograms which are of type HLTDQM1DHist and HLTDQM2DHist and automically fill themselves with the specified vs variable\r\n\r\nRangeCutColl: ID selection is handled by edm::ValueMap this class is intended to cut on kinematic variables such as et, eta, phi. It allows us to restrict to a certain eta region (tags in the barrel, probes in HEP17, probes > Et threshold etc)\r\n\r\nFor the ID selection of tag & probe it was intended to use VID but I didnt get it working so made a temporary ID module to do that for the time being.\r\n\r\nSuggestions on names and how to split them up are welcome. RangeCutColl and HLTDQMHist share the same mechanism to store the variable in question which is the sticking point.\r\n\r\nAlso suggestion on alternative ways to achieve the this are also welcome although performance/clarity gains would have to balanced against work required to make them.", "branch": "master", "changed_files": 18, "closed_at": "1496841666", "comments": 22, "commits": 11, "created_at": "1496245300", "deletions": 28, "labels": ["analysis-pending", "comparison-available", "dqm-approved", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "76d343005c33105be1e01b7b7278c07d753398db", "merged_at": "1496841666", "merged_by": "davidlange6", "milestone": "CMSSW_9_2_X", "number": 19046, "release-notes": [], "review_comments": 5, "state": "closed", "title": "E/gamma T&P Offline DQM : 92X + VID + GenericTrigEventFlag Changes", "updated_at": "1496916763", "user": "Sam-Harper"}