{"additions": 260, "auther_ref": "Scouting2024EGDataFormatUpdate_from1400pre2", "auther_sha": "449786282caeb048c12ce220e63c36ae20da6560", "author": "arsahasransu", "body": "#### PR description:\r\n\r\nUpdate the scouting data format for electrons and photons to store additional variables for the 2024 data taking. This PR will cause changes to the scouting RAW output format. The additional memory required to store the variables is expected to be negligible. \r\n\r\nThe added variables in both electrons and photons will enable better energy regression studies and they are expected to essentially match the resolution offline reconstruction. For more details, please check the slides at TODO.\r\n\r\n#### PR validation:\r\n\r\n - The basic code check and formatting has been completed. \r\n - Tests suggested in  [CMSSW PR instructions](https://cms-sw.github.io/PRWorkflow.html) passed.\r\n - The test classes DataFormats/Scouting/test/TestWriteRun3Scouting.cc and  DataFormats/Scouting/test/test_readRun3Scouting_cfg.py were updated.\r\n - An HLT configuration was rerun on the DoubleElectronGun MC sample with the new commits. The configuration and the ROOT output can be found in AFS public workspace at /afs/cern.ch/work/a/asahasra/public/ScoutingStudy/For2024ScoutingEGUpdate/CMSSW_14_0_0_pre2/src. The output was manually verified to check whether the correct branches were filled and sensible values were obtained in the respective branches.\r\n - The PR will be back ported to the CMSSW_13_3_X release cycle to enable its test in the HLT development configuration.", "branch": "master", "changed_files": 9, "comments": 1, "commits": 1, "created_at": "1705574775", "deletions": 31, "labels": ["hlt-pending", "core-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending"], "milestone": "CMSSW_14_0_X", "number": 43742, "release-notes": [], "review_comments": 0, "state": "open", "title": "Electron and Photon Scouting Data Format Update for 2024 pp Collisions", "updated_at": "1705574796", "user": "arsahasransu"}