{"additions": 72, "auther_ref": "from-CMSSW_10_2_0_pre5", "auther_sha": "2cf960f368ccadeb1897eec72b72b8e8ba8bacbb", "author": "mjansova", "body": "This PR follows a request of the strip local reco conveners (@mmusich, @echabert).\r\n\r\nIt aims to be integrated in 10_2_0_pre6.\r\n\r\nThis PR contains mainly changes in the configuration files SimGeneral/MixingModule/python/SiStripSimParameters_cfi.py and SimTracker/SiStripDigitizer/python/SiStripDigiSimLink_cfi.py. It will affect the simulation of SiStrip tracker hits leading to a better description of their properties.\r\n\r\nThe cross-talk parameters (called here \"CouplingConstants\") describe the charge sharing between neighbor channels in the SiStrip tracker. Those parameters are used by the file SimTracker/SiStripDigitizer/plugins/SiTrivialInduceChargeOnStrips.cc .\r\n\r\nThus only the shape of the simulated and then reconstructed clusters will be affected: change of the seed charge, change of the cluster width. The total cluster charge will almost be unchanged as the parameters only change the charge sharing but not the normalization.\r\n\r\nThe previous parameters were determined at run I but with ageing, these parameters had to be re-evaluated.\r\n\r\nA measurement have been done (VR run with cosmics data) and the results are propagated into the config files.\r\n\r\nData/MC validation have been made to ensure that the new parameters improve the agreement of the cluster seed charge and the cluster width.\r\n\r\nThe validation plots can be found here: https://indico.cern.ch/event/688867/contributions/3040427/attachments/1670393/2679458/cross_talk2018_validation.pdf\r\n\r\nOn top of the configuration file, a modification of  SimTracker/SiStripDigitizer/plugins/SiTrivialInduceChargeOnStrips.cc has been done to allow the activation of the new parameters through flags.\r\n\r\nThey are split into two categories: barrel modules (activated via  CouplingConstantsRunIIDecB ) and disk/wheels (via CouplingConstantsRunIIDecW ). If the two booleans are set to False, the default simulation will be executed.\r\n\r\nBy default the flags are turned to False, thus the simulation will not be modified.\r\n\r\nWe plan to request special reval with the flag turned to True so that we can validate the changes and turn it to True in the next pre-realease.", "branch": "master", "changed_files": 3, "closed_at": "1529588982", "comments": 22, "commits": 4, "created_at": "1529394505", "deletions": 1, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "a571295f873bd545d7c096032cecd9f8553522d7", "merged_at": "1529588982", "merged_by": "cmsbuild", "milestone": "CMSSW_10_2_X", "number": 23621, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Change of SiStrip cross-talk parameters: improvement of the simulated hits", "updated_at": "1529588982", "user": "mjansova"}