{"additions": 170, "auther_ref": "dbouputservice-payload-ptr-ownership-0-121X", "auther_sha": "0eada5d56f1c0867840f0281cc17d53f640c46cb", "author": "ggovi", "body": "#### PR description:\r\n\r\nA review of the overall CMSSW client code of the DBOutputService interface for creating/updating condition data sets (sequences of pairs iov/payload ), has found that the clients are mostly assuming (wrongly) the service to take over the ownership, resulting in a generalised memory leak.  \r\nOnly few classes are currently implementing the policy correctly. \r\nTo cope with that, I propose the following changes:\r\n1. Implement a centralised policy in the service, taking over (as expected by most of the clients) the payload pointer ownership. This will happen by calling the already existing function signatures accepting a pointer as input: writeOne, createNewIOV, appendSinceTime. The called function will take care to free the allocated memory. For the caller, no change is strictly required if it does not free the memory after the call.\r\n2. Introduce a new set of methods with a reference-based signature for writeOne, createNewIOV and appendSinceTime.\r\nThese new methods are used in this PR to migrate the code of the clients already holding the payload ptr ownership. In addition, all of the other clients, currently not freeing the payload memory,  will be asked to move to this interface. This change will improve the overall memory management and the code readability.\r\n3. Introduce a new method \"writeMany\" scoped to the atomic update of many iovs/payloads. In this PR, this is used for a new implementation of the PopCon workflow. \r\n4.  Modify the PopCon interface to provide a safer memory management: on the side of the existing vector m_to_transfer holding bare payload pointers has been added a new container (\"m_iovs\") of payloads based on shared_ptr. The client of PopCon are expected to migrate their code to replace the use of m_to_tranfer in favour of m_iovs.\r\n\r\n#### PR validation:\r\n\r\nUnit tests/Integration test/O2O tests\r\n\r\n", "branch": "master", "changed_files": 20, "closed_at": "1630419861", "comments": 23, "commits": 5, "created_at": "1630070197", "deletions": 200, "labels": ["alca-approved", "reconstruction-approved", "simulation-approved", "fully-signed", "tests-approved", "db-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "d13529b3dc5fe767687a4908b783694065dcb069", "merged_at": "1630419861", "merged_by": "cmsbuild", "milestone": "CMSSW_12_1_X", "number": 35048, "release-notes": [], "review_comments": 4, "state": "closed", "title": "Centralise payload ptr ownership for condition updating workflows", "updated_at": "1630419861", "user": "ggovi"}