{"additions": 781, "auther_ref": "phase1pixeldqm-histo-reorganisation-pre1", "auther_sha": "275cf14de66c4e7b23299349b8a5d55b9026a14f", "author": "schneiml", "body": "This pull request starts to rearrange the Phase1 plots closer to their final layout:\r\n\r\n- Different quantities use different top folders\r\n- The last level of grouping is reflected in the name, not in the folder, to have all 'same level' plots next to each other.\r\n- DetIds on the lowest level are replaced by online module names.\r\n- `nclusters` redefined to count only size>1 clusters, since this is the significant quantity for e.g. timing scans.\r\n\r\nThere are some more or less unrelated changes to `SiPixelPhase1Common`:\r\n- The ability to use `|` in Specifications to separate FPIX/BPIX names has been removed, instead FPIX and BPIX Specifications are now independent. This simpilfies the control flow in the `HistogramManager` a bit and removes some hard-to-understand behaviour. The downside is that data may now be silently dropped if the Specification does not cover the full detector (`bookUndefined = False`), since it is no longer possible to cover the full detector at once.\r\n\r\n- The naming changes mentioned above required refactoring the histogram naming code significantly, things are now a bit more complicated but consistent.\r\n\r\n- `GeometryInterface` now uses floating-point instead of integer values, which should allow better automatic labels on some plots.\r\n\r\n- A simple plugin (`SiPixelPhase1GeometryDebug`) outputs various Geometry quantities plotted against each other, to check if things come out as expected.\r\n\r\nAnd finally some changes to the online clients. They now use the file input source and the `pixel` client is phase1 only, even though it is still configured for phase0 data. A variant using phase1 data exists in `DQM/SiPixelPhase1Config/test`.\r\n\r\nThe histogram layout in the `PixelPhase1/` folder is still far from final, and will take some more time.\r\n\r\n(also @fioriNTU @davidcarbonis )", "branch": "CMSSW_9_0_X", "changed_files": 32, "closed_at": "1481698251", "comments": 8, "commits": 19, "created_at": "1480955072", "deletions": 543, "labels": ["comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "af1d29d3f7550c011fa9ff4e40a3219f3b27fced", "merged_at": "1481698251", "merged_by": "cmsbuild", "milestone": "CMSSW_9_0_X", "number": 16875, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Phase1 Pixel DQM Histogram Reorganisation", "updated_at": "1481698251", "user": "schneiml"}