{"additions": 2316, "auther_ref": "pythia8cfgrandom_80xV4", "auther_sha": "06c3c39c5a19e060bc7433a732a703db26082929", "author": "bendavid", "body": "Adds the possibility to provide a list of configurations to Pythia8 and randomly select from the list of possible configurations at beginLuminosityBlock time.\n\nThis allows to produce a parameter scan in a single monte carlo request/dataset for whatever can be varied at the pythia level. This is targeted initially for SUSY fastsim signal production in 80x where the parameter scan is over the SUSY decay chain defined by the SLHA header, which can be inlined as part of the pythia8 configuration.\n\nSince the changes are non-trivial agreed to put it in 81x first and backport afterwards.\n\nThis is the (near) final implementation of the proposal discussed in https://indico.cern.ch/event/487292/contribution/15/attachments/1218978/1781280/susyscan-Jan28-2016.pdf\n\nDoing this safely requires a more complete re-initizalization of pythia at lumi section boundaries (pointer to main program and those related to userhooks are completely deleted and recreated rather than just calling init() again)\n\nI've tested that this does not leak memory at any observable rate over several thousand lumi sections.\n\nThe inheritance of the Pythia8 interfaces was also slightly reorganized so that everything really inherits from BaseHadronizer now. (previously some of the particle guns did not, which made it more painful to extend the hadronizer api)\n\nThe DataFormats changes are needed to store in the event information on which config has been chosen as well as the LHE-related info discussed below.  A new GenLumiInfoHeader class is created so that it can be filled in beginLuminosityBlock and accessed within a lumi section if needed.  (existing GenLumiInfoProduct needs information only available at the end of the lumi section)\n\nThere is an important new functionality on top of this to allow accessing a gridpack and producing LHE events within the BaseHadronizer at beginLuminosityBlock time instead of in the ExternalLHEProducer.  In this case gridpacks can also be randomly selected together with the pythia configuration.  LHE events produced in this way bypass completely the existing LHE machinery in CMSSW and use directly the Pythia8 LHE parser.  In this case the related information on additional weights must be stored in the GenEventInfoProduct and new GenLumiInfoHeader.\n\nNote that due to some issues in the Pythia8 LHE parser the information related to which weight is which in the GenEventInfoProduct is currently incomplete.  This will require some further patches and/or updates to pythia8 to fully resolve, but this pull request is already at least functional without it, so we should get it into the release and tested.\n\nThis pull request replaces https://github.com/cms-sw/cmssw/pull/13433\n", "branch": "CMSSW_8_1_X", "changed_files": 21, "closed_at": "1457600200", "comments": 29, "commits": 25, "created_at": "1456789059", "deletions": 221, "labels": ["analysis-pending", "comparison-available", "generators-approved", "orp-approved", "pending-signatures", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "870ea92a750b3b7dba2a84c8a6660906644c9829", "merged_at": "1457600200", "merged_by": "davidlange6", "milestone": "Next CMSSW_8_1_X", "number": 13530, "release-notes": [], "review_comments": 5, "state": "closed", "title": "Changes needed for SUSY parameter scans", "updated_at": "1457600200", "user": "bendavid"}