{"additions": 55, "auther_ref": "fo_nt2_dqm", "auther_sha": "403ae54691bb5664e59a566c4c8dc8875dd34430", "author": "CTPPS", "body": "#### PR description:\r\n\r\nFor the TOTEM special run around 25.6.2023, the new T2 telescope will be used (and removed after the run) to veto diffractive p+p collisions, when measuring the elastic and total p+p cross section.\r\nThe T2 DQM plots for timing (leading/trailing/time-over-threshold) were fixed to use the correct timing constant to calculate edge times. New per-channel timing plots were added, after the recent dual-channel T2 unpacker was introduced in PR #41472 .\r\nThe emulated T2 test file used as input for the test script totemt2_dqm_test_cfg.py is read in from the cms-data externals website ( http://cmsrep.cern.ch/cmssw/download/data/ ) created for the PR #41472 unit test.\r\n\r\n#### PR validation:\r\nThe python file was run and produced the correct timing plots per arm, taking into account the emulated input values per event (from PR #41472 :  https://github.com/CTPPS/cmssw/files/11351944/FrameFormat_V1.xlsx ), and the corrected timing constant, and the expected number of channel timing plots (64 channels total, 32/arm, 4 channels/plane), with the right contents.\r\nThe matrix test was also run with 0 failures (no unit tests to run in this package).\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis will later be backported to a special release on the 13_0_X cycle, for the special run data taking. (The backport of PR #41472 is awaiting a final mapping test to be done quite soon, hopefully).\r\n\r\n", "branch": "master", "changed_files": 2, "comments": 17, "commits": 9, "created_at": "1685017243", "deletions": 12, "labels": ["dqm-approved", "fully-signed", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_13_2_X", "number": 41777, "release-notes": [], "review_comments": 3, "state": "open", "title": "Totem New T2 DQM timing plot fixes and enhancements, for use only in special run around 25.6", "updated_at": "1685150564", "user": "oljemark"}