{"additions": 3345, "auther_ref": "mergeChangesToHIPAlignmentAlgorithm920p2", "auther_sha": "4e37945e053badab6cbdfaf7c23758ca5a279b19", "author": "usarica", "body": "Motivation:\r\n- The submitted jobs often required the submitter to watch them, and submission involved steps that could be automatized.\r\n- Alignment starting from slightly different conditions (GT, extra loads to GT) required extra intermediate steps\r\n1) Re-organized batchHippy and configureHippy\r\n2) Implemented an option parser class\r\n3) Changes were propagated to the templates cfg files that reside in python. Flexibility is given to change this directory, and the name of some of these files.\r\n- Hardcoded formula for track eta-dependent reweighting of chi-squared was present in the C++ code\r\n1) Option migrated to the cfi file, the exact formula string is kept in a commented line in align cfg.\r\n- A tight max. relative parameter error cut was present and was found to be ineffective\r\n1) Option defaulted to -1 everywhere\r\n- Alignable-specific cuts were added.\r\n- Per-alignable reweighting of chi-square based on different data samples is now supported as another way to reweight (not based on tracks but actually on hits count in the particular alignable).\r\n- The algorithm did not support the alignment of surface deformations. This feature is now supported.\r\n1) Additional options in the cfi file. Configuration example in common cfg in python/ (but disabled)\r\n2) Some revision and rearrangement was needed in HIPAlignmentAlgortihm, HIPUserVariables. New container classes were also added for the alignable-specific cuts.\r\n3) Alignment of surface deformations made optional through a flag in batchHippy.\r\n\r\nChecks: \r\n- Checks were done running different alignments with the pixel and strips at module, module unit or higher level alignments as part of the (ongoing) tracker alignment campaign.\r\n- See these slides for a quick overview of items implemented and checks done:\r\nhttps://indico.cern.ch/event/624094/contributions/2627981/attachments/1476471/2287406/20170614.pdf\r\nhttps://indico.cern.ch/event/624094/contributions/2627967/attachments/1476540/2287679/hpvalidation.pdf\r\nhttps://indico.cern.ch/event/649295/contributions/2653665/attachments/1488080/2312139/20170705.pdf\r\n\r\nNotes\r\n- Rebased on top of the commits in PR #19583 (includes #19541) because these changes are essential for the HIPAlignmentAlgorithm to function properly.", "branch": "master", "changed_files": 49, "closed_at": "1501481607", "comments": 64, "commits": 60, "created_at": "1499338615", "deletions": 2161, "labels": ["alca-approved", "comparison-available", "fully-signed", "geometry-approved", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "270052aeaace0f8b40796218820a547c27d47bc8", "merged_at": "1501481607", "merged_by": "cmsbuild", "milestone": "CMSSW_9_3_X", "number": 19584, "release-notes": [], "review_comments": 24, "state": "closed", "title": "Upgrades to HIPAlignmentAlgorithm functionality (part of May-July 2017 tracker alignment campaign for pixel/strips alignment)", "updated_at": "1501481607", "user": "usarica"}