{"additions": 801, "auther_ref": "L1TK-PR-14_2_X_2024-10-10-2300", "auther_sha": "8c1d03928cdaa86e59db59de99c94f410ea42a63", "author": "cms-L1TK", "body": "#### PR description:\r\n\r\nThis consists of several improvements from the Phase 2 L1 tracking group.\r\n\r\n1. \"combined\" versions of the prompt & displaced tracking are now run by default, corresponding to the current firmware choice. \r\n2. Serious bugs were fixed in the duplicate track removal. In addition, dependencies of the \"combined module\" version of the duplicate removal \"wiring map\" on the older non-combined module have been removed.\r\n3. The L1 Track Quality variable is digitized according to the latest agreement.\r\n4. The tracking performance plotting ROOT macro L1TrackNtupleMaker.C now prints both fake track rate and duplicate track rate in its summary printout.\r\n5. For the HYBRID_NEWKF version of the L1 tracking, which corresponds to FW, but is not the current default for L1 trigger studies, the Kalman Filter Track fit EDProducers have been significantly rearranged, with the advantage that the output TTTrack collection is now created from the end of the chain, and so includes the TrackQuality variable.\r\n6. Truncation has been reduced in the MatchProcessor module.\r\n7. The TrackletProcessorDisplaced.cc code has been shortened by removing unnecessary code.\r\n\r\nThis PR does not significantly change the displaced L1 track performance, as is shown in the talk https://indico.cern.ch/event/1473530/contributions/6203794/attachments/2957687/5201212/Oct30_IanPRcombModulesQA_SeanPRgetMapCPUImprov.pdf .\r\n\r\nIMPORTANT: The changes to the duplicate track removal algorithm in this PR are dependent on the changes in cms-data from this PR https://github.com/cms-data/L1Trigger-TrackFindingTracklet/pull/6 , so the two PRs must be introduced into the same version of CMSSW.\r\n", "branch": "master", "changed_files": 36, "comments": 17, "commits": 12, "created_at": "1728719690", "deletions": 1132, "labels": ["l1-pending", "pending-signatures", "tests-pending", "orp-pending", "upgrade-pending", "requires-external", "code-checks-approved", "trk"], "milestone": "CMSSW_14_2_X", "number": 46360, "release-notes": [], "review_comments": 4, "state": "open", "title": "Several improvements to L1 tracking code", "updated_at": "1730360895", "user": "tomalin"}