{"additions": 4338, "auther_ref": "fs-etl-v5", "auther_sha": "54e8e45b0ca2203d61dbf9ffaa197d7e6cb1306f", "author": "icosivi", "body": "#### PR description:\r\n\r\nThis PR implements geometry scenarios D59 and D60: \r\n- D59 modifies scenario D58 introducing ETL version 4\r\n- D60 modifies scenario D58 introducing ETL version 5\r\n\r\nETL version 4 was already implemented in scenario D53 (https://indico.cern.ch/event/868736/contributions/3709315/attachments/1978993/3295064/MTDdays_20200131.pdf) and fits in the new Endcap Calorimeter envelope defined in D58.\r\nETL version 5 implements the latest version of ETL disks, as proposed by N. Koss (https://indico.cern.ch/event/868736/contributions/3706894/attachments/1978848/3294508/20200130_ETL_mechanics_timing_days.pdf).\r\n\r\nETL v5 introduces D-shaped sectors, instead of the quarters used in ETL v4, comprising more than 512 modules, which is the maximum number of modules that could be accommodated using the allocated bits in ETLDetId. Therefore ETLDetId.h has been modified to fix this issue, by adding 2 bits. The new ETLDetId is backward compatible with the older versions, thanks to a dedicated compatibility code implemented in ETLDetId.cc.\r\n\r\nBoth ETL versions and the backward compatibility issue were presented at the last MTD DPG meeting (https://indico.cern.ch/event/919571/contributions/3864046/attachments/2039610/3415525/MTD_DPG_20200515.pdf )\r\n\r\n#### PR validation:\r\n- Both scenarios have been tested using testMTDinDDD.py and testMTDinDD4hep.py: the dump geometries have been checked and both volumes positions and logical paths are correct.\r\n- The overlaps have been checked too using  g4OverlapCheck_cfg.py.\r\n- The dump geometries for scenario D50 using the old ETLDetId format and the new one described above have been compared: the logical volumes paths are the same, while the rawID differ only for the positions of the 2 bits related to the sensor modules, as expected. The new ETLDetId format is therefore correct and backward compatible.", "branch": "master", "changed_files": 24, "closed_at": "1593584816", "comments": 29, "commits": 11, "created_at": "1592906516", "deletions": 20, "labels": ["code-checks-rejected", "comparison-pending", "geometry-pending", "hold", "operations-pending", "orp-pending", "pending-signatures", "simulation-pending", "tests-pending", "upgrade-pending"], "milestone": "CMSSW_11_2_X", "number": 30340, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Adding geometry scenarios D59 and D60 implementing ETL version 4 and 5", "updated_at": "1593584816", "user": "icosivi"}