{"additions": 0, "auther_ref": "removeGetManyByTypeReco", "auther_sha": "9f9aee6d67ad2de7111d2ed5f89343fc0e19c0dc", "author": "wddgit", "body": "#### PR description:\r\n\r\nDelete test modules CaloTowersDump and STAnalyzer.\r\n\r\nThe primary motivation for this change is to delete uses of getManyByType so that we can delete the function getManyByType from the Framework without breaking compilation. These are the last two modules with calls\r\nto this function outside of the Framework (which are not in comments).\r\n\r\nThese two modules have been broken since at least 2015. The Framework has been throwing an exception when getManyByType is called without a call to consumesMany and both these modules do that. We've just finished a large migration where all code calling both consumesMany and getManyByType was replaced by GetterOfProducts or was removed in some other way. The function consumesMany has been deleted entirely from the Framework.\r\n\r\nAfter examining the code, it seemed the most appropriate thing was deleting these modules.\r\n\r\nSTAnalyzer:\r\n    - Also calls getByLabel with no consumes calls\r\n    - Uses cout\r\n    - Only 2 test configs reference it, they contain CMSSW_2_1_8 input files\r\n    - Configs contain other obsolete content\r\n    - Except for code maintenance no development since before move to git from CVS\r\n    - It just makes some histograms that apparently no one uses\r\n\r\nCaloTowersDump\r\n    - Just a cout dump of info from a CaloTowersCollection.\r\n    - I don't see content worth saving.\r\n    - Nothing references this module in CMSSW\r\n\r\nThere are two alternatives I can think of:\r\n\r\nI could comment out the call to getManyByType and replace it with an immediate exception throw. (The current behavior of the getByManyType function in the Framework is to always throw an exception).\r\n\r\nIf we really need these modules, we could upgrade them to use GetterOfProducts. This seems unlikely, because they have been broken for so many years already. It doesn't seem worth the effort. And there is value to deleting code that is old, broken, and dead. Less maintenance and faster builds using less resources.\r\n\r\nIf you want me to implement one of the alternatives, ask and I will do that instead.\r\n\r\n#### PR validation:\r\n\r\nNothing uses this code and it is already broken. There is nothing to test.\r\n", "branch": "master", "changed_files": 7, "closed_at": "1690199728", "comments": 8, "commits": 1, "created_at": "1689773135", "deletions": 1266, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "eb6c42977815de249d0feb55a8ff23eb3b777450", "merged_at": "1690199728", "merged_by": "cmsbuild", "milestone": "CMSSW_13_3_X", "number": 42310, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Remove CaloTowersDump and STAnalyzer", "updated_at": "1690199729", "user": "wddgit"}