{"additions": 229, "auther_ref": "addSplit0TestFiles", "auther_sha": "5a21f347ce762039a93c2a2d0a4941e5fd99b010", "author": "wddgit", "body": "#### PR description:\r\n\r\nThe main purpose of this PR is to add to the unit tests that ensure we can continue to read raw data files made using older releases with possibly older data formats. We are extending the tests to include input files created with split level 0 because we've observed different behaviors in ROOT with split level 0 and split level 99 files related to schema evolution problems. We want to have test coverage for both cases. See Issue #45931.\r\n\r\nAnother change is this PR adds more info to the input filenames which indicates the split level. Previously existing files were mostly split level 99 and those are mostly just renamed. Note some classes are restricted to be split level 0 in classes_def.xml and so there are only split level 0 files. Also note that split level 99 really means maximum splitting allowed by the class definition for the data type. Split level 99 is much larger than any possible actual splitting level.\r\n\r\nIn a few cases, the release associated with test file was changed so the release used contained the code of the class exactly. Only test code was cherry-picked into a working area to create the test input files not data type class definitions.\r\n\r\nThis change only affects these unit tests. It does not affect any code executed in production or any other tests.\r\n\r\nThere will be 9 PRs to data repositories adding the new input files. This PR and all 9 of the other PRs should be merged at the same time or else the unit tests will fail.\r\n\r\n#### PR validation:\r\n\r\nExtended unit tests pass in my working area (and should execute and pass in the PR tests also).\r\n", "branch": "master", "changed_files": 16, "closed_at": "1726844222", "comments": 24, "commits": 1, "created_at": "1726679678", "deletions": 50, "labels": ["core-approved", "daq-approved", "hlt-approved", "l1-approved", "reconstruction-approved", "simulation-approved", "fully-signed", "tests-approved", "orp-approved", "requires-external", "code-checks-approved", "trk"], "merge_commit_sha": "a18ec539ad314a5025d96238811861f94806db58", "merged_at": "1726844222", "merged_by": "cmsbuild", "milestone": "CMSSW_14_2_X", "number": 46044, "release-notes": [], "review_comments": 17, "state": "closed", "title": "Add tests with split level 0 input files to raw data unit tests", "updated_at": "1726844223", "user": "wddgit"}