{"additions": 659, "auther_ref": "UpdateL1TDQMBackPort", "auther_sha": "e7812898460363e8f5418188d82204d026e7bf45", "author": "emacdonald16", "body": "#### PR description:\r\nBackport of #30460\r\n\r\nUpdating Level-1 Trigger DQM (TTClusters, TTStubs, and TTTracks).\r\nClusters:\r\n-cluster phi range extended\r\nStubs:\r\n-stub phi range extended\r\n-5 new distributions added (trigger bend, hardware bend, raw bend, bend offset, and PS module) -> very useful in finding bugs when the TTStub class is updated\r\nTracks:\r\n-Modified the track input so it will automatically run on the newly merged Hybrid Tracks\r\n-Updated the general track directory to by high-quality (\"HQ\") tracks and all produced tracks\r\n-Updated the definition of HQ track -> reflects the track quality cuts optimized for Level-1 track MET\r\n-Added nLayersMissed distribution, determined by the L1T group to be very important in separating real from fake tracks\r\n-Added bend chi2 distribution, determined by the L1T group to be very important in separating real from fake tracks\r\n-Added two Chi2 distributions, Chi2 r-phi and Chi2 r-z\r\n\r\nValidation package:\r\n-Removed the matched tracks chi2 and chi2dof distributions (they are not very helpful for validation)\r\n-Cleaned up some of the code, removing pieces that are no longer necessary due to the cleaned up TTTrack class (L1Tk_nPar, L1Tk_maxChi2, TP_maxPt, and TP_select_eventid)\r\n**Note** DQM/SiOuterTracker/Track plots are empty, since the running of the L1T tracks are not yet included in CMSSW_11_1_X (at least when I tested it)\r\n\r\n#### PR validation:\r\n\r\nRan standalone to make sure output was as expected.\r\nRan runTheMatrix for 23234.0 \r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\nBackport of #30460\r\nRequested.\r\n", "branch": "CMSSW_11_1_X", "changed_files": 12, "closed_at": "1608024244", "comments": 45, "commits": 5, "created_at": "1595193865", "deletions": 488, "labels": ["comparison-notrun", "dqm-pending", "operations-pending", "orp-pending", "pending-signatures", "tests-rejected"], "milestone": "CMSSW_11_1_X", "number": 30832, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Enable L1Tracks in L1T DQM (backport)", "updated_at": "1608024245", "user": "emacdonald16"}