{"additions": 59, "auther_ref": "SCTrackingRegionBSFix", "auther_sha": "ae3c2ea0b7bdf232c2031233b4557f59ac4e40c5", "author": "Sam-Harper", "body": "Dear All,\r\n\r\nThe online beamspot issues persist and this is impacting data taking efficiency for electrons. As such I have added more flexibility to the E/gamma code to deal with this. We now have various options available to us for tracking regions.\r\n\r\n1) use the primary vertex +/- X (existing)\r\n2) use the beamspot z +/-  N*sigmaZ  (the N being configurable is the new part, it was annoyingly hardcoded to 3\r\n3) use X+/-Y , eg 0 +/-20cm (my favoured solution however there are currently timing issues)\r\n4) use the beamspot z+/- N *sigmaZ where sigmaZ has a minimum allowed value, say 5cm\r\n\r\nThe TSG will decide which one we use, however having the options of all 4 are useful. \r\n\r\nWe really need this online as soon as possible as we are losing efficiency in electron triggers in a nasty way which is impossible to detect using t&p. \r\n\r\nThis code does not run at reco, it is HLT exclusive so far. It may well run in RECO in the future. \r\n\r\nValidation: \r\n\r\n- run on the DoubleEG dataset of 299480 (about a million events, also includes a triggers which do not use tracking)\r\n   - when used with an existing config, no changes to unprescaled paths are observed which is what I was testing\r\n- run on 100K Z->ee MC events (83X samples) with the online beamspot forced to have a too small deltaZ\r\n   -  the fixes successfully recovered the efficiency \r\n\r\nWill run over data as soon possible but this is more the TSG, the MC tests show the code is functioning as expected. \r\n\r\nPasses the scramv1 b run tests and runTheMatrix.py -l limited -i all\r\n\r\n@Martin-Grunewald \r\n\r\n\r\n\r\n\r\n\r\n", "branch": "master", "changed_files": 1, "closed_at": "1501305744", "comments": 28, "commits": 3, "created_at": "1500905549", "deletions": 20, "labels": ["comparison-available", "fully-signed", "orp-pending", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "8e59646c5dc2756e96963b11dceef23e96c92c1b", "merged_at": "1501305744", "merged_by": "cmsbuild", "milestone": "CMSSW_9_3_X", "number": 19884, "release-notes": [], "review_comments": 11, "state": "closed", "title": "Fixing a BS Issue affecting the Egamma HLT", "updated_at": "1501587954", "user": "Sam-Harper"}