{"additions": 537, "auther_ref": "MLDQMRun3_130X", "auther_sha": "98b18c437b4276b9ac04b2d4f98fe9a7547a912b", "author": "abhih1", "body": "#### PR description:\r\n\r\nThis PR introduces the Ecal Endcaps into the autoencoder-based online ECAL DQM feature, which was implemented for EB in https://github.com/cms-sw/cmssw/pull/35990.\r\nSeparate Autoencoder (AE) models with ResNet architecture are trained for EE+ and EE-, apart from the model for EB, on certified good data (digi occupancy) from 2018 runs.\r\n\r\nOn giving an input occupancy map to the AE, the encoder part of the AE encodes and learns the features and the decoder reconstructs the data from the encoded latent space to match the input as closely as possible. The reconstruction loss is then calculated, which is a mean squared error (MSE) between the input and output images at a tower level. Thus given an anomalous tower, the AE which has learnt the features of the good data will have a hard time reconstructing it and give a higher loss on the anomaly than on the good towers. A quality threshold is then applied on this loss map which marks it as Good or Bad, which is then stored as an ML quality summary plot.\r\nNew correction factors are derived from 2022 collisions data to use in the pre-processing and inference, which follows the same steps as used for EB.\r\n\r\nThis PR thus introduces ML Quality summary plots for EE- and EE+, along with Loss Map and reconstructed occupancy maps from the AE.\r\nIt also introduces a trend plot to monitor the no. of bad towers flagged by the AE per lumisection in a run, as well as the map of these bad towers in an occupancy-like plot. This would be very helpful in monitoring per lumisection behaviour of bad towers/channels.\r\n\r\nPlease note that this PR should be tested along with the files added to https://github.com/cms-data/DQM-EcalMonitorClient/pull/3\r\n\r\n#### PR validation:\r\n\r\nThe code was validated by running the online Ecal DQM configuration and the resultant plots were examined by uploading the output file to a DQM test gui.\r\nThe new plots are confirmed and look reasonable.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis is a backport to 13_0_X currently used in production.\r\nThe master PR is: https://github.com/cms-sw/cmssw/pull/41175\r\n", "branch": "CMSSW_13_0_X", "changed_files": 5, "closed_at": "1679916087", "comments": 1, "commits": 1, "created_at": "1679916025", "deletions": 463, "labels": ["dqm-pending", "pending-signatures", "tests-pending", "orp-pending"], "milestone": "CMSSW_13_0_X", "number": 41194, "release-notes": [], "review_comments": 0, "state": "closed", "title": " Adding the Ecal Endcaps to the ML based online ECAL DQM [13_0_X]", "updated_at": "1679916087", "user": "abhih1"}