{"additions": 1089, "auther_ref": "EtaWise", "auther_sha": "aa42ec9e9edc042a39d080624a44e061aeac83a9", "author": "jo100sun", "body": "PR description:\r\nBad VFAT masking is needed to measure efficiency of properly-working chambers. Plots generates respectively for status flag of each component of GEM. Contribution of each component for efficiency loss can be figured out.\r\n\r\nEtapartition-wise measurements plots efficiency of separate etapartition device. We changed matching objective of TrackerMuons from GEM chamber to GEM etapartition. Muon can be matched to more than one etapartition in a single chamber if the muon passes boundary between etapartitions.\r\n\r\nChanges:\r\nStatus-wise efficiency measurement : Components of GEM chamber has status tag which tells functionality of individual object. For those plots added, only the hits living in components which doesn't include error or warning tag of interest.\r\nCurrently we have OH error, OH missing, VFAT error \r\n\r\nEtapartion-wise efficiency : Each GE11 chamber consists of 8 etapartition module, which has 3 VFAT readout chips for each. By replacing propagation of TrackerMuons to each etapartition from each chamber, we can measure efficiency of each etapartition. If one or more VFAT is bad for certain hit, it is not joining measurement of bad VFAT masked efficiency.\r\nStation Separation: GE11 and GE21 were overlapping on certain plots. These plots have been separated for each station for clarity.\r\n\r\nPR validation:\r\nValidation was performed using the command `runTheMatrix.py -l limited -i all --ibeos`. We verified that the plots after the PR reflect all the changes listed above.", "branch": "master", "changed_files": 6, "comments": 33, "commits": 12, "created_at": "1723161975", "deletions": 12, "labels": ["dqm-pending", "reconstruction-approved", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "tracking"], "milestone": "CMSSW_14_2_X", "number": 45676, "release-notes": [], "review_comments": 0, "state": "open", "title": "GEM TnP efficiency plots with bad VFAT masking and Etapartition-wise measurements", "updated_at": "1725348557", "user": "jo100sun"}