{"additions": 434, "auther_ref": "CMSSW_11_1_X_tau-pog_deadECAL", "auther_sha": "84762b7b9999e9239444467d40cba6cf3d13bca1", "author": "cms-tau-pog", "body": "#### PR description:\r\nRestructured code of againstElectronDeadECAL discriminator to run on either AOD or miniAOD inputs:\r\n- add a version of the discriminant to run on top of pat::Taus to be used with miniAOD data samples;\r\n- use eta and phi of impact position of the leading PFChargedHadron on ECal surface instead of eta and phi of tau at the vertex (taking bending of track in the magnetic field and the zVertex into account); it can be disabled for backwards compatibility; \r\n- restructure the code in the way that both AOD and miniAOD version of the discriminant call the same algorithm to avoid code duplication;\r\n- move code preforming extrapolation to the ECal surface from the againstElectronMVA algorithm to an auxiliary helper class which avoids code duplication;\r\n- add output of the againstElectronDeadECAL discriminant produced at AOD (already present in RECO/AOD workflow) to `slimmedTaus` in MiniAOD\r\n\r\nExpected some differences:\r\n- small difference in output of PFRecoTauDiscriminationAgainstElectronDeadECAL (AOD) discriminant because of enabled extrapolation to the ECAL (version with the extrapolation disabled gives identical results as one before the changes in this PR);\r\n- new tauID embedded into slimmedTaus in miniAOD.\r\n\r\nIn addition it is indented to backport the development to releases used currently to analyze data (102X, 106X). \r\nIt is also intended to add the discriminant to nanoAOD, but it will go via nanoAOD repository (with link to foreseen backports).\r\n\r\n#### PR validation:\r\n\r\n`runTheMatrix.py -l limited -i all` passed successfully except a few failed due to problem with inputs (DAS_ERROR).\r\n\r\n\r\n\r\n", "branch": "master", "changed_files": 15, "closed_at": "1590385269", "comments": 66, "commits": 10, "created_at": "1588594942", "deletions": 284, "labels": ["analysis-approved", "code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "b277fecb350ddd4a807be2769134dec2ef9f5c01", "merged_at": "1590385269", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 29627, "release-notes": [], "review_comments": 39, "state": "closed", "title": "Restructured code of againstElectronDeadECAL tauID", "updated_at": "1590385269", "user": "mbluj"}