{"additions": 292, "auther_ref": "EGPFClusterIsoInRECO", "auther_sha": "8f2fc22f0e126d40554eae8c38281b190cd26354", "author": "Sam-Harper", "body": "PFCluster isolation is used in the HLT and is becoming more popular in E/gamma as useful isolation.\r\n\r\nIt is already stored in AOD via value maps and is embedded into pat::Electrons and pat::Photons. This change puts it directly in the reco::GsfElectron and reco::Photon for ease of use.  It should be CPU and diskspace neutral (if anything, slightly less diskspace as it replaces valuemaps) as its simply changing where the isolation value is stored.\r\n\r\nThe value maps are now added to the electron,photon during the finalisation step in the same way as PFIsolations are. As such the event content is modified to drop these ValueMaps as they are unnecessary (and keyed to the tmp versions of the electrons/photons). The reducedEgamma and pat configs were updated to not to store the PF cluster isolation.  However they still have a capability to read in value maps and set the PFCluster isolation. This is done incase we wish to use this release to re-miniAOD 8X or 9X samples where a customisation function would configure these modules to read the value maps.  Note, I wasnt sure how to do such a customisation function so any advice here would be welcome. \r\n\r\nThe only slightly tricky part was with the OOT photons which dont have PF isolation and so dont have a finalisation step. I added one for them and they should be untouched otherwise. @kmcdermo FYI", "branch": "master", "changed_files": 24, "comments": 54, "commits": 3, "created_at": "1515419144", "deletions": 156, "labels": ["analysis-pending", "code-checks-approved", "comparison-available", "operations-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-approved"], "milestone": "CMSSW_10_1_X", "number": 21811, "release-notes": [], "review_comments": 5, "state": "open", "title": "Adding PFClusterIsolation to reco Egamma objects", "updated_at": "1517406690", "user": "Sam-Harper"}