{"additions": 704, "auther_ref": "enable_ClusterSplittingInJetCore", "auther_sha": "a186667eddd4129168d30803d035b6c7eea5b2e6", "author": "rovere", "body": "This PR will enable cluster splitting by default in the reconstruction step of pp scenario only. It includes few improvements to the base code itself of the cluster splitter, plus all the mandatory changes in the various cf{g,f,i}. The cosmic and HI scenarios should not be affected at all.\n\nPreliminary results are gathers here, thanks to Matti:\nhttps://mkortela.web.cern.ch/mkortela/tracking/validation/CMSSW_7_4_0_pre1/index.html\n\nWe expect no changes for TTbar, an increase in efficiency for QCD samples (varies according to Pt) with a corresponding one in fake rate.\n\nEffects on physics should be estimated by different groups: BTag reported their observations in a recent tracking POG Meeting: https://indico.cern.ch/event/337846/contribution/1/material/slides/0.pdf\n\nWe do expect another round of fine tuning on top of the current code that will come at some point next year.\n\nTo ease your review process, the reformatting of the C++ code has been included in a single, stand-alone commit.\n\nLocally tested on the limited version of runTheMatrix w/o problems.\n\nOne final remark: I somewhat arbitrarily changed the input cluster for the AlceRecoLUMIpixel to the pre-splitted collection and I am not at all sure if this is the right decision to take or not: I leave it to the proper experts to comment on that.\n", "branch": "CMSSW_7_4_X", "changed_files": 19, "closed_at": "1418211760", "comments": 13, "commits": 8, "created_at": "1418033339", "deletions": 425, "labels": ["alca-approved", "comparison-available", "fully-signed", "operations-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "7016291ae2912de287404e8e7defd7016d0cc040", "merged_at": "1418211760", "merged_by": "cmsbuild", "milestone": "Next CMSSW_7_4_X", "number": 6822, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Enable cluster splitting in jet core", "updated_at": "1418214893", "user": "rovere"}