{"additions": 41, "auther_ref": "CMSSW_12_5_X_tau-pog_tauTrgBitsFixNano", "auther_sha": "e5864f0c5bc9938758a57cffa7095a44393592b3", "author": "cms-tau-pog", "body": "#### PR description:\r\n\r\nThe tau trigger bits in NanoAOD never provided a match in 2018 triggers because the 'Hps' part in the name was forgotten. This PR is meant to fix this issue as well as to prepare to accommodate Run-3 tau triggers. We have decided to go with a unified strategy that will work for both Run-2 and Run-3 triggers which have similar structure and naming conventions, hence the addition of extra bits containing DeepTau. It now also contains trigger bits for taus in the PAG VBF and displaced tau triggers. A full overview of all trigger filters in Run-2 and Run-3 was made and is contained in google sheets [here](https://docs.google.com/spreadsheets/d/1L8P4HeiUSaisewuSFBEJOM5t5xXcDjNbfBtD9hEE5F8/edit#gid=0)\r\n\r\n**Changes**:\r\n* Addition of wildcards to original trigger bits to work for both HPS and non-HPS paths;\r\n* Addition of DeepTau trigger bits;\r\n* Addition of bits 4096 to 32768 to include PAG paths;\r\n* Addition of bits 65536 for completeness, they allow to go a bit more specific in the triggers to select;\r\n* Addition of boosted tau block. Right now the bits are redundant, but we expect more to be added in the future;\r\n* Added bits to non-tau blocks from cross triggers.\r\n\r\n#### PR validation:\r\nReran NanoAOD for all three Run-2 years and in a Run-3 sample, everything seemed to act as expected\r\n\r\n", "branch": "master", "changed_files": 1, "closed_at": "1656412283", "comments": 16, "commits": 7, "created_at": "1655906590", "deletions": 13, "labels": ["fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "xpog-approved"], "merge_commit_sha": "8e76e625f8330a233e92d9e6b23d160ab4c9e3bb", "merged_at": "1656412283", "merged_by": "cmsbuild", "milestone": "CMSSW_12_5_X", "number": 38472, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Change tau trigger bits stored in NanoAOD", "updated_at": "1656412283", "user": "mbluj"}