{"additions": 744, "auther_ref": "TritonClient", "auther_sha": "da50dccf8a30ffeae5e87faf4eff79c80907e0b1", "author": "kpedro88", "body": "#### PR description:\r\n\r\nhttps://github.com/cms-sw/cmsdist/pull/5868 added triton-inference-server as a CMSSW external. This PR adds the corresponding Sonic client to communicate with Triton servers (following up on #29141 and #29503).\r\n\r\nDetails:\r\n\r\nTriton commands may return an `Error` object. These objects are wrapped and converted into warnings (if the command was not successful). In addition, an unsuccessful command causes the current evaluation to stop (execution will also stop if retries are not allowed).\r\n\r\nOptionally, additional reporting from the server side can be enabled using the `verbosity` flag.\r\n\r\nThe client can select different models on the server by name and version number. The model information (input and output dimensions and sizes) is automatically obtained from the server and can be printed using the `verbosity` flag. Multiple inferences can be done at once by setting the `batchSize` and concatenating all of the input data. (`batchSize` can be changed on a per-event basis if desired.)\r\n\r\nA forthcoming PR will add functionality to transmit fixed-point data to a custom FPGA server that recognizes Triton calls. (Currently, models with multiple named inputs and/or outputs and models with variable-size dimensions are not supported. This support will be added in the future if and when relevant examples are available.)\r\n\r\n#### PR validation:\r\n\r\nRan the `TritonImageProducer` using the Docker test setup. Tested both success and failure conditions, and observed desired behavior and output.\r\n\r\nattn: @violatingcp @drankincms @nhanvtran @jeffkrupa @jmduarte @lgray ", "branch": "master", "changed_files": 10, "closed_at": "1593796176", "comments": 56, "commits": 13, "created_at": "1592598773", "deletions": 4, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "heterogeneous-approved", "orp-approved", "tests-approved"], "merge_commit_sha": "f583701580add3910609de2e8c26b6dca45870d1", "merged_at": "1593796176", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 30318, "release-notes": [], "review_comments": 41, "state": "closed", "title": "Sonic client for Triton server", "updated_at": "1593796177", "user": "kpedro88"}