{"additions": 708, "auther_ref": "mtvLowPt", "auther_sha": "785930aa7c51712d9eee94d0fc1f09d4c0e560da", "author": "makortel", "body": "This PR provides the following updates to MultiTrackValidator\r\n- Add 2D histogram showing the originalAlgos of duplicate tracks\r\n  * From two best-matching tracks of a single TrackingParticle\r\n- Turn the plots vs. production radius to have logarithmic x axis\r\n  * To gain vsial sensitivity also for non-strip-seeded iterations\r\n- Make resolution and pull plots (and certain other 2D histograms) optional\r\n  * The required 2D histograms take lots of memory, but are usually interesting only for \"all tracks\" collections (not per iteration)\r\n  * By default the resolutions are limited to generalTracks, highPurity tracks, and BTV-selected tracks\r\n- Move histograms by originalAlgo to the standard sequence (from standalone/trackingOnly)\r\n  * We want to have the monitoring also by original iteration in addition to the \"best algo assignment\"\r\n- Move monitoring of built tracks to the standard sequence (from trackingOnly)\r\n  * Mainly to monitor the track selection MVAs, but also the effect of track selection in general\r\n- Add efficiency plots per iteration for pT < 0.9 GeV TrackingParticles\r\n  * To monitor the performance of iterations targeting low-pT tracks\r\n  * For this I had to add `ptMax` parameter to TrackingParticleSelector\r\n  * The \"efficiency vs. collection without pT cut\" histograms were removed as obsolete now\r\n- Add profiles of track selection MVAs vs pT and eta (as in #19481 for DQM) separately for true and fake tracks\r\n- Some cleanup (e.g. merging MultiTrackValidatorBase to MultiTrackValidator)\r\n \r\nThe net effect on memory (in 10024.0) is going from ~100 MB to ~80 MB per thread.\r\n\r\nTested in 9_3_0_pre1. Expecting removal of resolution and pull plots except for the collections mentioned above, and addition of new histograms. No change is expected for any existing histogram that is not removed. \r\n\r\n@rovere @VinInn @ebrondol @felicepantaleo ", "branch": "master", "changed_files": 31, "closed_at": "1499672725", "comments": 11, "commits": 18, "created_at": "1499334802", "deletions": 418, "labels": ["analysis-pending", "comparison-available", "dqm-approved", "geometry-approved", "orp-pending", "pending-signatures", "reconstruction-approved", "simulation-approved", "tests-approved", "upgrade-pending"], "merge_commit_sha": "bffc6f3f1a9c2714b9a8cffc39e39e4b1cacd6c5", "merged_at": "1499672725", "merged_by": "cmsbuild", "milestone": "CMSSW_9_3_X", "number": 19582, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Various updates to MultiTrackValidator", "updated_at": "1499672726", "user": "makortel"}