{"additions": 601, "auther_ref": "quadrupletPropagationImproveLowPt", "auther_sha": "77ce974b511e4425e9fb60da8a786b0f4833f4d7", "author": "makortel", "body": "This PR makes significant improvements on the low-pT performance of `PixelQuadrupletGenerator` (almost) as described in Tracking POG meeting April 25 https://indico.cern.ch/event/524162/contributions/2147043/attachments/1263095/1868128/slides_phase1.pdf . The `PixelQuadrupletGenerator` is also switched as the default method for producing the quadruplet seeds from hit triplets (I left the `customiseForQuadrupletsByPropagation.py`, introduced in #13753, still there to remind us the recommended duplicate cleaning flag for PixelTrackProducer).\n\n\"Almost\" means that while preparing the PR I noticed that the SeedComparitors were not used in InitialStepPreSplitting, InitialStep and DetachedQuadStep as I intended (= use the same SeedComparitor in triplet and quadruplet generation). The presented version is the second-to-last commit (28fddea), and the last commit (77ce974) shows the fix. Below is a link to MultiTrackValidator plots with 1000 events of TTbar+35PU with both \"design\" and \"realistic\" GTs\nhttps://mkortela.web.cern.ch/mkortela/tracking/validation/CMSSW_8_1_0_pre2_phase1/\n(I think we should review the use of SeedComparitors at some point)\n\nThe code is still somewhat prototype quality, which will be addressed later. I marked the most important points with `// TODO`.\n\nTested in CMSSW_8_1_X_2016-04-29-2300. No changes are expected in 2016 workflows. 2017 workflows should show small changes here and there in tracking performance (see MTV link above), and iterative tracking should be roughly 10 % faster.\n\n@rovere @VinInn \n", "branch": "CMSSW_8_1_X", "changed_files": 11, "closed_at": "1462627803", "comments": 8, "commits": 4, "created_at": "1462194597", "deletions": 67, "labels": ["comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "d3d05a74b692bc243141c311aaa6b43825543081", "merged_at": "1462627803", "merged_by": "cmsbuild", "milestone": "Next CMSSW_8_1_X", "number": 14327, "release-notes": [], "review_comments": 3, "state": "closed", "title": "Improve low-pT performance of \"quadruplets by propagation\", and use it in phase1 tracking instead of \"triplet merging\"", "updated_at": "1462627804", "user": "makortel"}