{"additions": 3857, "auther_ref": "Alignment-GBL-73X-Dev", "auther_sha": "32489f8fc6d2fbaf7108d4775cf5476c9d35be13", "author": "cms-trackeralign", "body": "For the tracker alignment with Millepede-II in the recent years as reference trajectory with proper description of multiple scattering a custom implementation of broken lines had been used. Meanwhile this has been developed further to the so called general broken lines (GBL) mathematically equivalent to a Kalman filter (NIM A, 673 (2012), 107-110). Experiment independent implementations (C++, Python, Fortran) are maintained by the Helmholtz Terascale Alliance at DESY.\nThe current custom implementation allows only the construction of the (reference) trajectory (fitted later by Millepede-II). GBL implements a rich set of features like fitting the trajectory (allows to iterate the reference trajectory) or direct output to a Millepede-II binary file or 4D measurements (position and direction). The implementation of the reference trajectories in CMSSW with GBL is much simpler compared to the custom ones. This would very much ease a possible extension to the muon system for a combined alignment.\nFurther information:\n- https://indico.cern.ch/event/243958/session/1/contribution/6/material/slides/0.pdf\n- https://www.wiki.terascale.de/index.php/GeneralBrokenLines\n- https://www.desy.de/~kleinwrt/GBL/doc/cpp/html/index.html\n", "branch": "CMSSW_7_3_X", "changed_files": 22, "closed_at": "1415637754", "comments": 11, "commits": 1, "created_at": "1415104427", "deletions": 110, "labels": ["alca-approved", "comparison-available", "fully-signed", "tests-approved"], "merge_commit_sha": "a1154123866d315f44b4dc48b4842939cd8dbc5b", "merged_at": "1415637754", "merged_by": "cmsbuild", "milestone": "Next CMSSW_7_3_X", "number": 6198, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Additional reference trajectories based on GeneralBrokenLines for tracker alignment with Millepede-II", "updated_at": "1415637754", "user": "ckleinw"}