{"additions": 3, "auther_ref": "FixReflectionIntegrity", "auther_sha": "08b8aa43c9e3ae66c22d07fc7f9fee652884f1c0", "author": "abhih1", "body": "#### PR description:\r\n\r\nAn issue with the Integrity quality summary plot was presented here: http://cmsonline.cern.ch/cms-elog/1112563, where the problematic tower mappings were \"reflected\" relative to the FE Status plot which showed the correct mapping.\r\n\r\nThe error appears to be with a wrong binning set up for the filling of the histogram which is done here [6], where it was assumed that for EB+ supermodules there will be a reflection or flip of the tower y binning, when in fact it remains the same as for EB-. The flip only happens when using iphi coordinates to define the y binning, not the tower id which has been used in this case.\r\n\r\nWe have fixed this by removing the separate condition for EB+, and making it the same as for EB-.\r\n\r\n#### PR validation:\r\n\r\nWe redid the plots with an offline ecal dqm workflow on 2018 runs (T0 turned off for offending run) by introducing integrity errors on EB+. Using a test GUI we found that it now shows the correct tower positions. We also made sure that if the error happened on EB- this still gave the correct tower mapping, and no other plots were affected.\r\n\r\n#### This PR is a backport of the original PR here: https://github.com/cms-sw/cmssw/pull/32305\r\nThis is done to ensure the changes are available in CMSSW_11_2_X, which would be used in the next MWGR in February 2021. \r\n", "branch": "CMSSW_11_2_X", "changed_files": 1, "closed_at": "1607956957", "comments": 16, "commits": 2, "created_at": "1606746353", "deletions": 1, "labels": ["comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "6f0b53bc4e06d66967e9fbc7654ddd36ff367b9d", "merged_at": "1607956957", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 32334, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Fix reflection integrity", "updated_at": "1607956957", "user": "abhih1"}