{"additions": 30, "auther_ref": "fc-fixtimingsd-20251030", "auther_sha": "62d520a0919c06007dbe56add3dd3d0b746e3096", "author": "fabiocos", "body": "\r\n#### PR description:\r\n\r\nThis PR addresses issue https://github.com/cms-sw/cmssw/issues/49268 . \r\n\r\nThe MTD simulation truth is heavily relying on hit type classification, according to the history of tracks originating it. The type assignment happens within the ```MtdSD::getTrackID``` method. While studying the ETL behaviour, a misbehaviour of the classification has been found back-scattering hits (thanks to X. Liu and X. Huang), and it has been traced back to an update of the code introduced in https://github.com/cms-sw/cmssw/pull/47186 , where the position of the call to this method within ```TimingSD::getStepInfo``` has been modified.\r\n\r\nFor ETL back-scattering, the information about the hit type is computed in the ```MtdSD::setHitClassID``` method, that should be called before the track ID management. This update broke that logic. Moving this method before the call to getTrackID can solve the issue.\r\n\r\nNevertheless there is another possible problem, whose consequences are at present unclear: the TrackInformation content, used in the hit type assignment, is updated in case of a new track at https://github.com/cms-sw/cmssw/blob/master/SimG4CMS/Forward/src/TimingSD.cc#L159 . Moving the call of a method relying on this information before it is likely to cause issues, since some TrackInformation content is not yet defined while being used.\r\n\r\nThis PR restores the previous situation, while implementing in an alternative way the protection introduced in https://github.com/cms-sw/cmssw/pull/47186 .\r\n\r\n#### PR validation:\r\n\r\nDetailed debugging printouts show the expected behaviour. The added validation plots run on wf 29634.0 are filled as expected.", "branch": "master", "changed_files": 3, "comments": 8, "commits": 2, "created_at": "1762875805", "deletions": 10, "labels": ["simulation-pending", "dqm-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_16_0_X", "number": 49368, "release-notes": [], "review_comments": 8, "state": "open", "title": "MTD simulation: fix use of getTrackID for TimingSD, add monitoring of ETL track ID offset (hit type)", "updated_at": "1762961282", "user": "fabiocos"}