{"additions": 143, "auther_ref": "FixPremixAgain4", "auther_sha": "0bf96d3f4e04f9680ecd274b4e349c0840298403", "author": "kpedro88", "body": "In 9_1_0_pre3, it was observed that HCAL premixing did not match well with classic mixing for the 2017 Era. This was somewhat puzzling, since the problem was even evident in HB, which should be the exact same detector in 2016 and 2017.\r\n\r\nHowever, there was one important change: the electronics map used in the global tag, which corresponds to the backend electronics. 2016 used the old VME/HTR setup, while 2017 uses the new uTCA/uHTR setup (but still the old QIE8 for HB and most of HE). There is a different packer/unpacker for uHTR, which discarded the per-sample error bit in the QIE8 format. Premixing uses the error bit to denote how the ADC counts in premixed digis should be interpreted, so this caused the observed regression.\r\n\r\nTo fix this, simulated QIE8 digis in premix stage 1 (creation of the premixed input file) will be packed into the old VME-style format, which keeps all the bits. To handle this in the uHTR code, flavor 7 datatype 15 (technical data, currently unused) is employed. The unpacker is correspondingly updated to handle this case correctly. (This was the agreed solution after some discussion between me and @jmmans.)\r\n\r\nI also cleaned up some of the packer/unpacker code while I was there.\r\n\r\nProof that it works (ADC counts in HB; red = classic, blue = premix):\r\n\r\n**Before**:\r\n![ADC counts before fix](http://kjplanet.com/pr/premix_910pre3_before.png)\r\n\r\n**After**:\r\n![ADC counts after fix](http://kjplanet.com/pr/premix_910pre3_after.png)\r\n", "branch": "master", "changed_files": 6, "closed_at": "1496334016", "comments": 8, "commits": 4, "created_at": "1496248023", "deletions": 113, "labels": ["comparison-available", "operations-pending", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "9746d959ee0cd28d175976a002a9fa949d7d4aee", "merged_at": "1496334016", "merged_by": "davidlange6", "milestone": "CMSSW_9_2_X", "number": 19047, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Fix HCAL premixing with QIE8 and uHTR", "updated_at": "1496386022", "user": "kpedro88"}