{"additions": 53437, "auther_ref": "dd4hep_phase2_tracker", "auther_sha": "1327396e826cd4f082461f0624d3a042c1233b78", "author": "ghugo83", "body": "The previous Phase 2 Tracker descriptions were done for DDD only, and are incompatible with DD4hep library. \r\n\r\nThis provides an entire review of the Phase2 Tracker description, to be compatible with dd4hep.\r\nThe changes introduced in this PR are listed in [1].\r\nTo be noted is that **the new description XML set is compatible with BOTH DDD and DD4hep.**\r\n\r\nThe new Tracker description is based on T21.\r\nGeometry scenario: 2026D77.\r\nAssociated workflows: 350xx (no PU), 352xx (PU).\r\n\r\nThere is **no change in the Tracker design itself incorporated here, to be able to properly check for any regression**. A **comparison should be made in DDD mode, between D76 (T21) and D77 (T24).**\r\nThere should be no diff in DDD mode, between D76 and D77.\r\nInstead, in DD4hep mode, the Tracker runs are entirely fixed: the new XML set fixes issues in geometry & materials, associated with incompatibilities with DD4hep library.\r\n\r\n\r\n### [1] Changes incorporated in this PR:\r\n- **Ordering of composites materials:** \r\nA hierarchy level was introduced in the Composite Materials creation core code in tkLayout, then propagated back to the XML export, and then finally to the XML description. \r\nThis allows to have the callees composites always defined above the callers composites in the XMLs description.\r\nOtherwise, the DD4hep G4Materials converter would create WRONG compositions.\r\n- **Units**\r\nThere were no unit specified for radii and Z in algorithms arguments, while these lengths should be mm. This was wrongly interpreted, in the DD4hep case, as cm.\r\n- **Namespace removal in all SpecPar paths, and corresponding change of all volume names**\r\nIn the Phase 2 Tracker, the namespace is used to distinguish OT and IT volumes, in SpecPars.\r\nFor example, `tracker:Layer1` versus `pixel:Layer1`.\r\nWith DD4hep, when processing the topology, the namespace are removed. Hence, there was no way to distinguish volumes properly, hence the navigation could not work for Phase 2 (already fixed for Phase 1).\r\nThis PR introduces all necessary information directly inside the volume names.\r\nThe namespaces are then removed from the SpecPar paths.\r\n- **Simplify paths:**\r\nThe fact that the names are reworked, allows to also significantly shorten paths, for example in `trackerRecoMaterial.xml`.\r\n- **Tracker envelope:**\r\nAlso profited from this PR, to include a change in Tracker envelope, to leave space for FBCM detector. This was included, since it does not imply any change to the detector description itself.\r\n\r\n### Selection of diffs introduced in this PR:\r\n- tracker.xml: https://editor.mergely.com/2OTD7xRx/ \r\n- pixel.xml: https://editor.mergely.com/M1vBbDBR/\r\n- pixfwd.xml: https://editor.mergely.com/ZsJurriV/\r\n- trackerStructureTopology.xml: https://editor.mergely.com/XOfZH27g/\r\n- pixelStructureTopology.xml: also a diff, but not shown here.\r\n- trackerRecoMaterial.xml: https://editor.mergely.com/HqwpnIQe/\r\n- pixelsens.xml: also a diff, but not shown here.\r\n- trackersens.xml: also a diff, but not shown here.\r\n- pixelProdCuts.xml: also a diff, but not shown here.\r\n- trackerProdCuts.xml: also a diff, but not shown here.\r\n\r\n### PR validation:\r\nFollowing was done for validation:\r\n- Checked XMLs make sense from Tracker design point of view.\r\n- 0 overlap within full 'Tracker' volume (checked with Fireworks + Geant4 tools).\r\n- Checked workflow numbering.\r\n- Checked Material Budget profile: DDD D66 versus DDD D67, and DDD D67 versus DD4hep D67.\r\n- Checked all GeometricDet member data: DDD D66 versus DDD D67, and DDD D67 versus DD4hep D67.\r\n- Checked that workflows with DDD D67 run smoothly with no extra error / warning (versus DDD D66).\r\n\r\nTO DO: compare DDD D66 versus DDD D67 further downstream.\r\nDo not expect any specific issue (took care of not changing strings like `BModule` for example, since it is used in Geometry/TrackerGeometryBuilder). \r\nBut this cannot be done fully blindly, need to be checked.\r\n\r\n### NBs\r\nNB 1: DD4hep D67 worflow does not run smoothly, due to non-related issues in HGCAL. I was able to debug the DD4hep D67 description by plugging it to a Run 3 Tracker envelope.\r\nNB 2: No specific focus on performance here, the idea in this PR was to get the run working on a DD4hep Phase 2 Tracker first, by fixing the numerous issues. Should expect additional perf improvement to come (spotted several points inside GeometricDet).\r\nNB 3: The changes are incorporated within tkLayout materials description core code, and tkLayout XML export, ie **any next Phase 2 Tracker description, will now automatically rely on this new paradigm**.\r\n\r\n\r\nFYI: @ianna @emiglior @skinnari @mmusich @jalimena @fabiocos @cvuosalo @civanch ", "branch": "master", "changed_files": 23, "closed_at": "1613647069", "comments": 50, "commits": 11, "created_at": "1612796364", "deletions": 2, "labels": ["code-checks-approved", "geometry-approved", "l1-pending", "operations-approved", "orp-approved", "pdmv-approved", "pending-signatures", "simulation-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "afa67cac697c601090c189695d3d56afe6fe623b", "merged_at": "1613647069", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 32843, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Phase2 Tracker description change of paradigm, to be compatible with DD4hep", "updated_at": "1613647069", "user": "ghugo83"}