{"additions": 1015, "auther_ref": "cuda_Time_Measurements", "auther_sha": "2b0b12428eb8e883317297dca3db2fea1212f3bf", "author": "AliinCern", "body": "#### What is the purpose of the program?\r\n\r\nA device (GPU) in a local machine can read/write host (CPU) memory in different methods by using Cuda API. In this program, we measured these methods in a local machine in order to find the best approachable to memory with respect to time. The program has four directions in time measurements:\r\n\r\n1. From Host To Device.\r\n2. On the Device.\r\n3. On the Host.\r\n4. From Device to Host.\r\n\r\n#### What methods are used in the Program?\r\n\r\n> With respect of First Direction Measurement:\r\nPart 0) The Device reads from Host memory directly without using Cuda API.\r\nPart 1) Measuring time to copy data from Host memory to Device memory using (cudaMemcpy).\r\nPart 2) Measuring time to lock Host pages for Device to read/write data using (cudaHostRegister).\r\nPart 3) Measuring time to copy from Host memory to Host page-lock using (cudaMemcpy).\r\nPart 4) Measuring time to copy from Host memory to Host page-lock using (memcpy), then Measuring time to copy from Host \r\npage-lock to Device memory using (cudaMemcpy).\r\nPart 5) Measuring time to lock Host pages using (cudaHostRegister) and Measuring time to copy from Host page-lock to Device memory using (cudaMemcpy). \r\n\r\n> With respect of Second Direction Measurement:\r\nAll Parts) Measuring time operations that are done on the Device using (cudaEventRecord).\r\n\r\n> With respect of Third Direction Measurement:\r\nAll Parts) Measuring time operations that are done on the Device using Host time elapse.\r\n\r\n> With respect of Fourth Direction Measurement:\r\nPart 0) The Device writes on Host memory directly without using Cuda API.\r\nPart 1) Measuring time to copy data from Device memory to Host memory using (cudaMemcpy).\r\nPart 2) Measuring time to unlock Host pages using (cudaHostUnregister).\r\nPart 3) Measuring time to copy from Host page-lock to Host memory using (cudaMemcpy).\r\nPart 4) Measuring time to copy from Device memory to Host page-lock using (cudaMemcpy), then Measuring time to copy from Host page-lock to Host memory using (memcpy).\r\nPart 5) Measuring time to copy from Device memory to Host page-lock using (cudaMemcpy), then unlock Host pages using (cudaHostUnregister).\r\n\r\n#### What are the command line Options to run the Program?\r\n  -p PARTS     select which parts (methods) to run, for example -p 12345 will run all methods. Please note that to run Part 0, use \r\n                      number 6 for example -p 6\r\n  -a COUNT   repeat each set of tasks COUNT times, and compute the average.\r\n  -f                 to save the result to a file.\r\n \r\n  -q                print the standard deviation of the measurements.\r\n  -t TASKS      repeat the task on the device/gpu TASKS times.\r\n\r\n#### Program Validation:\r\nwe ran the program using **_scram b runtests_**, and the result is this:\r\n---> test cudaTimeMeasurement succeeded\r\nTestTime:1\r\n^^^^ End Test cudaTimeMeasurement ^^^^\r\n", "branch": "master", "changed_files": 2, "comments": 15, "commits": 4, "created_at": "1646389095", "deletions": 0, "labels": ["pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "heterogeneous-pending"], "milestone": "CMSSW_12_3_X", "number": 37141, "release-notes": [], "review_comments": 3, "state": "open", "title": "Cuda time measurements", "updated_at": "1646523873", "user": "AliinCern"}