{"additions": 701, "auther_ref": "bugFixEdmPluginHelp", "auther_sha": "f6200bd5b9e843e052fc4b7d400acf087b73b804", "author": "wddgit", "body": "#### PR description:\r\n\r\nBug fix in edmPluginHelp. A crash would occur if a module plugin contained a helper plugin that contained a helper plugin of the same category recursively. At a point in the hierarchy where a helper plugin is contained, edmPluginHelp prints the descriptions of all possible plugins in the category. If one of the possibilities is a plugin that recursively contains a helper plugin of the same category the infinite recursion would occur. Containment could be direct or indirect. Then either memory or the stack limit would be exceeded eventually.\r\n\r\nThis fixes the crash reported in Issue #42988. It also fixes the format issues with the printout that Chris reported in the same issue.\r\n\r\nThis situation is somewhat rare.  It was noticed when printing for this module ```edmPluginHelp -p CkfTrackCandidateMaker```. That was the only one exhibiting the problem that I am aware of.\r\n\r\nI added some additional modifications to the printout related PluginDescription to make it easier to understand. There is some extra content to explain things. Also one level of numbering of sections is deleted. The section number hierarchy will now match the hierarchy of the ParameterSet, which is what we are trying to document, instead of the hierarchy of the description which has an extra level. It also makes this complex printout slightly simpler. The PluginDescription printout is still complex, but I don't see how to simplify it further. It is describing something complex.\r\n\r\nAlso adds to existing unit tests to cover these modifications. The extended unit tests would have detected the reported bug.\r\n\r\n#### PR validation:\r\n\r\nThis should only affect the output of edmPluginHelp for modules with helper plugins and ParameterSet unit tests in FWCore/Integration. It shouldn't affect anything else.\r\n", "branch": "master", "changed_files": 10, "comments": 17, "commits": 1, "created_at": "1698330529", "deletions": 37, "labels": ["core-approved", "fully-signed", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_13_3_X", "number": 43126, "release-notes": [], "review_comments": 4, "state": "open", "title": "edmPluginHelp bug fix, crash would occur if helper plugin contains itself recursively", "updated_at": "1698693787", "user": "wddgit"}