{"additions": 113, "auther_ref": "anomalyTriggerCMSSW", "auther_sha": "38fb6227b78efc27cbad809b799ccda75ff9ee36", "author": "aloeliger", "body": "### PR description:\r\n\r\n_CICADA_ is the Princeton University/University of Wisconsin unsupervised neural network anomaly detection trigger technique proposed for inclusion on CaloL1 hardware as soon as practical (please see slides [here](https://indico.cern.ch/event/1224193/contributions/5149890/attachments/2552412/4397381/Ojalvo_caloL1AD_update_Nov22.pdf) for a recent overview given to the L1 group).\r\n\r\nThe new trigger, and trigger hardware requires an emulator, and development has been implemented in the existing L1TCaloSummary offline L1 Trigger path ([L1TCaloLayer1/plugins/L1TCaloSummary.cc](https://github.com/cms-sw/cmssw/compare/master...aloeliger:cmssw:anomalyTriggerCMSSW?expand=1#diff-59befcbed4878bdbae908a6fa5c0fae462bd8f7dace59238143b7db74d7098e8) and it's test _cfi.py [L1TCaloLayer1/python/uct2016EmulatorDigis_cfi.py](https://github.com/cms-sw/cmssw/compare/master...aloeliger:cmssw:anomalyTriggerCMSSW?expand=1#diff-7be13daab905eb53ba8343fac2914060eeda3499c49cf33791264df20897e74e)) to complement the eventual implementation in the online L1TCaloSummary trigger hardware. The emulator works via the compiling of the exact same HLS4ML code used to make FPGA firmware into a c++ shared object ([L1TCaloLayer1/data/compiledADModel/caloADModel_v1.so](https://github.com/cms-sw/cmssw/compare/master...aloeliger:cmssw:anomalyTriggerCMSSW?expand=1#diff-971ed86e26c31d1a04739be33581d2a6934d0612db594e441660750a4fc72334)) which is accessed via an interface provided by the HLS4ML team ([L1TCaloLayer1/src/HLS_emulator.hh](https://github.com/cms-sw/cmssw/compare/master...aloeliger:cmssw:anomalyTriggerCMSSW?expand=1#diff-fb1131fb9cf3958d94bae677d66b07f2f3e0d716af3e6a360532a1290081b3ba), special thanks to Vladimir Loncar for [providing this technique to us](https://docs.google.com/presentation/d/1eS90WG8KA93u9TjmWNxLA9SSK7MJaqiyTUclQnbCGHw/edit#slide=id.p)). It is worth noting that this technique requires development of a specific interface for the model, which is necessary for compiling the .so, but is **not** required for standard CMSSW running/compiling, and is not provided in this pull request (but can be shared upon request). Upgrades to the trigger/trigger model can be compiled and included as future .so files in the data directory alongside older models. The location of this compiled .so model is provided to the emulator plugin in the _cfi.py relative to $CMSSW_BASE (\"compiledAnomalyModelLocation\"). Input into the model is given in the HLS4ML \"ap_fixed\" fixed precision format, as an array of fixed precision trigger region energies.\r\n\r\n(Previous test versions of the emulator relied upon the TensorFlow CMSSW interface to run the model as-is after training, which is not \"bit accurate\", or a complete porting of the HLS4ML code and special buildfile compilation options, both of which were not seen as a suitable final emulator. Some of thiese techniques are present in the PR history, but not in the final emulator)\r\n\r\nThe new output of the emulator is a float (called \"anomalyScore\", with value equivalent to hardware implementation, i.e. \"bit accurate\") that is placed into the event. The L1TCaloSummaryPath is not currently (to my knowledge) associated with further emulator paths or workflows. \r\n\r\n_CICADA_ is preparing for additional stages of evaluation alongside the proposed boosted jet trigger, so this emulator PR has been opened.\r\n\r\n### PR validation:\r\n\r\nDue to this emulator not being associated with any standard workflows yet, no changes are expected to standard workflows, and they are not useful in validation. All code compiles, and has had code formatting applied. We have performed internal validation of the output of this emulator with a dedicated ntuplizer on data and MC, and it produces values in line with what is seen in firmware testing. If additional validation checks are desired, the _CICADA_ team can discuss providing them or performing them upon request.\r\n\r\n### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport", "branch": "master", "changed_files": 4, "comments": 9, "commits": 14, "created_at": "1670601593", "deletions": 2, "labels": ["l1-pending", "pending-signatures", "orp-pending", "tests-started", "code-checks-approved"], "milestone": "CMSSW_13_0_X", "number": 40277, "release-notes": [], "review_comments": 0, "state": "open", "title": "CaloL1 Anomaly Detection Trigger (\"CICADA\") Emulator", "updated_at": "1670849225", "user": "aloeliger"}