{"additions": 2391, "auther_ref": "csc_seg_fit_factored_and_smatrixed", "auther_sha": "b779fc53f334b78405ed9eae8e273cc2f008b325", "author": "ptcox", "body": "This completes the conversion of CLHEP matrices to ROOT::SMatrix in the CSC least-squares fit code of all 5 CsC segment building algorithms, as required for CMSSW multithreading compatiiblity. It does this by factoring out the fit into a base class CSCSegFit, where the SMatrix code lives. The current default segment builder algorithm, CSCSegAlgoST, uses a derived class CSCCondSegFit, which involves some sophisticated (i.e. I don't understand) conditioning passes. All 4 other algorithms use the simple base class. While making this conversion and factoring I needed to bring the old algorithms back to life - none had been run in years. This involved updating their config files (adding me42). They all now run on 73X relval samples. A number of minor bugs were fixed. My basic validation was to ensure that the default ST algorithm produces the same, identical, segments in 1000 TTbar + 25ns BX pileup events from the 73X relvals. This newly-factored seg-fit  version does indeed produce identical segments to those in the ST version with the SMatrix-based seg fit embedded. I have also run the same 1000 events with valgrind and there are no errors or memory leaks detected in this code (or elsewhere in CSC local reco.) Because this version should now be multithreading compatible I have once more changed the CSCSegmentProducer to a stream::EDProducer. Finally, I ran the Reco-required \"runTheMatrix.py -s --useInput all\" tests in a 75X IB and they completed with no errors. I have one caveat: I know nothing about 'fillDescriptions' but I get the impression that sooner or later HLT will want that included. Because there are multiple algorithms it will be complex to write such functions and I don't plan to do it any time soon (April would be a possible timescale, if I am still around.)\n", "branch": "CMSSW_7_5_X", "changed_files": 35, "closed_at": "1424511208", "comments": 17, "commits": 19, "created_at": "1424351723", "deletions": 2919, "labels": ["comparison-available", "fully-signed", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "866b6ebde57d40f32edee1e6e0037e7b0e3afe77", "merged_at": "1424511208", "merged_by": "cmsbuild", "milestone": "CMSSW_7_5_X", "number": 7864, "release-notes": [], "review_comments": 5, "state": "closed", "title": "CSC segment fit factored and smatrixed", "updated_at": "1424520509", "user": "ptcox"}