{"additions": 1007, "auther_ref": "CMSSW_14_0_X_httNanoAddons", "auther_sha": "b42510b295cab7db23f9526781da5d8685ce7caf", "author": "mbluj", "body": "#### PR description:\r\n\r\nThis PR adds lepton time-life related information to NanoAOD. The information contains:\r\n* (refitted) secondary vertex for 3-prong taus (with covariance matrix),\r\n* impact parameter vector (with significance) of the electron, muon and tau tracks wrt PV fitted with beam-spot constraint,\r\n* parameters of electron, muon and tau tracks (with covariance matrix),\r\n* primary vertex with beam-spot constraint (position and covariance matrix).\r\n\r\nAll those variables are used in the measurement of CP structure of the Higgs-tau Yukawa coupling and related analyses, e.g. measurement of polarization of Z in decays to taus.\r\n\r\nTechnically all lepton variables are added by a custom table producer (a template class instantiated for `pat::Electron`, `pat::Muon` and `pat::Tau`), while PV with BS information with a new instance (for `reco::Vertex`) of a standard table producer.\r\nIn the case of Run-2 input samples the PV with the BS constraint is produced with a custom producer with miniAOD inputs (a new `reco::Vertex` collection with one item) as vertices with BS are not available in those samples.\r\n\r\nIn addition the PR enables possibility to add new variables describing the main PV, e.g. its covariance matrix, in its table producer.\r\n\r\nIn case a given new variable is not computed, e.g. SV for 1-prong taus or variables for a lepton is not passing selection, zeros are stored which are then effectively compressed in an output file.\r\n\r\n\r\n#### PR validation:\r\n\r\nValidated with NanoAOD v12-like workflow (as it is in 14_0_0_pre1) with 2022 and 2018 TTbar samples.\r\nAdded variables increase size of NanoAOD by ~8.5% (wrt 14_0_0_pre1 default) which is distributed between taus (~3%), electrons and muons (~2% each) and PV with BS (~1%)\r\nIn the current setup the variables are produced as a part of the official nanoAOD workflow, but it can be considered to be switched on by a dedicated modifier only for a custom production workflow.\r\n\r\nPresentation at the XPOG meeting: [link](https://indico.cern.ch/event/1352781/#10-lepton-life-time-in-nano)\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\n<!-- Please replace this text with any link to the master PR, or the intended backport release cycle numbers -->\r\n\r\nIt is foreseen to backport to 13_3_X, but without enabling the changes in official workflow for a \"private\" production of v13-like NanoAOD. \r\n", "branch": "master", "changed_files": 17, "comments": 13, "commits": 11, "created_at": "1702032832", "deletions": 99, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending", "xpog-pending", "tracking"], "milestone": "CMSSW_14_0_X", "number": 43525, "release-notes": [], "review_comments": 32, "state": "open", "title": "Lepton time-life info for NanoAOD", "updated_at": "1706108829", "user": "mbluj"}