{"additions": 611, "auther_ref": "new-paired-jets", "auther_sha": "ebf90c258afc9f93c7754d738d8b1e1664302581", "author": "tajrussell", "body": "#### PR description:\r\nAdding PAIReD jets (https://indico.cern.ch/event/1372046/contributions/5993835/attachments/2874191/5033020/BTV_PAIReD.pdf) currently intended mainly for use in the resolved regime of heavy particle decays. The jets are added as a new flat table in NanoAOD that stores the indices of the seed jets as well as the bb, cc, and ll tagging scores from a version of parT that has been retrained on PAIReD jets. The number of b and c hadrons within the PAIReD ellipse is also stored for events that are not real data. \r\n\r\nThe main file is RecoBTag/ONNXRuntime/plugins/PAIReDONNXJetTagsProducer.cc which loops over all pairs of AK4 jets in an event and finds the candidates in the ellipse defined by the two jets. This makes use of the inEllipse() function in the newly defined file RecoBTag/FeatureTools/interface/paired_helper.h. The Producer then organizes the inputs for parT and runs on a new ONNX model that needs to be simultaneously added to RecoBTag/Combined/data to produce the bb, cc, and ll tagging scores (https://github.com/cms-data/RecoBTag-Combined/pull/58).\r\n\r\nThe RecoBTag/ONNXRuntime/plugins BuildFile is updated to include a number of dependencies required for the new EDProducer. \r\n\r\nPhysicsTools/NanoAOD/python/jetsPAIReD.py defines tasks for running the new producer on data and MC, and PhysicsTools/NanoAOD/python/nano_cff.py is edited to include these tasks in NanoAOD production.\r\n\r\n#### PR validation:\r\nWe have validated that the scores produced by running the producer being added to CMSSW in this PR match those produced by the training framework which uses PFNano samples. This can be seen on slide 26 of this presentation (https://indico.cern.ch/event/1347445/contributions/5857902/attachments/2866917/5018410/Higgs-Charm%20Workshop.pdf)", "branch": "master", "changed_files": 5, "comments": 21, "commits": 4, "created_at": "1718204181", "deletions": 3, "labels": ["reconstruction-pending", "pending-signatures", "tests-approved", "orp-pending", "requires-external", "code-checks-approved", "xpog-rejected", "btv"], "milestone": "CMSSW_14_2_X", "number": 45207, "release-notes": [], "review_comments": 7, "state": "open", "title": "Adding PAIReDJet Table to NanoAOD", "updated_at": "1725349003", "user": "tajrussell"}