{"additions": 26, "auther_ref": "nanoDQMIOoneShot", "auther_sha": "a43515f755858cdbf306536f1373865a8deb4cec", "author": "jfernan2", "body": "#### PR description:\r\nDQMIO data tier is saved perRun basis up to now, while perLS mode was activated in the so called nanoDQMIO format which is described here:\r\nhttps://twiki.cern.ch/twiki/bin/view/CMS/PerLsDQMIO\r\n\r\nThis implied running RECO-DQM steps twice, one perRun and one perLS. This PR attempts to create the output in one shot to reduce computing resource needs, by enabling perLS mode for the list of (needed) MEs described in DQMServices/Core/python/nanoDQMIO_perLSoutput_cff.py\r\n\r\nThese changes result in an (expected) increase of the DQMIO data tier (usual perRun MEs + additional dedicated perLS MEs) but maintaining at the same time (plain root) DQM format (to be uploaded to DQM GUI) after HARVESTING identical (up to rounding errors).\r\n\r\nWith this single shot mode, there will only be one output file, with both per-run and per-lumi histograms in it (depending on the ME). For the per-lumi MEs, no per-run results will be present, but that is fine, the harvesting job will make per-run histograms from the per-lumi ones. The Harvesting Job will see per-lumi histograms (which only matters if there is endLumi code, which is rare outside online), and save per-Job histograms in the end (which will be full runs for the usual Harvesting jobs). The plain ROOT file should be the same, up to rounding errors, which the DQM BinByBin tool may detect in this PR.\r\n\r\n#### PR validation:\r\n\r\nChecked MEs from DQMServices/Core/python/nanoDQMIO_perLSoutput_cff.py are created in a per LS basis\r\nChecked DQMIO output does not explode\r\nChecked DQM Harvesting works\r\nrunTheMatrix.py -l limited -t 8", "branch": "master", "changed_files": 3, "comments": 7, "commits": 3, "created_at": "1679920891", "deletions": 6, "labels": ["dqm-pending", "pending-signatures", "orp-pending", "tests-started", "code-checks-approved"], "milestone": "CMSSW_13_1_X", "number": 41196, "release-notes": [], "review_comments": 0, "state": "open", "title": "[DRAFT] DQM perLS in one shot", "updated_at": "1679924175", "user": "jfernan2"}