{"additions": 46, "auther_ref": "Phase1-HE19", "auther_sha": "d8285fb53a4b6a56a8328a0c301d19daf83ed966", "author": "kpedro88", "body": "We now have a significantly improved (from the technical/code side) \"Phase1Reconstructor\" for HBHE, which was originally developed for use with the Phase 1 upgrades but will be used globally in 2017 (even with 99% of channels still using HPDs). We would prefer not to maintain two separate algorithms for local reconstruction, so we propose to move to the Phase1Reconstructor for all legacy reconstruction going forward. There are no expected changes for Method 0 reconstruction and very minimal changes for Method 2 (due to floating-point arithmetic).\r\n\r\nIn addition, this PR unifies the standard set of Method 0 parameters, as was already done for Methods 2 and 3.\r\n\r\nThere will be a subsequent PR to propagate this change to the NZS reconstruction, once all the necessary settings have been determined.\r\n\r\nMore info from @igv4321:\r\n>Here is a summary about replacing Run 2 HBHE reconstruction code with\r\nPhase 1 reconstruction. The reason for this replacement is, basically,\r\nthe need to continue providing reco improvements for Run 2 data.\r\nNaturally, these improvements are made to the current reconstruction\r\n(Phase 1) first. The design of Phase 1 HBHE reco is streamlined compared\r\nto that of Run 2, and it allows for simpler modification and maintenance.\r\nFor example, introduction of a class \"HBHEChannelInfo\" allows for\r\na relatively straightforward addition of new information to be passed\r\nto energy reconstruction algorithms like \"Method 2\", while with the\r\nRun 2 code one would have to modify a substantial number of interfaces\r\nand calls to achieve the same effect.\r\n>\r\n>Because of this, we need to replace Run 2 HBHE reconstruction with\r\nPhase 1. This also essentially means the end of Run 2 HBHE reconstruction\r\nmaintenance and will free up people's time.\r\n>\r\n>There is a difference between the results obtained with Run 2 reco and\r\nPhase 1 reco. These differences are discussed in detail in several\r\npresentations by Halil Gamsizkan at the Phase 1 Software Task Force\r\nmeetings:\r\n>\r\n>https://indico.cern.ch/event/608981/contributions/2455507/attachments/1402669/2141578/rechits_run2vsPh1.pdf\r\n>https://indico.cern.ch/event/614725/contributions/2479322/attachments/1413750/2164286/rechits_run2vsPh1_diagfix.pdf\r\n>https://indico.cern.ch/event/615744/contributions/2484482/attachments/1417404/2170637/rechits_run2vsPh1.pdf\r\n>\r\n>To summarize, there are essentially no differences between Run 2 and\r\nPhase 1 rechit energies reconstructed by \"Method 0\". For \"Method 2\",\r\n0.2% of the rechits exhibit relative energy differences above 10^{-5}.\r\nI believe that these differences can be attributed to the sensitivity\r\nof \"Method 2\" to round-off errors (round-offs are different for Run 2\r\nand Phase 1 codes because in some places floats were replaced with\r\ndoubles and otherwise). We have also observed differences in\r\nchi-square which accompany the differences in energy, as well as\r\nswitches between 1-pulse and 3-pulse fits.\r\n>\r\n>There is, indeed, some structure to these differences, as explained in\r\nthe last talk by Halil. If you want to further investigate the reasons\r\nfor these disagreements, a substantial involvement of \"Method 2\"\r\nexperts into these studies will be necessary.\r\n>\r\n>Switch to Phase 1 also means different encoding for the rechit \"aux\"\r\nwords and status bits. Since this switch has to happen for 2017 reco\r\nanyway, I don't think that this will have negative consequences for\r\nRun 2 rereco.\r\n\r\nattn: @mariadalfonso, @abdoulline, @hatakeyamak, @deguio ", "branch": "CMSSW_9_0_X", "changed_files": 7, "closed_at": "1488461937", "comments": 19, "commits": 4, "created_at": "1488404816", "deletions": 39, "labels": ["comparison-available", "dqm-pending", "orp-pending", "pending-signatures", "reconstruction-rejected", "simulation-pending", "tests-approved"], "milestone": "CMSSW_9_0_X", "number": 17676, "release-notes": [], "review_comments": 0, "state": "closed", "title": "use HBHE Phase1 reco for Run2/legacy, unify M0 parameters", "updated_at": "1488461937", "user": "kpedro88"}