{"additions": 312, "auther_ref": "empty-LS-mode-76X", "auther_sha": "2213e3d97289864d913fcc8fdabd6e6a7acd513b", "author": "smorovic", "body": "Implementation of JSON metadata output for each lumisection in Filter Units and several other smaller changes and bugfixes:\n- file distribution scheme in ramdisk previously allowed skipping lumisections with no data. This is now modified so that each process must transition through each lumisection starting from one first seen in lock file in BU ramdisk.\n- correponding changes in DAQ (streamer) output module, and DQMHistogram, L1/HLT rates stream producers to output metadata json for empty lumisections\n- avoid casting -1 to uint32 in Trigger JSON module, which converts it in the valid range of the checksum (-1 is intended as true negative in JSON to signal that checksumming is disabled in particular cases)\n- added \"maxBufferedFiles\" parameter which limits the number of currently open files (useful in case of more than two input buffers used)\n- exception thrown when \"_\" (underscore) is used as stream name because this breaks file naming convention in DAQ (and breaks output merging by hltd)\n- updated fake BU code with latest json format used by DAQ BU application\n  removed old unused test mode code in input source and DaqDirector\n#10796 is 74X equivalent of this PR\n#10807 is 75X equivalent of this PR\n", "branch": "CMSSW_7_6_X", "changed_files": 12, "closed_at": "1439878620", "comments": 23, "commits": 18, "created_at": "1439738181", "deletions": 231, "labels": ["comparison-available", "daq-approved", "dqm-approved", "fully-signed", "hlt-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "d5430d01652728466bebb82de4a794799ae4a2ca", "merged_at": "1439878620", "merged_by": "cmsbuild", "milestone": "CMSSW_7_6_X", "number": 10808, "release-notes": [], "review_comments": 0, "state": "closed", "title": "metadata JSON files produced for empty lumisections in DAQ (76X)", "updated_at": "1447408313", "user": "smorovic"}