{"additions": 904, "auther_ref": "fc-etllayout", "auther_sha": "2459b7540ae7f75fb58c577b3bced26d607007c2", "author": "fabiocos", "body": "#### PR description:\r\n\r\nThis PR updates the ETL DetSector navigation algorithm originally deployed in #31765  with the aim of recovering those GeomDets that are possibly there in particular cases (very asymmetric trac extrapolation uncertainties in x and y), trying at the same time to make the navigation heavier.\r\n\r\nA description of the strategy is provided by @martatornago in https://indico.cern.ch/event/1033599/contributions/4340606/attachments/2236330/3791605/ETLNavigationAlgorithm.pdf .\r\n\r\nThe logical layout of sensors in a MTDDetSector (a x-y matrix of alternated left-right type rows of modules) is loaded from the xml geometry and stored in the refreshed ```MTDTopology``` class of ```Geometry/MTDNumberingBuilder```, and functions are provided to search for close modules both in the horizontal and vertical direction. \r\n\r\nThis functionality is used inside the method ```compatibleDets``` of ```MTDDetSector``` in ```RecoMTD/DetLayers``` replacing the previous algorithm. \r\n\r\nThe test code in this package is expanded, and used to build a unit test, whose reference needs to be added into ```cms-data/Geometry-TestReference```.\r\n\r\nAccording to the ```Timing``` service, the time taken by ```trackExtenderWithMTD``` with this new version of the navigation is within 3% of the previous one. A more detailed analysis will be possible when igprof is fixed.\r\n\r\n#### PR validation:\r\n\r\nCode compiles, the unit test provides the expected results, extensively checked especially in sector borders, and the wf 34634.0 shows the expected behaviour: all previously found modules are collected by the new algorithm, and more are found in the case previously missed of very asymmetric extrapolation uncertainties. The DQM output on 100 TTbar events does not show any significant difference, beyond what described. ", "branch": "master", "changed_files": 27, "closed_at": "1621083925", "comments": 68, "commits": 19, "created_at": "1619882806", "deletions": 473, "labels": ["code-checks-approved", "fully-signed", "geometry-approved", "orp-approved", "reconstruction-approved", "requires-external", "tests-approved", "upgrade-approved"], "merge_commit_sha": "a8ae5432989b0f9f3fe4fd035bc504961d2b9c34", "merged_at": "1621083925", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 33598, "release-notes": [], "review_comments": 11, "state": "closed", "title": "MTD geometry and reconstruction: store ETL layout logic into MTDTopology, use for ETL layers navigation in reconstruction", "updated_at": "1621083925", "user": "fabiocos"}