{"additions": 2723, "auther_ref": "CMSSW_14_1_X_bigpixel_protoT39", "auther_sha": "76f9689b6367e36e6f8f7a39b654fb66c76ceea1", "author": "emiglior", "body": "#### PR description:\r\n\r\nThis PR is a follow-up of the draft [PR#42454](https://github.com/cms-sw/cmssw/pull/42454) (closed in Jan 2024).\r\n\r\nThe PR introduces the so-called BigPixels (elongated pixels between two readout chips) for the phase-2 InnerTracker following the implementation proposed in:\r\n\r\nhttps://indico.cern.ch/event/1382902/contributions/5816585/attachments/2805475/4895325/Phase-2_IT_BigPix_TrkDPG.pdf\r\n\r\n- **Description.** BigPixels are introduced in the file pixelStructureTopology.xml or by using the TrackerAdditionalParametersPerDet rcd for geometries loaded from DB (none yet). Therefore, the PR restores the changes of the infrastructure needed for using the TrackerAdditionalParametersPerDet rcd, introduced for the bricked pixels and then removed with [PR#40443](https://github.com/cms-sw/cmssw/pull/40443) but without reintroducing the functions related to bricked pixels.\r\n**NOTE (similar to [PR#34120](https://github.com/cms-sw/cmssw/pull/34120)): the record PTrackerAdditionalParametersPerDetRcd is consumed by the TrackerGeomBuilderFromGeometricDet, which is the same for Runs 2&3 and Phase 2. Therefore, this PR also modifies Runs 2&3, by including the new record.** \r\n\r\n- **Tracker geometry.** The Tracker phase-2 test geometry in which BigPixels are introduced is T39, thus skipping versions T36-T37-T38 which are currently under development by @Raffaella07.\r\n\r\n- **Implementation.** Phase-2 pixels are now described by the class RectangularPhase2PixelTopology inheriting from PixelTopology. Code for Tracker local reco was adapted to work both the phase-1 pixels (RectangularPixelTopology) and with phase-2 pixels (RectangularPhase2PixelTopology). The function siPixelUtils::generic_position_formula(), used in PixelCPEGeneric, was modified in order to be used both for phase-1 and phase-2 BigPixels. A side-effect was to add to the abstract class PixelTopology the methods getPixelFractionInX() and getPixelFractionInY(). @fabiocos @martinamalberti: the implementation of these fcn in ProxyMTDTopology is just a placeholder to compile the code. Please let us know what the actual code should be.\r\n\r\n#### PR validation:\r\n    \r\ncompilation ok after git cms-checkdeps -a -A\r\nscram b code-checks, code-format\r\nscram b runtests\r\nrunTheMatrix.py -l limited -i all --ibeos\r\n\r\nNo changes are expected on phase-1 (set of tracking validation plots on a single muon sample on phase-1 geometry)\r\n http://personalpages.to.infn.it/~migliore/BigPixels/SingleMuPt100-phase1/plots-20240323/\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport and no backport needed.\r\n\r\nSpecific w/f for test on T39: 30034.0\r\n\r\n@gbardell @langufo @bartosik-hep \r\n@mmusich @sroychow @mdelcourt FYI\r\n", "branch": "master", "changed_files": 176, "comments": 2, "commits": 8, "created_at": "1711665039", "deletions": 264, "labels": ["reconstruction-pending", "dqm-pending", "l1-pending", "hlt-pending", "alca-pending", "db-pending", "geometry-pending", "operations-pending", "pending-signatures", "tests-pending", "orp-pending", "pdmv-pending", "upgrade-pending", "code-checks-rejected", "tracking", "trk"], "milestone": "CMSSW_14_1_X", "number": 44576, "release-notes": [], "review_comments": 0, "state": "open", "title": "introducing BigPixel for phase-2 InnerTracker  in T39 geometry", "updated_at": "1711665536", "user": "emiglior"}