{"additions": 522, "auther_ref": "fo_nt2_mapfix2", "auther_sha": "f6823b198b826508545b52a94c2397ec964fffe7", "author": "CTPPS", "body": "#### PR description:\r\n\r\nFor the TOTEM special foreseen on 25.6.2023, the new T2 telescope will be used (and removed after the run) to measure inelastic rate and veto diffractive p+p collisions, when measuring the elastic p+p cross section.\r\nPreviously, PR #41472 introduced the 2-channel unpacking for T2 and PR #41777 included some T2 DQM plots and fixes. As part of the approval for PR #41777 , some fixes and syntax safety improvements were asked for, see https://github.com/cms-sw/cmssw/pull/41777#issuecomment-1564189810 . This meant that the tracked T2 parameter useOlderT2TestFile was added to several python config files in EventFilter/CTPPSRawToDigi, and also some other cosmetic changes to those files. \r\nLast sunday @perrotta wrote a PR (#41784, #41785 ) to implement the asked-for changes, from which I include most changes into this PR.\r\n\r\nLast week we also obtained new T2 test files with a new mapping (the final version), and a more diverse set of emulated T2 data frames. (Run 368080 had LE distributed around 5 and TE ~ 12 for all events, Run 368081 same LE value but TE ~9, and Run 368082 same as 368080 but with tracks in half the planes only). Testing the code with these new files exposed several more bugs in the T2 code in the common PPS unpacker.\r\n\r\nOn receiving more feedback from the detector experts, it turned out that one more member needed to be added to the T2Digi definition in DataFormats/TotemReco , to access header flags. @vavati also suggested that the DQM additions in PR #41777 needed to be expanded by adding the T2 as a DQMCalibrationSource, necessitating changes to RecoPPS/Configuration, also including the XML T2 geometry in a RecoPPS/Local T2 config file since the geometry was used in both the T2Rechit producer and T2 DQM module, but was not found in the database as far as we looked (thanks,  @grzanka !) . The multichannel unpacker from PR #41472 was also turned on by default, needing era modifiers for 2016-2018 PPS data taken without the T2 detector, for which the dummy mapping file mapping_totem_nt2_2021.xml caused an exception since it was copied from 2017 diamond mapping without the changes in T2 xml schema introduced in PR #41472.\r\n\r\nAt present the T2 CRC field in the VFAT frame in the test files are still just a constant stub, but in the next version of the T2 firmware expected within a few days this will be calculated, and can validate the present calculation in the code. The code is using the same CRC formula as the RP, but due to the inverted order of reading the VFAT frame between T2 & Roman Pots, this needed new helper functions, as did the VFAT signature 'A','C','E' header word intializer checked by the footprint helper.\r\n\r\n#### PR validation:\r\n\r\nA subset of  runTheMatrix tests relevant for the PPS detectors that might be affected by our code changes was run successfully after the era modifier fix noted above. Those were 136.793 & 1041 & 1042. The T2 unit test under RecoPPS/Local passed, while previously one unit test in  in CalibPPS/TimingCalibration & 25 DQM/Integration were seen to fail when run on lxplus due to the files being on tape, but succeed when cmsbot/Jenkins ran on locally cached copies, see this comment:  https://github.com/cms-sw/cmssw/pull/41785#issuecomment-1570004633\r\n\r\nThe PR #41785 still passed the tests even so ( https://github.com/cms-sw/cmssw/pull/41785#issuecomment-1566839728 ), although more changes have been added than is included there.\r\n\r\nThe T2 unit test in RecoPPS/Local was successfully run with the older definition & xml mapping, producing T2Digis, and likewise the totemt2_dqm_test_nino_cfg.py script on last week's new files, produced the expected DQM plots. The  totemt2_dqm_test_common_cfg.py script was run on PPS alignment run data with the other PPS detectors connected but not T2, showing that even though we include T2 in the common CTPPS RawToDigi and Reconstruction tasks, this does not negatively affect the other PPS detectors.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThese three PR's, #41472 , #41777 and this one should be backported either to a special release on the 13_0_X cycle or the appropriate regular release on the 13_0_X . At a lower priority, backporting will also be done to 13_1_X.\r\n\r\n", "branch": "master", "changed_files": 25, "comments": 1, "commits": 1, "created_at": "1685725419", "deletions": 84, "labels": ["reconstruction-pending", "dqm-pending", "alca-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-rejected"], "milestone": "CMSSW_13_2_X", "number": 41859, "release-notes": [], "review_comments": 0, "state": "open", "title": "Update Totem T2 mapping, fix bug in VFAT footprint check, and implement suggestions from PR #41777", "updated_at": "1685725859", "user": "oljemark"}