{"additions": 4147, "auther_ref": "geoProposal120pre3", "auther_sha": "8004bdcf54dce884cafab1ecd59e33f1b084a569", "author": "CTPPS", "body": "#### PR description:\r\nThis PR implements the description of Run3 PPS detectors (tracking and timing) at the status of art of current knowledge (2021/Run3 geometry for PPS was till now a replica of Run2 geometry).\r\nTwo geometries have been implemented: one to be used in Simulation workflows and one in Reconstruction's.\r\nThis is a peculiarity of PPS that we need to conserve and that arises from the specific features of how we deal with the connection with LHC machine in the two workflows.\r\nMost of the files can be used for both geometries, when it was not possible, the involved files have been placed in Reco/Simu subdirs.  \r\nThe geometry described in dict2021Geometry.py P5 contains the Simu version, the one described in geometryRPFromDD_2021_cfi.py contains the Reco version.\r\nWe have placed the new files in directories marked with 2021 flags trying to comply as much as possible to the Geometry naming conventions, provided that we also had to deal with two different detectors placed in four different pots, and a strict observations of the rules was not considered efficient nor clear enough.  \r\nFiles needed in Run2 geometries have not been touched, to keep a full back-compatibility.\r\nThe tools to produce .db files for 2021 geometry has been update3d as well.\r\n\r\n#### PR validation:\r\nThe geometries have been tested with a full (private) Simu+Reco chain which loads the two geometries, checking that we obtain compatible results.\r\nSame results are obtained reading directly the xml's and reading the .db files produced with the official tools.\r\nTests with Run2 data has also been done: Run2 data processing is not affected by the PR.\r\nThe detectors are still being built thus no tests on real data could be performed.\r\n \r\n\r\n", "branch": "master", "changed_files": 46, "closed_at": "1626337781", "comments": 1, "commits": 24, "created_at": "1626331444", "deletions": 125, "labels": ["code-checks-rejected", "db-pending", "geometry-pending", "orp-pending", "pending-signatures", "tests-pending", "upgrade-pending"], "milestone": "CMSSW_12_0_X", "number": 34495, "release-notes": [], "review_comments": 0, "state": "closed", "title": "PPS geometry for Run3", "updated_at": "1626337781", "user": "fabferro"}