{"additions": 361, "auther_ref": "implement_blocks_with_stride", "auther_sha": "1798b10f1665ac7231ed1f70462d1bcc6cab2bd2", "author": "fwyzard", "body": "#### PR description:\r\n\r\n`blocks_with_stride(acc, size)` returns a range than spans the (virtual) block indices required to cover the given problem size.\r\n\r\nFor example, if size is 1000 and the block size is 16, it will return the range from 1 to 62.\r\nIf the work division has more than 63 blocks, only the first 63 will perform one iteration of the loop, and the other will exit immediately.\r\nIf the work division has less than 63 blocks, some of the blocks will perform more than one iteration, in order to cover then whole problem space.\r\n\r\nAll threads in a block see the same loop iterations, while threads in different blocks may see a different number of iterations.\r\n\r\n---\r\n\r\n`elements_in_block(acc, block, size)` returns a range that spans the element indices within the given block.\r\n\r\nIf the work division has only one element per thread, the loop will perform at most one iteration.\r\nIf the work division has more than one elements per thread, the loop will perform that number of iterations or less if it reaches size.\r\n\r\n---\r\n\r\nSimplify the unit tests, and extend them to cover the newly introduced functionality.\r\n\r\n#### PR validation:\r\n\r\nThe updated unit tests compile and pass.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nIf the `master` branch is moved to `CMSSW_14_0_X`, this PR will be backported to `CMSSW_13_3_X`.", "branch": "master", "changed_files": 2, "comments": 2, "commits": 3, "created_at": "1699288038", "deletions": 198, "labels": ["pending-signatures", "orp-pending", "tests-started", "code-checks-pending", "heterogeneous-pending"], "milestone": "CMSSW_14_0_X", "number": 43205, "release-notes": [], "review_comments": 0, "state": "open", "title": "Add the `blocks_with_stride` and `elements_in_block` ranges", "updated_at": "1699288093", "user": "fwyzard"}