{"additions": 964, "auther_ref": "OfflineDQM_June2018_IntegrationBranch-from-CMSSW_10_2_X_2018-07-02-2300", "auther_sha": "51d6fc6250054ac587f033da3a5e1a0477232e8f", "author": "cms-bph-trigger", "body": "In this pull-request many features of the offline DQM code used for BPH triggers have been fixed and optimised, and few more functionalities have been added.\r\nHere a list of the major changes:\r\n\r\n- **New general structure** of the code: for each efficiency type (defined as the \"cases\" in the big \"switch\") the numerator histos are filled in a nested environment just after the denominator filling, instead of defining two separate environments with specific selection criteria for each of them.\r\n- **Fixed trigger matching** feature: the `bool BPHMonitor::matchToTrigger` function is now using the HLTConfigProvider method to access the trigger-object collections.\r\n- **New correction for prescaled triggers**: while using the reference method to produce efficiencies, if the numerator path is prescaled it would flatly decrease the resulting efficiency by that prescale value. By filling the numerator histograms with weighted events, according to that prescale, the reduction effect is corrected.\r\n- **Better tuning of the offline selections** (especially the dimuon invariant masses), to select the correct regions where to compute the efficiency. This helps in some modules to select a pure region for the signal, in other modules (based on background events) to select the appropriate kinematic region.\r\n- **Customised and optimised binning**: to reduce the global number of bins, especially where they are not needed, the binning of the histograms has been refined\r\n- **Removal of few meaningless efficiencies**: some modules defined in the list of the cff file (devoted to the L1 efficiency of dR(MuMu) cut in 2mu+trk triggers) have been removed, since their efficiency definition is not correct (using at denominator a 2mu trigger, they will always be biased by the inefficiency of the track reconstruction at HLT)", "branch": "master", "changed_files": 4, "closed_at": "1531421648", "comments": 30, "commits": 4, "created_at": "1530619787", "deletions": 779, "labels": ["code-checks-approved", "comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "d97b988fbc34117137b4093ae82fd9f5faad7779", "merged_at": "1531421648", "merged_by": "cmsbuild", "milestone": "CMSSW_10_2_X", "number": 23738, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Improvements and fixes for the BPH-trigger offline DQM code", "updated_at": "1531421648", "user": "aboletti"}