{"additions": 1039, "auther_ref": "hgcalrelval", "auther_sha": "e45afdcf95662c430226fa48a00a73072d701722", "author": "apsallid", "body": "#### PR description:\r\n\r\nThis PR contains code we (@rovere, @felicepantaleo, @lecriste) developed and tested in order to create the validation reports for the regular RelVal campaigns. \r\n\r\nThe workflow for a validation report is fully documented in [1], where the code is also described in more detail. \r\n\r\nYou will spot some commented code in the RelVal sample list as well as in a few commands, which we would like to keep. The RelVal list is under constant review (e.g CloseByParticleGun samples are really helpful but not unfortunately in pre7 or after pre4 and only produced in pre6), while certain strings in the \"raw\" campaigns are slightly changing each time and some tweaks are necessary. \r\n\r\nThis work is based on and inspired from the Tracker validation work. \r\n\r\nThese scripts can also be used for a custom validation of certain new features and compared with the RelVal samples of the latest pre-release. \r\n\r\nAlso, after the introduction of TICL, we update the `hgcalPlots.py` with the correct path where the plots of the relevant objects lives in the DQM files. \r\n\r\n#### PR validation:\r\n\r\nThe code in this PR has been used for the validation reports in campaigns from 11_1_0_pre4_phase2 until this week pre7 campaigns and all results are placed in a dedicated webpage [2].\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nThis is not a backport.\r\n\r\n[1] http://hgcal.web.cern.ch/hgcal/Validation/RelVals/\r\n\r\n[2] http://cms-hgcal-validation.web.cern.ch/cms-hgcal-validation/\r\n", "branch": "master", "changed_files": 4, "closed_at": "1590415604", "comments": 13, "commits": 7, "created_at": "1590399381", "deletions": 71, "labels": ["code-checks-approved", "comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "34d2bfdb1235852ca4b44f1d9bda1c7c19776c7a", "merged_at": "1590415604", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 29977, "release-notes": [], "review_comments": 0, "state": "closed", "title": "[HGCal] Validation scripts and code for RelVal campaigns", "updated_at": "1590415604", "user": "apsallid"}