{"additions": 2, "auther_ref": "GlobalQt80X", "auther_sha": "9bc1a86d388e8301adbff137889057aaad91ac26", "author": "mbandrews", "body": "**Set Global and Raw Data Quality Summaries to correctly show RED when an FE is in DISABLED state:**\n(1) Include channels with integrity=kUnknown in global quality summary analysis.\n(2) Set RawData Quality Summary to show RED when FE is in DISABLED state.\n\n**Background:**\n(1) At the moment, if integrity=kUnknown or kMUnknown, the channel is not analyzed.\n- The fix ensures status from other quality inputs are still propagated to Global Quality even if Integrity=kUnknown for that channel as occurs when there is low/zero digi occupancy\n- In collisions run 278821, the entire EE+04 was RED in Trigger Primitives but because Integrity showed YELLOW, the Bad status from TPs was not propagated to Global Quality. The nature of the problem caused digis to not be produced for this FED.\n- Moreover, a patch implemented by Pierre some time ago prevents DCC desync errors--which normally trigger the Integrity Summary to show RED--to no longer be propagated to the DQM, so DQM thinks there are no errors and that the occupancy is just harmlessly low/zero\n\n(2) At the moment, an FE in DISABLED state is not a trigger for Raw Data Quality to show RED.\n- Also in collisions run 278821, the entire EE+04 was in RawData=DISABLED, with no raw data (and so digis and rechits) being produced for the entire FED. The whole run had to be flagged as BAD as a result.\n- As approved by PFG, the severity of the problem warrants RawData=DISABLED to be included in the list of states that should be set to show RED, as implemented in this fix\n\nIn conjunction with 81X PR https://github.com/cms-sw/cmssw/pull/15553\n", "branch": "CMSSW_8_0_X", "changed_files": 2, "closed_at": "1472037620", "comments": 7, "commits": 2, "created_at": "1471881643", "deletions": 2, "labels": ["comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "e65eaed3d3c1ffc0389a0a81aed82a873f8e1045", "merged_at": "1472037620", "merged_by": "cmsbuild", "milestone": "CMSSW_8_0_X", "number": 15552, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Set Global Quality to show RED when FE is disabled", "updated_at": "1472037621", "user": "mbandrews"}