{"additions": 155, "auther_ref": "HIonPixelTracks750IB", "auther_sha": "13c3732f4fb58e46ff9551598c46f0a3b407a26c", "author": "appeltel", "body": "The purpose of this request is to implement an additional tracking sequence for heavy ion collisions which uses a combination of full (pixel and strip, CKF) tracks and tracks reconstructed from only the pixel detector. This strategy enables the reconstruction of charged particles with reasonable efficiency and low fake rate in high-occupancy PbPb collisions down to pT = 0.3 GeV/c at midrapidity. The current standard heavy ion tracking sequence does not go below pT = 0.5 GeV/c. This additional reach is particularly important for several proposed 2015 analyses. This alternative tracking sequence was first proposed in September at the Tracking POG meeting, see: https://indico.cern.ch/event/334689/contribution/3/material/slides/0.pdf\n\nIn order to implement this sequence, a new pT-dependent chi2 cut is needed in the MutliTrackSelector. A configuration switch is implemented and set to false in the default cfi so that this cut does not affect other tracking reconstruction. Currently, this sequence is not added to the default heavy ion reconstruction sequence, as there may not be sufficient time budget to run this during prompt reconstruction. If additional optimization is not possible, the plan is to run this in a re-reco as soon as possible with the 2015 PbPb collision data.\n\nThis new feature was proposed earlier last year, but was not added as there was a problem due to some \"full tracks\" bypassing cuts because they had over 20 valid hits. This was corrected recently, see: https://indico.cern.ch/event/378287/contribution/2/material/slides/0.pdf\n\nRunning this additional tracking sequence was tested on the 2011 PbPb data and was found to increase overall reconstruction time with current software by 8 percent, see: https://indico.cern.ch/event/393155/contribution/4/material/slides/0.pdf\n\nAlso note that the cut is not implemented in the AnalyticalTrackSelector, which inherits from the MultiTrackSelector. There are many python configurations that configure the AnalyticalTrackSelector directly, so I was hesitant to change the interface. This new cut is hard-coded as false in the AnalyticalTrackSelector so that it is never run and not expected in the configuration.\n", "branch": "CMSSW_7_5_X", "changed_files": 11, "closed_at": "1431345974", "comments": 9, "commits": 4, "created_at": "1431102605", "deletions": 15, "labels": ["comparison-available", "orp-pending", "pending-signatures", "reconstruction-rejected", "tests-approved"], "milestone": "CMSSW_7_5_X", "number": 9017, "release-notes": [], "review_comments": 0, "state": "closed", "title": "New Heavy Ion Tracking Sequence and pT-Dependent Cut for MultiTrackSelector", "updated_at": "1431345986", "user": "appeltel"}