{"additions": 75, "auther_ref": "binary-guids", "auther_sha": "8849191aba7da5aac36c887693aa0e95c6ea96ce", "author": "dan131riley", "body": "#### PR description:\r\n\r\nThe EDM Guid class was derived from POOL source that apparently dates back to the COM/DCE days before UUIDs were standardized and before the general availability of libuuid.  Most of the functionality of the Guid class is now available from libuuid.  This PR\r\n\r\n1) Replaces most of Guid.cc with calls to libuuid (we're linking to it, we might as well use it).\r\n2) Changes the internal representation of the Guid class to the libuuid uuid_t type.\r\n3) Adds an option to load and store an edm Guid as a 16 byte binary string instead of the 32 byte printable representation normally used (std::string can contain null characters so long as c_str() isn't called).\r\n4) Adds an option to use ::uuid_generate_time() to generate UUIDs, and defaults to ::uuid_generate() instead of ::uuid_generate_random().  uuid_generate() defaults to uuid_generate_random(), but has better fallback behavior in the (unlikely) event that /dev/urandom is unavailable.\r\n5) Uses the binary representation for the ProcessGUID stored with every event in the EventAuxiliary record.  An audit of the code shows that we never print the ProcessGUID nor do we otherwise rely on the string representation.\r\n6) Reverses the sense of the '<' comparison operator to match the standard definition (it could probably be removed--I don't think we ever use it).\r\n\r\n#### PR validation:\r\n\r\nA standard limited matrix was run, and the Guid unit test was updated to test the new functionality.", "branch": "master", "changed_files": 7, "closed_at": "1602927862", "comments": 34, "commits": 4, "created_at": "1601658816", "deletions": 92, "labels": ["analysis-approved", "code-checks-approved", "comparison-available", "core-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "e044268f9b7a6f9d8fc0677cc64c4f8d037c621d", "merged_at": "1602927862", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 31658, "release-notes": [], "review_comments": 0, "state": "closed", "title": "use standard libuuid functions, add binary uuid option", "updated_at": "1602927862", "user": "dan131riley"}