{"additions": 82, "auther_ref": "BetterConsumesInterfaceForTrackerHitAssociator", "auther_sha": "4bd8a9264af43d7fe40cb0dc5ebd753ad295c225", "author": "wmtan", "body": "This PR replaces the previous consumes interface for TrackerHitAssociator (implemented in #8647) with a much better interface.  Prior to #8647, each TrackerHitAssociator instance was created and destroyed on a per event per module basis, which guaranteed that each auxiliary structure (e.g. map of PSimHits) were deleted as soon as it was no longer needed.  PR #8647 unfortunately extended the lifetime of each TrackerHitAssociator instance to be the entire job, so that each map needed to be manually deleted.  This is an error prone interface.\nThis new interface restores the lifetime of each TrackerHitAssociator instance to be per module per event, which automatically guarantees that the memory problems will not occur.  The consumes interface is implemented by using a helper class TrackerHitAssociator::Config.  Instances of this helper class do last the entire job, but this helper class does not contain any per event data, so there are no memory issues.\nAlthough this PR needs to be tested, it should be expedited, as use of the consumes interface for other TrackerHitAssociator users (there are many) depends on this PR, and development will be hindered if this is not merged in a timely manner.  I would strongly suggest that L2 signatures be bypassed if not signed in a timely manner, unless, of course, an L2 has issues with this PR.\n", "branch": "CMSSW_7_5_X", "changed_files": 14, "closed_at": "1431330722", "comments": 16, "commits": 1, "created_at": "1431032772", "deletions": 90, "labels": ["comparison-available", "dqm-approved", "fully-signed", "simulation-approved", "tests-approved"], "merge_commit_sha": "68c227fae6f607938e3748766a5de8ec02bfb0a4", "merged_at": "1431330722", "merged_by": "cmsbuild", "milestone": "CMSSW_7_5_X", "number": 8999, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Better consumes interface for TrackerHitAssociator", "updated_at": "1431368862", "user": "wmtan"}