{"additions": 103, "auther_ref": "extended_tables_11_1_X", "auther_sha": "23f4adc3bcef4b6f129c649a430789650d711cbb", "author": "aehart", "body": "#### PR description:\r\n\r\nAddresses issues #30742 and #30744. After discussion with @skinnari and @tomalin, we decided that the tables in the TrackletEngineDisplaced and TripletEngine can be disabled by default. These tables are meant to reduce the occupancy for downstream modules while minimally impacting the ultimate tracking efficiency. This will be necessary for the eventual FPGA design, but given the problems with these tables in terms of memory usage and the effect on tracking efficiency, we think disabling them in the emulation is the best solution for now.\r\n\r\nI also increased the maximum number of tracklets in the case of the extended algorithm. This is a temporary change that is necessary to handle the additional tracklets that will eventually be removed by the now-disabled tables.\r\n\r\nFinally, there are a few other minor changes meant to reduce the memory usage of these tables. Several other changes are foreseen in the near future. But since the tables are disabled by default now, this is somewhat moot for the time being.\r\n\r\n#### PR validation:\r\n\r\nI ran the L1TrackNtupleMaker analyzer over 100 ttbar events with 200 PU. With the baseline, non-extended algorithm, the results are exactly identical, as expected. With the extended algorithm, I see approximately half the memory usage in `top`, and the memory usage does not appear to grow over time as seen before.\r\n\r\nI also ran over a sample of displaced muons with no PU with the extended algorithm. With the tables disabled, as is now the default, we see good efficiency for tracks with d<sub>0</sub> up to ~5 cm.", "branch": "CMSSW_11_1_X", "changed_files": 9, "closed_at": "1596699054", "comments": 31, "commits": 4, "created_at": "1595078416", "deletions": 78, "labels": ["comparison-pending", "l1-pending", "orp-pending", "pending-signatures", "tests-pending"], "milestone": "CMSSW_11_1_X", "number": 30818, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Disabled the TED and TRE tables by default.", "updated_at": "1596699055", "user": "aehart"}