{"additions": 58, "auther_ref": "semiRandomInitL1PSCounter", "auther_sha": "6d1821b2fc79ab54eb01eda20ff66e9fee38f196", "author": "silviodonato", "body": "#### PR description:\r\n\r\nThe standard behavior of the L1 trigger prescaler is to start a counter from the prescale value (eg. 1000) and then reduce it of one unit every time the corresponding L1 trigger is accepted. Once the counter reach 0, the L1 trigger is consider to pass also the L1 prescale, and the counter goes back to the prescale value.\r\nThe counter is reset at the beginning of each lumisection (unless you enable https://github.com/cms-sw/cmssw/pull/37395)\r\n\r\nThis PR adds the option to set the initial prescale value of the PS counter from PS to a semirandom value taken in the range [0, PS]. This option is required to avoid that running on a heavily prescaled sample (eg. ZeroBias) the PS counter never reach 0 and therefore no events pass the prescaler. Starting on a random value, the average rate will be closer to the actual rate that we would see in the actual datataking (at P5 the L1 trigger evaluate a huge number of events per LS).\r\n\r\nThe \"semi-random\" refers to the `std::srand` function which gives a reproducible sequence of random numbers.\r\nHowever the reproducibility is not preserved when running with multithreading because I use also the event number as input of the random number generator.\r\nThe current L1 trigger precaler does not preserve the reproducibility when multi-threading is on.\r\n\r\nThis PR is somehow related to https://github.com/cms-sw/cmssw/pull/37395. \r\n\r\n#### PR validation:\r\n\r\nRunning the prescaler on 3151 events (two LS: 1584 events + 1567 events) on ZeroBias with a prescale of 100 using 16 threads.\r\n\r\nDefault configuration: 8 events passed\r\nIncluding this PR (default): 6 events passed\r\nIncluding this PR (semiRandomInitialPSCounters on): 30 events passed\r\n________________________________________________________\r\nSecond test (same configurations)\r\n\r\nDefault configuration: 4 events passed\r\nIncluding this PR (default): 5 events passed\r\nIncluding this PR (semiRandomInitialPSCounters on): 31 events passed\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nYes, I'd like to have a backport to 12_3_X - although it is not strictly necessary - as it will be used for the first stable beam and therefore for the first HLT menu.\r\nWe use this PR for the HLT rate estimate based on the L1 skim of the ZeroBias dataset.\r\n\r\n", "branch": "master", "changed_files": 4, "closed_at": "1653484041", "comments": 20, "commits": 7, "created_at": "1649420345", "deletions": 4, "labels": ["l1-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "5222b47952a15160dd438f421170741529cc363e", "merged_at": "1653484041", "merged_by": "cmsbuild", "milestone": "CMSSW_12_5_X", "number": 37506, "release-notes": [], "review_comments": 9, "state": "closed", "title": "Semi-random initial value in the L1 trigger prescale counter", "updated_at": "1653484042", "user": "silviodonato"}