{"additions": 450, "auther_ref": "my-hf-strip-filter", "auther_sha": "e8b16e00fda3f089fb04002478d573eedf985f37", "author": "toropin", "body": "#### PR description:\r\n\r\nThis PR is devoted to the development of a new filter HFStripFilter\r\nfor HF RecHits. This work was started when the JetMET group found a\r\nlot of FakJets originated in HF. A careful examination revealed that\r\nthe high-energy hits from these jets have times ~4-6 ns and Ieta\r\nmostly 29-34. This indicated that these hits could be the residual\r\ntails after TDC cuts with QIE10. In Ieta 29-34 the distribution of\r\nsignals in time corresponding to early hits caused by possible PMT\r\nhits are not well separated from the main physical signals and hits\r\nwith ~4-6 ns are probably due to tails from PMT hits (See slide 13\r\nin ref. 1).\r\nThese early hits may be due to muons passing through \"jungle\" of\r\noptical fibers coming from the HF absorbers to PMTs. In this case, we\r\ncan have a sequence of hits in one HF wedge, which can have signals in\r\nboth depths 1 and 2 and have a strip-like structure: sequence of hits\r\nin one wedge and without or with very small signals in adjacent\r\nwedges. Such signals cannot be marked with other HF filters, because\r\nsignals basically have comparable hits in both depths 1 and 2 and PET\r\nand S9S1 HF filters work with hits which have very large signal in one\r\nof depths and very small signal or no signal in another depth.\r\nSo HFStripFilter is looking for strips in HFRecHitCollection and marks\r\nhits in the strips if they were found with special flag which could be\r\nused for further data processing (See first part of report in ref. 2).\r\n\r\nReferences:\r\n1. https://indico.cern.ch/event/800247/contributions/3325296/attachments/1800754/2937107/HFStripFilter_22Feb2019.pdf\r\n2. https://indico.cern.ch/event/807827/contributions/3362430/attachments/1816769/2969579/HFStripFilter_22Mar2019.pdf\r\n\r\n#### PR validation:\r\nThe logs produced by \"runTheMatrix\" script look reasonable. There are few errors in log files, but one error related  to data server  eoscms.cern.ch which appears to be down or unreachable (cmsdev31.cern.ch). Some other workflows with errors have DAS_ERROR status which is also unrelated to this PR.\r\n\r\nIn attached Screenshots you can see pictures of EvenrDisplay (FireWorks) with HF rechits after reconstruction procedure. In column 'flags' you can see the upper 2 hits in table belonging to strip have values 1048640 (set bits 6, 20). Bit6 is new flag HcalPhase1FlagLabels::HFAnomalousHit). \r\n<img width=\"1201\" alt=\"Screenshot 2019-03-25 at 17 21 55\" src=\"https://user-images.githubusercontent.com/7665869/54983371-f8e16100-4fac-11e9-897c-c391d8a166ee.png\">\r\n<img width=\"1200\" alt=\"Screenshot 2019-03-25 at 17 18 58\" src=\"https://user-images.githubusercontent.com/7665869/54983400-04cd2300-4fad-11e9-9bbd-3daa3fc71d45.png\">\r\n", "branch": "master", "changed_files": 8, "closed_at": "1554488493", "comments": 56, "commits": 19, "created_at": "1553587583", "deletions": 7, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "fb478a3d5ba1ed6159d18b025edaed00b2166b6e", "merged_at": "1554488493", "merged_by": "cmsbuild", "milestone": "CMSSW_10_6_X", "number": 26251, "release-notes": [], "review_comments": 15, "state": "closed", "title": "HFStripFilter for Run 2 data", "updated_at": "1554488493", "user": "toropin"}