{"additions": 6, "auther_ref": "L1TCaloSummaryMemoryLeakFix", "auther_sha": "14b494a747a84010e302fbbd2582f2d722ea9f4f", "author": "aloeliger", "body": "#### PR description:\r\n\r\nL1TCaloSummary has a memory leak in it's created UCTSummaryCard. It would attempt to clear the associated UCTRegions on every event, which calls a `std::vector` `.clear()`, which would clear the vector contents, but not free the memory associated with the added UCTRegions. Peak memory usage on a single RAW file could be double post-fix memory usage due to abandoned regions. \r\n\r\nBecause the UCTSummaryCard properly cleans up the UCTRegions when doing it's destructor tasks (and expects to do the deletion, preventing deleting the regions by hand), I have made the summary card allocated per event, and then deleted at the end of the event.\r\n\r\n#### PR validation:\r\n\r\nDue to this emulator not being associated with any standard workflows yet, no changes are expected to standard workflows, and they are not useful in validation. All code compiles, and has had code formatting applied. I have verified that this module is capable of running on RAW files without segfaulting or otherwise breaking.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport.\r\n", "branch": "master", "changed_files": 1, "closed_at": "1677229570", "comments": 9, "commits": 2, "created_at": "1675950337", "deletions": 10, "labels": ["l1-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "cb3e8bb935202aea1ceb4272473c6eb376dc36b7", "merged_at": "1677229570", "merged_by": "cmsbuild", "milestone": "CMSSW_13_1_X", "number": 40735, "release-notes": [], "review_comments": 3, "state": "closed", "title": "Fix L1TCaloSummary memory leak in UCTSummaryCard related to UCTRegion", "updated_at": "1677229571", "user": "aloeliger"}