{"additions": 178, "auther_ref": "12X-unique_ptr_fix", "auther_sha": "8c552868528016a76a3fb3f058a011583de78602", "author": "smorovic", "body": "\r\n\r\n#### PR description:\r\n\r\n- raw (FRD) file format for DAQ3 has recently been modified to include metadata in the header, so json files can be removed (due to 2 MB block constraint in huge-page ramdisk). Initially support was added with file broker mode. Now it is added to the file-locking mode which is used in testing and in Hilton.\r\n- Support for the file header is also added to the single-buffer mode.\r\n- Error handling in file locking mode is improved. It also allows unit test to catch problem in case JSON (raw) files can not be found. Since throwing exception is an issue in separate file discovery thread used by input source, error condition is propagated to the main thread instead of throwing directly.\r\n\r\nPR includes also two bug fixes:\r\n - unique_ptr release() calls do not execute destructor of allocated object wrapped with unique_ptr. This created a (small) memory leak and also caused processed files to not be deleted in single-threaded input source mode (which is available, but not used by default in production setup).\r\n\r\n - in the check of non-opened fd value comparision was with 0, it should be compared with -1.\r\n\r\n#### PR validation:\r\n\r\nVerified to work correctly in DAQ test system in single-buffered/multi-buffered running modes, with file broker/locking, and with/without file header (and combinations).\r\n\r\n\r\n", "branch": "master", "changed_files": 3, "closed_at": "1592286975", "comments": 14, "commits": 5, "created_at": "1591944597", "deletions": 76, "labels": ["code-checks-approved", "comparison-available", "daq-approved", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "733b9a672a62f26fe1fa2410c3323b291694d787", "merged_at": "1592286975", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 30206, "release-notes": [], "review_comments": 0, "state": "closed", "title": "DAQ: support for FRD file header with file locking", "updated_at": "1592286975", "user": "smorovic"}