{"additions": 1678, "auther_ref": "rpc_digi_dev_v9", "auther_sha": "3ed0563825147d8a407aec66bfc9751880c3bd6d", "author": "bapavlov", "body": "#### PR description:\r\n\r\nWe would like to introduce some new code for the RPC Phase 2 upgrade.\r\nSo far, the digitization for both the currently installed RPCs and the ones planned for the Phase 2 upgrade have used the same data format, which was developed for the Muon upgrade TDR. However, this format is no longer adequate due to the changes planned for the RPC Phase 2 upgrade.\r\nIn short, the RPC Phase 2 upgrade includes two major changes:\r\n\r\n-  Improved readout electronics for all currently installed RPCs, allowing for more precise timing measurements.\r\n-  Installation of a new type of RPCs, called iRPCs (an abbreviation for improved RPC), in the endcap stations RE3/1 and RE4/1.\r\n\r\nWe would like to introduce these changes into the software as well. We will keep the current digi format intact, but we plan to add two additional digi formats, called RPCDigiPhase2 and IRPCDigi. Below is a brief description of the proposed changes:\r\n\r\n- The readout of signals from all existing RPCs will be modified. Currently, the signal is digitized with a 40 MHz clock, corresponding to exactly 1 Bunch Crossing (BX) or a 25 ns time interval. After the Phase 2 upgrade, the RPCs will be read out with a much finer clock, allowing for sub-BX resolution. Thus, we aim to add a new data format for the RPC Phase 2 upgrade that enables sub-BX resolution. The new digi format is DataFormats/RPCDigi/interface/RPCDigiPhase2.h\r\n- In addition, the new iRPCs (improved RPCs) will be introduced in the CMS endcaps. The major difference between RPCs and iRPCs is that iRPC strips will be read out from both ends, allowing precise estimation of the muon impact point on the strip and very accurate time measurement. We have also prepared a new format for iRPCs, and the code DataFormats/IRPCDigi\r\n- We will keep the current digitization code intact, but we would like to add a digitization code for the Phase 2 RPC upgrade and iRPCs. The code is available here SimMuon/RPCDigitizer\r\n\r\n\r\n\r\n#### PR validation:\r\n\r\nAt the moment, our colleagues are using the code from my repository and are developing the code for the next steps (e.g., trigger emulators). The code is tested and works as expected. Results have been reported during several RPC DPG and RPC Trigger meetings:\r\n[RPC DPG May 8, 2024](https://indico.cern.ch/event/1414492/contributions/5944242/attachments/2852911/4988620/RPC_20240508.pdf)\r\n[RPC Trigger Oct 2, 2024](https://indico.cern.ch/event/1462637/contributions/6158183/attachments/2939082/5162993/RPC_20241002.pdf)\r\n[RPC DPG Jan 22, 2025](https://indico.cern.ch/event/1505512/contributions/6337280/attachments/3000795/5287920/RPC_Simulation_DPG_20250122_v0.pdf)\r\n[RPC DPG Feb 5, 2025](https://indico.cern.ch/event/1510255/contributions/6355924/attachments/3009406/5305569/RPC_Simulation_DPG_20250205_v0.pdf)\r\n\r\nI would like to emphasize again that we have taken special care not to interfere with the present simulation in any way.\r\n\r\n \r\n\r\n", "branch": "master", "changed_files": 41, "comments": 35, "commits": 4, "created_at": "1740485223", "deletions": 34, "labels": ["simulation-pending", "core-pending", "operations-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved", "changes-dataformats"], "milestone": "CMSSW_15_1_X", "number": 47447, "release-notes": [], "review_comments": 0, "state": "open", "title": "Rpc digi dev v9", "updated_at": "1757480149", "user": "bapavlov"}