{"additions": 352, "auther_ref": "utmReinterpretCastFix", "auther_sha": "998ad837b014780a1937cbf39ac2c810cfefe604", "author": "aloeliger", "body": "### PR description:\r\n\r\nThis PR changes L1TGlobal code and CondFormats to remove three instances of `reinterpret_cast` (one in `L1TUtmTriggerMenuESProducer`, and two in `TriggerMenuParser`) that were attempting to reinterpret pointers of [utm Trigger Menu code/objects](https://gitlab.cern.ch/arnold/utm) to CMSSW `L1TUtm` objects (with undefined behavior). To achieve this, constructors were added to equivalent `L1TUtm` objects that can accept firmware `utm/es` objects and create exact (or at the least, more _defined_) copies by copying values. These `L1TUtm` objects should now be used with preference in CMSSW and across L1TGlobal code.\r\n\r\nThis code _**should not**_ produce any change in global trigger results. Any change in trigger results is incorrect and should not be merged.\r\n\r\nThese changes were requested in review of https://github.com/cms-sw/cmsdist/pull/8352 and may address an issue seen in the testing of that PR. Regardless of whether it fixes that issue, these changes were requested.\r\n\r\nThese changes should in theory close https://github.com/cms-sw/cmssw/issues/30819\r\n\r\n@elfontan I figured you might like to be kept apprised of these changes.\r\n\r\n### PR validation:\r\n\r\nAll code compiles, and passes all unit tests, with special attention paid to the `testL1TGlobalProducer`, which produces identical results. Run the matrix seems to produce reasonable output. I have also confirmed (using print statements) that the now copied-by-value `L1TUtmTriggerMenu` members should be entirely identical to the `L1TUtmTriggerMenu` produced previously by `reinterpret_cast`\r\n\r\n### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport. This PR may need to be backported to 13_0 to match the corresponding utm firmware update backport, if this PR solves the issue seen in https://github.com/cms-sw/cmsdist/pull/8352. @epalencia may be able to clarify if that is necessary.\r\n", "branch": "master", "changed_files": 14, "closed_at": "1679571966", "comments": 57, "commits": 1, "created_at": "1678493546", "deletions": 166, "labels": ["alca-approved", "dqm-approved", "l1-approved", "fully-signed", "tests-approved", "db-approved", "orp-approved", "requires-external", "code-checks-approved", "l1t"], "merge_commit_sha": "c4381d1a630f57af0f9d969a0d7fcfeee230f88d", "merged_at": "1679571966", "merged_by": "cmsbuild", "milestone": "CMSSW_13_1_X", "number": 41036, "release-notes": [], "review_comments": 25, "state": "closed", "title": "Modify L1TGlobal menu code and CondFormats to remove reinterpret_cast to and from utm firmware \"es\" types", "updated_at": "1679571966", "user": "aloeliger"}