{"additions": 5640, "auther_ref": "pfblockalgo_rebuild_rebased", "auther_sha": "0d04c5bca3cf91278d09be52d1d4e082f9d3fcb0", "author": "lgray", "body": "This pull request contains the implementation of a modularized version of PFBlockAlgo and the branch is based on CMSSW_7_1_X_2014-04-24-1400.\nThe block elements and links between elements in a block have been confirmed to be exactly the same as those from the original PFBlockAlgo. However, the order of elements within a block has changed.\n\nThis exposed some element order dependencies (minor bugs) within downstream PF-reconstructions (PFAlgo/PFEGammaAlgo) that result is slight regressions, including the creation of new PFCandidates, with respect the reconstruction using the original implementation of PFBlockAlgo.\nThere is a 20-30% speed up in PFBlockAlgo, depending on PU scenario.\n\nI was able to reproduce similar regressions in the old PFBlockAlgo by forcing arbitrary element sorting.\n\nTesting in wf25202.0, 710_pre5, I observed minor jitter in the jet/MET, charged hadron, neutral hadron, and photon energy, but there was no trend in migrations. I did not observe any changes in PFEGamma objects once the bugfix from #3348 was applied to the base release, but small changes at lower rate than the previously described jitter can be expected.\n\nThis PR will require additional commits later from Martin to reflect updates in confdb for HLT.\n\nOrder of magnitude rate guesses for regressions are:\nO(1-2 events in 100 see some jitter)\nO(1 new PFCandidate or candidate change per few thousand PFCandidates)\n", "branch": "CMSSW_7_1_X", "changed_files": 87, "closed_at": "1398453662", "comments": 52, "commits": 16, "created_at": "1397735765", "deletions": 4511, "labels": ["comparison-pending", "dqm-pending", "hlt-approved", "pending-signatures", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "e22649ef0c832801dadf153440591405c2bcc152", "merged_at": "1398453662", "merged_by": "ktf", "milestone": "CMSSW_7_1_0_pre7", "number": 3385, "release-notes": [], "review_comments": 9, "state": "closed", "title": "Rewrite/Refactor of PFBlockAlgo", "updated_at": "1404279576", "user": "lgray"}