{"additions": 63, "auther_ref": "SimulatedBadChannelInfoPackedIntoRAW_10_4_0_v1", "auther_sha": "3f89ec10bab5a3cffccaf4d2aafb3da5b7de1b64", "author": "veszpv", "body": "This is the follow-up of the PR:\r\nhttps://github.com/cms-sw/cmssw/pull/25466\r\nin which simulation of bad components grouped by FED channels, randomly chosen from a collision data-driven set of configurations, were introduced.\r\n\r\nReminder: the killing of digis happens in the digitizer during simulation. The digitizer places a list of killed channels into the event in order for the tracking to be able to inactivate rechits in the empty modules. In real collisions, the FED FW generates an error code 25 associated to the channel from which no response is received upon a trigger (e.g. the module is turned off or the TBM gets stuck). The RawToDigi module unpacks these errors and places a list of bad channels into the event for tracking. In PR25466, the RawToDigi step replaced the default empty channel list output with the list from the digitizer.\r\n\r\nIn this PR, the channel list prepared by the digitizer is packed into the simulated FEDRawData, so that the unpacker do not need to handle simulation differently from data. By default, the bad channel simulation is turned off (in the digitizer config), no FED error 25 is simulated, and the unpacker produces an empty bad channel list.\r\n\r\nValidation was done to check that the channel list produced by the unpacker agrees with the one from the digitizer, and running the same events before and after this modification to 10_4_0 with the feature turned on, the same number of clusters are created.\r\n\r\n@mmusich @tsusa ", "branch": "master", "changed_files": 6, "comments": 14, "commits": 5, "created_at": "1548252848", "deletions": 36, "labels": ["code-checks-approved", "comparison-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-approved"], "milestone": "CMSSW_10_5_X", "number": 25748, "release-notes": [], "review_comments": 0, "state": "open", "title": "Pixel simulated bad channel info packed into FED raw data", "updated_at": "1548421509", "user": "veszpv"}