{"additions": 28, "auther_ref": "jc_fix_lhcInfoPerLS_duringFill_startSampleTime", "auther_sha": "65c5120a35c35e5fe2011b7b1d6996ae1bc68e2b", "author": "CTPPS", "body": "#### PR description:\r\n\r\nFixes a bug that made the `LHCInfoPerLS` PopCon in duringFill mode write a payload from outside of the currently processed fill. The error occurred when at PopCon execution there was already a payload from this fill in the destination tag and the fill was still ongoing. \r\n\r\nThe error was caused by converting the IOV of the last payload of the tag to an invalid time value because duringFill mode uses IOVs of type `lumiid` and not timestamp. Conversion from lumiid to time using cond::to_boost is invalid. The faulty line:\r\n```\r\nstartSampleTime = cond::time::to_boost(lastSince);\r\n```\r\n\r\nThe PR also introduces `debugLogic` argument to the `LHCInfoPerLS` PopCon allowing for simple tests of the duringFill mode even when there is no ongoing stable beams fill in LHC. While the capability of such tests is limited the `debugLogic`  mode allowed reproducing of the error regardless of the LHC state.\r\n\r\n#### PR validation:\r\n\r\nTested in debugLogic mode and in production mode during stable beam fills. \r\n\r\nThe `debugLogic = True` tests were conducted by preparing an SQLite file with a payload from the fill 9400 (which was not the last LS) and checking if PopCon correctly appended the last LS of this fill to the tag. \r\n\r\nThe production logic tests were conducted by manually running the PopCon multiple times throughout fills 9475 9496 and 9497. The correct behavior of the PopCon was confirmed in the logs and by validating the IOVs and data of produced payloads (cross-checking with PPS dB). \r\n\r\n\r\n### Backport\r\n\r\nThe `LHCInfoPerLS` PopCon in `duringFill` mode is currently deployed for testing on CMSSW_14_0_2\r\nTODO: do we need to backport it to this release?", "branch": "master", "changed_files": 2, "comments": 8, "commits": 1, "created_at": "1713019901", "deletions": 20, "labels": ["db-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_14_1_X", "number": 44732, "release-notes": [], "review_comments": 0, "state": "open", "title": "Fix LHCInfoPerLS PopCon duringFill startSampleTime error", "updated_at": "1713776988", "user": "JanChyczynski"}