{"additions": 29, "auther_ref": "VertexFitMuonSystem", "auther_sha": "4d2f049e751e7fd0dcddd11ca7a5c379ead4c453", "author": "steggema", "body": "#### PR description:\r\n\r\nProblem addressed: In EXO long-lived analyses, it was observed that using CMSSW vertex fitting code to reconstruct the decay vertex of resonances decaying beyond around 300 cm had much worse efficiency than for lower values, and the covariance matrix entries remained at their default values.\r\n\r\nThis was identified as coming from an issue in the fitting code when the sign of the magnetic field switches sign between two extrapolated track states. A report given in the context of the related Muon POG studies can be found here: https://indico.cern.ch/event/1220371/#6-dsa-vertex-inefficiency-stud\r\nAnother report will be given at a tracking POG meeting: https://indico.cern.ch/event/1232392/\r\n\r\nThe PR also includes a minimal change to the SequentialVertexFitter such that user code can update the boundaries in which the fit is considered valid. Up to now, users were updating these hard-coded values manually. We leave more involved updates (like taking the default values from a database or making it configurable at the EDProducer level) to future studies.\r\n\r\nChanges to output: No changes to outputs are expected since this PR only affects the special use case of searches for long-lived particles using the CMSSW vertex fitting code to reconstruct secondary vertices outside of the inner tracker.\r\n\r\nOther PRs: There is no interference with other PRs that we are aware of.\r\n\r\n#### PR validation:\r\n\r\nThe proposed fixes lead to a large increase of efficiency for vertex fits beyond around 300 cm, and also to reasonable values of the covariance matrix entries, as reported in the slides above.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNot a backport.\r\n\r\n@annamasce @jalimena @aescalante \r\n", "branch": "master", "changed_files": 4, "comments": 7, "commits": 3, "created_at": "1673445679", "deletions": 11, "labels": ["reconstruction-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "tracking-pog-pending", "tracking"], "milestone": "CMSSW_13_0_X", "number": 40479, "release-notes": [], "review_comments": 0, "state": "open", "title": "Fixes for vertex fits in the muon system", "updated_at": "1673519968", "user": "steggema"}