{"additions": 1004, "auther_ref": "from-CMSSW_12_0_X_2021-07-18-0000-new-GEM-CSC-matching-classes-v2", "auther_sha": "c9358f14e7adc402794f90f94bf45778b7c18b04", "author": "dildick", "body": "#### PR description:\r\n\r\nThis PR puts in place the missing pieces for the GEM-CSC trigger for Run-3\r\n* I removed `CSCUpgradeMotherboard`, and absorbed `CSCGEMMotherboardME11` and `CSCGEMMotherboardME21` into `CSCGEMMotherboard`. There are now just two motherboards remaining (`CSCMotherboard` and `CSCGEMMotherboard`) down from 6. The old GEM processor (`GEMCoPadProcessor`) and an obsolete lookup table class `CSCUpgradeMotherboardLUT` were deleted.\r\n* This massive reduction in number of classes makes the `CSCTriggerPrimitivesBuilder` a lot simpler. \r\n* The GEM-to-CSC matching is now CSC-central, that is: GEM coordinates (pad, roll) are translated into key halfstrip and key wiregroup. It is used to be GEM-central, but there is no latency in the trigger to do these operations. For all coordinate translations, we rely on `CSCLUTReader` and LUTs in https://github.com/cms-data/L1Trigger-CSCTriggerPrimitives/tree/master/GEMCSC/CoordinateConversion. \r\n* Matching in a chamber in a BX is first attempted for ALCT-CLCT-GEM, then CLCT-2GEM, then ALCT-2GEM. ALCT-CLCT type LCTs are not rejected if there are no matching GEMs.\r\n* The GE2/1-ME2/1 integrated local trigger is not supported for D41 or D49 geometries with 8 eta partitions. Only the GE2/1 geometry with 16 eta partitions is supported. I tested it with a D76 geometry which works well.\r\n* The matching is still based on difference in half-strip. Soon, we'll change that to incorporate the CCLUT slope. The halfstrip windows are set to be >98% efficient for pT > 5 GeV muons. I suppose this could be lowered further to pT > 3 GeV.\r\n* Quality control tests were expanded for the new GEM-CSC trigger primitives. Though I did delete the QC in `CSCMuonPortCard`. After all, the QC class is designed to operate on a single (O)TMB, rather than on an entire endcap trigger sector. \r\n* The `GEMInternalCluster` class members are properly initialized in the constructor. \r\n\r\nFollow-up of https://github.com/cms-sw/cmssw/pull/34513, https://github.com/cms-sw/cmssw/pull/33974 and https://github.com/cms-sw/cmssw/pull/33570. \r\n\r\nDocumentation is being compiled in a detector note (should be ready by end of the Summer).\r\n\r\n#### PR validation:\r\n\r\nTested the code so far on `/RelValSingleMuPt10/CMSSW_11_3_0-113X_mcRun4_realistic_v7_2026D76noPU-v1/GEN-SIM-DIGI-RAW`. A few efficiency plots are added below. \r\n\r\nEfficiency is ~98% in ME1/1 across the eta range. Efficiency is ~98% in ME2/1 across the eta range, except for near |eta|~1.8 and 2.05 where the high voltage drops. This drop can be mitigated if the number of layers on an ALCT is reduced to 3. However, because the backgrounds in Phase-2 not well understood I am keeping the number of layers to at least 4.\r\n\r\nI ran interactively on a few thousand events. I did not see any LogWarnings from the `LCTQualityControl` class about potentially invalid ALCTs, CLCTs or LCTs.\r\n\r\nI'll also check the performance on PU200, but that should be largely unaffected.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nN/A\r\n\r\nBefore submitting your pull requests, make sure you followed this checklist:\r\n- verify that the PR is really intended for the chosen branch\r\n- verify that changes follow [CMS Naming, Coding, And Style Rules](http://cms-sw.github.io/cms_coding_rules.html)\r\n- verify that the PR passes the basic test procedure suggested in the [CMSSW PR instructions](https://cms-sw.github.io/PRWorkflow.html)\r\n\r\nFYI @tahuang1991 @rathjd", "branch": "master", "changed_files": 32, "closed_at": "1627054797", "comments": 29, "commits": 11, "created_at": "1626912603", "deletions": 4177, "labels": ["code-checks-approved", "dqm-approved", "fully-signed", "l1-approved", "orp-approved", "tests-approved"], "merge_commit_sha": "ca5f3a59eccb2bdfc7c29b863c5a9f64d88e901f", "merged_at": "1627054796", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 34582, "release-notes": [], "review_comments": 0, "state": "closed", "title": "GEM-CSC Trigger for Run-3", "updated_at": "1627054797", "user": "dildick"}