{"additions": 88, "auther_ref": "propagation_forPR", "auther_sha": "0a1dd5315eab746c5323bfcd1b1351ac85c29068", "author": "JanFSchulte", "body": "This PR improves the matching of L3 and L1 candidates in filters in the Muon HLT in two ways:\r\n\r\n- For L3/L1 matching, the L3 muon is now propagated to the second muon station, since L1 parameters are defined there. This improves matching efficiency for very low pT muons. This change has negligible impact on overall HLT performance. Total HLT rate is virtually unchange (0.04% increase). Timing is virtually unchange as well, despite the added propagation (black is without, red is with the propagation)\r\n![image](https://user-images.githubusercontent.com/4459228/155994255-d26642c6-4de2-4d43-8d19-31780ec4ff6e.png)\r\n\r\n- In HLTMuonL1TFilter a match between L1 muons before and after different filters is performed. Currently the code expects the muons that are compared to be in the same collection. However, there are use cases in the current menu where the matching is performed with a copy of the L1 muon collection and thus always fails. This causes an inefficiency for low pT muons that are reconstructed only by L1-seeded reconstruction steps. Impact is mostly negligible, showing tiny efficiency improvements for high-pT muon from the Z:\r\n ![image](https://user-images.githubusercontent.com/4459228/155995310-c31a98e0-a8eb-420e-af7f-cbe2f5265f65.png)\r\n\r\nEffect gets more visible for lower pT muons, for example in the turnon of the double-muon trigger:\r\n![image](https://user-images.githubusercontent.com/4459228/155995381-ca6abbe6-33ce-4fef-8d4b-4d408e7b34dc.png)\r\n \r\nHowever, the effect is significant for very low pT leptons. For the muon Bs -> mumu trigger (HLT_DoubleMu4_3_Bs_v14) we find a ~20% improvement of HLT efficiency on a sample of signal events provided by BPH.  \r\n", "branch": "master", "changed_files": 10, "closed_at": "1646156324", "comments": 5, "commits": 2, "created_at": "1646053211", "deletions": 8, "labels": ["hlt-pending", "pending-signatures", "tests-rejected", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_12_3_X", "number": 37086, "release-notes": [], "review_comments": 5, "state": "closed", "title": "Fixes for L3 and L1 trigger object matching in Muon HLT", "updated_at": "1646156324", "user": "JanFSchulte"}