{"additions": 103733, "auther_ref": "TICL_withTilesAndFractions", "auther_sha": "182594d1861453a273cb2a1b79d41b86ac779418", "author": "rovere", "body": "#### PR description:\r\n\r\n##### TICL Reorganization\r\n\r\nSeveral changes entered this PR.\r\n    \r\n  * The data structures used by TICL have been moved into\r\n      DataFormats/TICL, that has to be added as a CMSSW package.\r\n      Tracksters and Tile are currently present. The encapsulation of\r\n      std::array as a transient data member of a Tile is due to the fact\r\n      that ROOT natively supports those and refuses to create ad-hoc\r\n      dictionaries. Moreover, at present, an std::array cannot sit at the\r\n      top of a ROOT branch requiring, once again, its encapsulation.\r\n  * The \"master Tile\" has been added as a single producer. A unique Tile\r\n      containing all the 2D reconstructed clusters is created once and put\r\n      into the Event. All iterations will fetch it from the event and mask\r\n      the 2D clusters on the fly. This required also some changes to the\r\n      clusters filters logic. Now the filters produce also a vector<float>\r\n      that represents the result of merging their input mask with their\r\n      own selection. TICL iterations will make use of the filter's\r\n      vector<float> to dynamically mask clusters from the \"master Tile\".\r\n  * The fractions have been added to the Tracksters. The sharing of the\r\n      energy of 2D clusters is flat and based on their multiplicity, i.e,\r\n      a fraction of energy/multiplicity is assigned to all Tracksters that\r\n      use the 2D clusters. Better splitting algorithms can be studies or\r\n      Machine Learning techniques could be put at work here.\r\n  * The hits and fraction of the Trackster are now correctly populated.\r\n      This required an additional loop over the components of each 2D\r\n      cluster. In the future the CaloCluster, PFCluster and hits and\r\n      fractions data structures could be reviewed or, at least, TICL could\r\n      use some other, more efficient, internal data representation and\r\n      collapse into the legacy ones only at the very last stage.\r\n\r\n#### PR validation:\r\n\r\n`runTheMatrix.py -l limited -i all -j 4`\r\n\r\nand other samples.\r\n\r\n**Note to the reviewers**: all changes in `RecoLocalCalo/HGCalRecAlgos` are purely due to the code-format. No other changes have been committed there. I did so so that PR #26991 could be closed (if and when this PR gets merged)", "branch": "master", "changed_files": 1197, "closed_at": "1560233436", "comments": 52, "commits": 248, "created_at": "1559285383", "deletions": 92713, "labels": ["alca-pending", "analysis-pending", "code-checks-approved", "comparison-pending", "core-pending", "db-pending", "dqm-pending", "generators-pending", "geometry-pending", "l1-pending", "new-package-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "simulation-pending", "tests-pending", "upgrade-pending", "xpog-pending"], "milestone": "CMSSW_11_0_X", "number": 27026, "release-notes": [], "review_comments": 20, "state": "closed", "title": "TICL Reorganisation", "updated_at": "1560233820", "user": "rovere"}