{"additions": 1430, "auther_ref": "particlenet_monitoring_integration", "auther_sha": "f77cb4f8977fafba9c61a38954db27e2f281ef93", "author": "rgerosa", "body": "Dear All,\r\n\r\n**Description**\r\n\r\nthis PR is meant to integrate in CMSSW a DQM workflow for monitoring the efficiency of AK4 and AK8 ParticleNet taggers at HLT with respect to their offline implementation. Having such monitor is important to assess the stability of the performance of the new triggers implemented for run3 dedicated to HH4b and boosted Hbb topologies. This PR contains a new DQM producer called ParticleJetTagMonitor.cc that handles the efficiency computation (definition of numerator and denominator) in the following way:\r\n\r\na) For AK4 PNET b-tagging, an enriched sample in ttbar emu events are selected offline requiring a emu-pair and at least 2 central jets with offline PNET b-tagging score above a certain threshold. These events are used to assess the HLT PNET efficiency by taking the ratio between these two triggers (already present in the current HLT men for both data and MC): HLT_Mu8_TrkIsoVVL_Ele23_CaloIdL_TrackIdL_IsoVL_DZ_PFDiJet30_v and HLT_Mu8_TrkIsoVVL_Ele23_CaloIdL_TrackIdL_IsoVL_DZ_PFDiJet30_PFBTagParticleNet_2BTagSum0p65_v\r\n\r\nb) For AK8 PNET H(bb)-tagging, given that an enriched control sample of boosted H(bb) jets cannot be isolated in data with a good purity, the measurement is performed in a sample of boosted ttbar semi-leptonic events selected offline requiring one isolated lepton (muon or electron), at least two b-tagged central jets, and one AK8 jet not-in-overlap with the leptons with certain pT, soft-drop-mass, and offline PNET AK8 Hbb score. The efficiency is then measured by the ratio of these triggers: denominator [HLT_IsoMu50_AK8PFJet230_SoftDropMass40_v, HLT_Ele50_CaloIdVT_GsfTrkIdT_AK8PFJet230_SoftDropMass40_v], numerator [HLT_IsoMu50_AK8PFJet230_SoftDropMass40_PFAK8ParticleNetBB0p35_v, HLT_Ele50_CaloIdVT_GsfTrkIdT_AK8PFJet230_SoftDropMass40_PFAK8ParticleNetBB0p35_v]\r\n\r\n**Backport** \r\n\r\nOnce approved, we will need a backport to the release cycles used in the T0 operation for first Run3 collisions (124X and maybe 123X)\r\n\r\n**Validation:** \r\n\r\nwe verified that the workflow works by re-emulating the HLT on MC and Data events as described here [0], then re-running the RECO+DQM and Harvesting steps.\r\n\r\n[0] https://twiki.cern.ch/twiki/bin/viewauth/CMS/HLTValidationAndDQM\r\n\r\n**Caveats:**\r\n\r\n1) In order to perform the measurement of the trigger efficiency in the most robust way, we would need to match the offline jets passing the selection (leading PNET score jets) with those present at the trigger level. This can be performed in the Validation workflow by adding the PNET valueMaps for the score in the HLT event content (as expressed in HLTrigger_EventContent_cff.py). However we are not sure this can be performed when the prompt-reco is run at T0 hence, if this HLT collections won't be present, we would need to remove this matching by changing the value of requireHLTOfflineJetMatching in ParticleNetJetTagMonitoring_cfi.py\r\n\r\n2) We would like to select events offline on the basis of the offline PNET in order to minimise misalignments between online and offline. However, currently, PNET AK4 and AK8 are not inferred in the RECO step but only in the MINIAOD/NanoAOD one. Hence, we modified the RecoBTag sequence in order to infere AK8 and AK4 PNET. However, in order to gain speed, we restrict the inference of the AK4 network only to jets with |eta|<2.5 and pT > 25 GeV while, in miniAOD no eta-boundaries are applied and inference runs for all jets above 10 GeV. We hope this can be a good compromise and can cope with the constraints of the standard reconstruction.\r\n", "branch": "master", "changed_files": 9, "closed_at": "1660000768", "comments": 35, "commits": 5, "created_at": "1657866581", "deletions": 4, "labels": ["dqm-approved", "l1-approved", "reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "btv"], "merge_commit_sha": "f018e4991aa45a568a1f05fb4a37c095ec411e8f", "merged_at": "1660000768", "merged_by": "cmsbuild", "milestone": "CMSSW_12_5_X", "number": 38748, "release-notes": [], "review_comments": 9, "state": "closed", "title": "Integration of ParticleNET-HLT AK4 and AK8 DQM Monitoring", "updated_at": "1660000768", "user": "rgerosa"}