{"additions": 2648, "auther_ref": "VertexSmearing", "auther_sha": "40ac519aaf4dd1e7b5a86e73668be491015c4b46", "author": "wmtan", "body": "Yes, I know this PR is too huge to be visible in github, but it is not easily separable into independent chunks. I would be happy to break it up into separate pieces if there was some way to guarantee that they all get tested and merged at once. Most of the modifications are small changes to python config files.\n\nCurrently, a HepMCProduct object gets put into the event by the generator, and modified in place by a vertex smearer. This is not thread safe, and it violates the principle of modular design. This PR creates a new EVENTVERTEXGENERATOR plugin type for the vertex smearers, and runs the smearers inside the generators in almost all cases.  These smearers can also be run inside a new separate EDProducer, \"EventVertexProducer\", which is done in those configuration files where the smearer was run without the generator.  Virtually all such configuration files were unit tests.\n\nThe alternative of running the smearers in separate producers for production  was rejected because it would cause two copies of each HepMCProduct to go into each event, and every module that reads HepMCProduct would have to be modified to read the correct one,  It would be virtually impossible to get that right in every case.  The chosen implementation ensures that there is still only one HepMCProduct in each event, and that its label (used by getByLabel or getByToken) is unchanged.\n", "branch": "CMSSW_7_6_X", "changed_files": 963, "closed_at": "1439995622", "comments": 15, "commits": 1, "created_at": "1438887960", "deletions": 1953, "labels": ["comparison-available", "generators-pending", "orp-pending", "pending-signatures", "reconstruction-rejected", "tests-approved"], "milestone": "CMSSW_7_6_X", "number": 10610, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Do not modify HepMCProduct in place. It's not thread safe.", "updated_at": "1444144498", "user": "wmtan"}