{"additions": 123, "auther_ref": "EF_uGT_fixHMT", "auther_sha": "29ecd54f381cef5cd361d882d8bfc9267cdf56ee", "author": "elfontan", "body": "#### PR description:\r\nThe purpose of this PR is to address multiple issues at the GT level related to the muon shower emulation. Here two main items are discussed:\r\n1) **uGT emulation of HMT**\r\n2) **DQM mismatches** \r\n\r\nThanks @eyigitba for the work and the discussion. \r\n\r\n\r\n1) **uGT emulation of HMT**\r\nThe MuonShowerCondition class was broken and was not evaluating at all the condition: this PR contains a first iteration of updates to get reasonable results (with a proper check of the condition for all HMT cases, able to distinguish between Nominal and Tight showers). \r\n\r\nSummary of the main issues:\r\n- The checkObjectParameter function responsible for the check of the muon shower bit for each condition was never called in the class.\r\n- The vector of candidates in MuonShowerCondition (_int numberObjects = candVec->size(useBx)_) was returning four objects (as supposed to be given the splitting in four separate muon shower objects in the Global Board), but we never compare them one by one to the MuonShowerTemplate. For each condition, we should compare each object to the template to make sure one of them passes. All four objects are exclusive in which bits are set to true.\r\n- The declaration of the four muon shower objects in the GlobalBoard was wrong: without having them declared as pointers, they were not passed correctly to the MuonShowerCondition (that was receiving random objects).\r\n\r\n\r\nOpen items:\r\n- At the moment, the class is checking only the central BX: _ReceiveMuonShowerObjectData_ is only looking at BX0. However, we can have showers in other BXs, too (as we saw last year with muon showers before fixing the timing). This has to be included.\r\n- In the L1Ntuple workflow running on 1000 events using run 362720 (find the cmsDriver command below), 2 additional events with a nominal shower are found, and five of those events fire for a tight shower (when we would expect a nominal shower only). No mismatch when running the DQM with the below fix. Most likely it is an issue with the EMTF Muon Showers. [Follow up with @eyigitba needed.]\r\n\r\nValidation: \r\n- L1 emulation run using the L1Ntuples worflow and checking the number of events triggered by HMT. Expected number of events in data: 12 L1_SingleMuShower_Nominal and 5 L1_SingleMuShower_Tight; current emulator counts: 14 L1_SingleMuShower_Nominal and 10 L1_SingleMuShower_Tight. We have reasonable (different) countings for the two cases now!\r\n- The testing cmsDriver command is:\r\n`cmsDriver.py l1Ntuple -s RAW2DIGI --python_filename=data.py -n 1000  --era=Run3 --data --conditions=auto:run3_data --customise=L1Trigger/L1TNtuples/customiseL1Ntuple.L1NtupleRAWEMU --customise=L1Trigger/Configuration/customiseReEmul.L1TReEmulFromRAW --filein=/store/data/Run2022G/EphemeralHLTPhysics0/RAW/v1/000/362/720/00000/36f350d4-8e8a-4e38-b399-77ad9bf351dc.root --nThreads 8`\r\n\r\n\r\n2) **DQM mismatches** (countings in data, zero countings in the emulator)\r\n- Strategy: Running the emulator with the DQM workflow (see [instructions](https://docs.google.com/document/d/17JQu9lvu93kbkyk0PXQmC_jo8YdXIdQ1g5dV2hWhM7k/edit)) for a specific run containing showers (run 362720).\r\n- Missing input for the hadronic showers in valGtStage2Digis: to be added [here](https://github.com/cms-sw/cmssw/blob/master/DQM/L1TMonitor/python/L1TStage2Emulator_cff.py#L130-L143). \r\n- Providing the uGT input coming from the unpacker, MuonInputTag = \"gtStage2Digis:Muon\", we still see zero countings; switching to the GMT output MuonInputTag = \"gmtStage2Digis:Muon\", the mismatches disappear. This temporary fix is included here, but the GT unpacker for showers is not working. [Follow up with @dinyar needed.]\r\n\r\n#### PR validation:\r\nBasic tests performed successfully starting from CMSSW_13_0_0_pre4\r\n> cmsrel CMSSW_13_0_0_pre4\r\n> cd CMSSW_13_0_0_pre4/src\r\n> cmsenv\r\n> git cms-addpkg L1Trigger/L1TGlobal \r\n> git cms-addpkg DQM/L1TMonitor \r\n> scram b distclean \r\n> git cms-checkdeps -a -A\r\n> scram b -j 8\r\n> scram b runtests \r\n> scram build code-checks\r\n> scram build code-format", "branch": "master", "changed_files": 3, "comments": 3, "commits": 2, "created_at": "1676456116", "deletions": 101, "labels": ["dqm-pending", "l1-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_13_1_X", "number": 40773, "release-notes": [], "review_comments": 0, "state": "open", "title": "uGT fix for muon showers and temporary fix in the DQM workflow for HMT mismatches", "updated_at": "1676457285", "user": "elfontan"}