{"additions": 158, "auther_ref": "EF_uGT_fixHMT", "auther_sha": "4ab1cdbf167a13dd73e96b9cca1cc784b425ef57", "author": "elfontan", "body": "#### PR description:\r\nThe purpose of this PR is to address multiple issues at the GT level related to the muon shower emulation. Here two main items are discussed:\r\n1) **uGT emulation of HMT**\r\n2) **DQM mismatches** \r\n\r\nThanks @eyigitba and @aloeliger for the work and the discussion. \r\n\r\n\r\n1) **uGT emulation of HMT**\r\nThe MuonShowerCondition class was broken and was not evaluating at all the condition: this PR contains a first iteration of updates to get reasonable results (with a proper check of the condition for all HMT cases, able to distinguish between Nominal and Tight showers). \r\n\r\nSummary of the main issues:\r\n- The checkObjectParameter function responsible for the check of the muon shower bit for each condition was never called in the class.\r\n- The vector of candidates in MuonShowerCondition (_int numberObjects = candVec->size(useBx)_) was returning four objects (as supposed to be given the splitting in four separate muon shower objects in the Global Board), but we never compare them one by one to the MuonShowerTemplate. For each condition, we should compare each object to the template to make sure one of them passes. All four objects are exclusive in which bits are set to true.\r\n- The declaration of the four muon shower objects in the GlobalBoard was wrong: without having them declared as pointers, they were not passed correctly to the MuonShowerCondition (that was receiving random objects).\r\n\r\nOpen items:\r\n- At the moment, the class is checking only the central BX: _ReceiveMuonShowerObjectData_ is only looking at BX0. However, we can have showers in other BXs, too (as we saw last year with muon showers before fixing the timing). This has to be included.\r\n- Github issue in the OSW IB: https://github.com/cms-l1t-offline/cmssw/issues/1071.\r\n- In the L1Ntuple workflow running on 1000 events using run 362720 (find the cmsDriver command below), two additional events with a nominal shower were found, and five of those events fire for a tight shower (when we would expect a nominal shower only). No mismatch when running the DQM with the below fix. \r\n**Note** that L1Ntuple workflow runs the full L1 emulation starting from muonCSCDigis, so the steps in the middle that might be responsible for the discrepancy are: CSC digi unpacker, CSC shower re-emulation, EMTF shower re-emulation. \r\nAfter a follow up with @kakwok, we realised that the new CSC thresholds for the HMT shower thresholds had not been updated after the deployment online: fix in https://github.com/cms-sw/cmssw/pull/40829. Including this fix, a single event with a mismatch is found (having both a Nominal and Tight shower): 362720:105:115847543. \r\nFurther checks with @eyigitba for EMTF and @kakwok for CSC needed.\r\nGithub issue in the OSW IB: https://github.com/cms-l1t-offline/cmssw/issues/1070.\r\n\r\nValidation: \r\n- L1 emulation run using the L1Ntuples worflow and checking the number of events triggered by HMT. Expected number of events in data: 12 L1_SingleMuShower_Nominal and 5 L1_SingleMuShower_Tight; current emulator counts: 13 L1_SingleMuShower_Nominal and 6 L1_SingleMuShower_Tight. \r\n- The testing cmsDriver command is:\r\n`cmsDriver.py l1Ntuple -s RAW2DIGI --python_filename=data.py -n 1000  --era=Run3 --data --conditions=126X_dataRun3_Prompt_v2 --customise=L1Trigger/L1TNtuples/customiseL1Ntuple.L1NtupleRAWEMU --customise=L1Trigger/Configuration/customiseReEmul.L1TReEmulFromRAW --filein=/store/data/Run2022G/EphemeralHLTPhysics0/RAW/v1/000/362/720/00000/36f350d4-8e8a-4e38-b399-77ad9bf351dc.root --nThreads 8`\r\n\r\n\r\n2) **DQM mismatches** (countings in data, zero countings in the emulator)\r\n- Strategy: Running the emulator with the DQM workflow (see [instructions](https://docs.google.com/document/d/17JQu9lvu93kbkyk0PXQmC_jo8YdXIdQ1g5dV2hWhM7k/edit)) for a specific run containing showers (run 362720).\r\n- Missing input for the hadronic showers in valGtStage2Digis: to be added [here](https://github.com/cms-sw/cmssw/blob/master/DQM/L1TMonitor/python/L1TStage2Emulator_cff.py#L130-L143). \r\n- At the beginning, providing the uGT input coming from the unpacker, MuonInputTag = \"gtStage2Digis:MuonShower\", we still observed zero countings; switching to the GMT output MuonInputTag = \"gmtStage2Digis:MuonShower\", the mismatches disappeared. A fix of the GT unpacker for showers was needed: follow up with @dinyar in https://github.com/cms-sw/cmssw/pull/40822. Everything was tested again with this update and worked successfully (no dataVSemu mismatches in the DQM).\r\n\r\nNOTE: An update of the script to produce test vectors for the uGT firmware-emulator comparison is also provided to rely on the unpacked uGT information as input for the muon shower objects.\r\n\r\n#### PR validation:\r\nBasic tests performed successfully starting from CMSSW_13_0_0_pre4\r\n> cmsrel CMSSW_13_0_0_pre4\r\n> cd CMSSW_13_0_0_pre4/src\r\n> cmsenv\r\n> git cms-addpkg L1Trigger/L1TGlobal \r\n> git cms-addpkg DQM/L1TMonitor \r\n> scram b distclean \r\n> git cms-checkdeps -a -A\r\n> scram b -j 8\r\n> scram b runtests \r\n> scram build code-checks\r\n> scram build code-format", "branch": "master", "changed_files": 5, "closed_at": "1677227893", "comments": 18, "commits": 5, "created_at": "1676456116", "deletions": 127, "labels": ["dqm-approved", "l1-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "l1t"], "merge_commit_sha": "7a8c07abfd2760bd4f745dcf07e670bf95307992", "merged_at": "1677227893", "merged_by": "cmsbuild", "milestone": "CMSSW_13_1_X", "number": 40773, "release-notes": [], "review_comments": 6, "state": "closed", "title": "uGT fix for muon showers full emulation and for HMT mismatches in the DQM workflow", "updated_at": "1677227894", "user": "elfontan"}