{"additions": 893, "auther_ref": "EGNewDataFormats_1060pre3", "auther_sha": "dd9cdaf80ba7d1dd2ba21b93f717ba3b50658447", "author": "Sam-Harper", "body": "~~This is a WIP, there are a few outstanding bugs I'm trying to pin down.  I could also split this PR into two, most of the changes is adapting VID to read from the object.  It will not pass unit tests (because of tau problem which generical to all cms) nor matrix (one test still to fix).~~: Now fixed\r\n\r\n## PR description:\r\n\r\nIn E/gamma IDs, variables are sometimes calculated on on the fly during the computation of the ID. While we have survived with this, it would be much nicer if the variables were in the electron/photon as this means we dont have to continuously re-run expensive producers. \r\n\r\nThis PR does two things: it moves wherever possible an ID variable to the the photon/electron object and ensures the correct ID information is propagated to the miniAOD. At the same time it adds in HEEPV7.1 ID which is a bug fix ID which changes the pt cut to 5 GeV and uses calo energy to scale the isolation cut. \r\n\r\nA mechanism to update <105X samples exists via RecoEgamma/EgammaTools/plugins/EG9X105XObjectUpdateModifier.cc\r\n\r\n### Photon Variable changes\r\n\r\n#### particle flow isolation:\r\n\r\nit turns out only pfcluster isolation, charged, neutral and photon were being filled so the others were removed \r\n\r\nphoton and neutral isolation use the isolation calculated by PhotonIDValueMap producer as that is what is used in E/gamma cut based and MVA IDs. These two variables are identifical to the existing photon & neutral isolations.  \r\n\r\ncharged isolation: this is a practical but not fundamental definition change. The existing charged isolation uses the particle flow vtx association to determine vertex. The current charged isolation uses dxy, dz cuts instead. While the two isolations will disagree, they are fundamentally the same thing so the new variable can replace the existing one. Again this is the variable photon IDs actually use.  The old charged isolation is now chargedHadronPFPVIso incase anybody really wants it. \r\n\r\nchargedHadronWorstVtxIso and chargedHadronWorstVtxGeomVetoIso have been added\r\n\r\n#### Other ids: showershape:\r\nsmajor, sminor, smajorAlpha used in long lived analyses have been added.  There is a bug long standing bug in the code to calculate them, it doesnt check it actually finds a rec-hit and blindly uses it anyways. Patch incoming for that. \r\n\r\n### Electron Variable changes:\r\n\r\nthe HEEP track isolation is added to the object at the AOD level (it was already in the miniAOD). I would have liked to simply replace the tracker isolation variable but it changes the PF event content (its used in the ID). There is no reason to suspect that the changes are worse (or better) but at this point its best not to touch it. \r\n\r\nconversion vtx probablity: this is now added to the electron as its used in the MVA. This causing me major problems trying to get it to agree, this variable is very buggy and all the more reason to be in the object!\r\n\r\nhelperfuncs:  closestTrkNHits() and closetTrkChi2() allows these functions to be more easily used in our framework\r\n\r\nThe change to the dataformats is just a few files, most of the changes come from VID and adapting it to use the new format. \r\n\r\n### Expected physics changes:\r\nheep trk isolation (and thus ID) will slight change on some events, this is because weve gone from calculating on PackedCandidates to actual tracks so we encounter some small differences due to precision. \r\nphoton : photon & neutral hadron isolations will in rare cases change slightly, due to a small difference in vetos between CITK and PhotonID isolation computations. The variables remain fundementally the same though\r\nphoton : charged isolation is now a different but conceptually similar variable, the old one remains\r\nIDs : no ID or MVA variable changes should happen except  a few events for the HEEP IDs changing due to rounding errors. \r\n\r\n\r\n## PR validation:\r\n\r\nAn event by event comparison on 2018 EGamma data has been performed. Its not quite closing yet but soon (mainly as I'm finding lots of existing bugs...)\r\n\r\n## To Do:\r\n\r\n1. ~~problems with calculating the conversion vertex fit probability and some disagreements in the photon MVA.~~\r\n1. ~~3 problems in matrix tests, I know how to fix two of them (its a bug elsewhere), the 3rd I need to resolve~~\r\n1. ~~photon MVA isnt agreement well, something is bugged there~~ now very minor", "branch": "master", "changed_files": 46, "comments": 22, "commits": 5, "created_at": "1554734944", "deletions": 588, "labels": ["analysis-pending", "code-checks-pending", "comparison-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "simulation-pending", "tests-pending", "xpog-pending"], "milestone": "CMSSW_10_6_X", "number": 26389, "release-notes": [], "review_comments": 2, "state": "open", "title": "Moving E/gamma ID variables to the reco::Photon/reco::GsfElectron", "updated_at": "1554903093", "user": "Sam-Harper"}