{"additions": 1595, "auther_ref": "from-CMSSW_14_0_X_2024-04-07-2300", "auther_sha": "9d40b1fa71fbefe3345373cceeaa7d74df83e95c", "author": "AlexDeMoor", "body": "#### PR description:\r\n\r\nThis PR introduce UnifiedParticleTransformerAK4 a novel inclusive tagger for jet. This network will perform an inclusive tagging combining b/c/tau/lep tagging with jet energy regression (both the regression and the resolution estimation via quantile regression). The model is trained with a specific robust training combining improved adversarial training and domain adaptation for reducing the impact of the data/MC disagreement on the final performance. The output nodes of the domains are also kept for exploring the possibility of efficiency mapping and their impact later.\r\n\r\nAn overview of the method can be seen at: https://indico.cern.ch/event/1368069/contributions/5793148/\r\nA focus on the novel adversarial training is described here: https://indico.cern.ch/event/1372038/#3-adversarial-training-for-par\r\nThe preliminary results of the model were shown in the following meeting: https://indico.cern.ch/event/1397392/#17-preliminary-results-of-part\r\nThe final results will be shared this Monday: https://indico.cern.ch/event/1403350/#3-part-2024-final-results-and\r\n\r\nThis PR requires the associated ONNX model which has been submitted in the adequate RecoBTag-Combined repo: https://github.com/cms-data/RecoBTag-Combined/pull/57\r\n\r\nFor your information: a last training is ongoing trying to improve the current performance via an enriched dataset. A modification of the final model could occur. This will only affect the RecoBTag-Combined PR, not this one.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nYes this is the backport of https://github.com/cms-sw/cmssw/pull/44641\r\n", "branch": "CMSSW_14_0_X", "changed_files": 26, "comments": 4, "commits": 11, "created_at": "1712606206", "deletions": 14, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "requires-external", "xpog-pending"], "milestone": "CMSSW_14_0_X", "number": 44660, "release-notes": [], "review_comments": 0, "state": "open", "title": "[14_0_X] Introduce Unified Particle Transformer AK4 jet tagger (Backport) ", "updated_at": "1712647426", "user": "AlexDeMoor"}