{"additions": 47, "auther_ref": "CMSSW_8_0_22/sign787/PFDV-PFBA-mem", "auther_sha": "6b2d1a642770d14c305d3e24ab214acc6f1b2a21", "author": "slava77", "body": "Significant in-module memory use peaks were found in tests of HLTPhysicsIsolatedBunch data in 283171 (LS 60 was used in tests):\n- particleFlowDisplacedVertex with ~2GB: the blow up happened in AdaptiveVertexFitter trying to fit vertices with 3-4 K tracks passed to the algo without pre-filtering with a simpler fitting. \n  - Apparently the pre-filtering was designed with a 1K track preselection in mind. In a normal situation we should not have displaced vertices with O(1000) tracks. So, the candidate selection will need to be updated.\n  - main change in this PR is to skip candidates with more than 1000 tracks (in addition to some simpler cosmetics). This should be rare enough in Run2 that we can have this update in the 80X.\n- particleFlowBlock with up to ~1GB: here, map hash initialization was made too large\n  - HO-to-others linking may need to be revisited to see if cases of linking 10K block elements (as happened in these events) is meaningful\n  - the main change in this PR for PFBA is to limit the block link map reserve to 1M (this apparently  rarely ever happens even in PU200 in simulation). The cost is some extra CPU to extend the hash if the links size in the map ever gets over the 1M count. I have also changed the indexing from 64 bit size_t to unsigned_int.\n\nNo changes are expected in jenkins tests.\n", "branch": "CMSSW_8_0_X", "changed_files": 4, "closed_at": "1478019374", "comments": 10, "commits": 6, "created_at": "1477580644", "deletions": 53, "labels": ["backport", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "03d9a23199b1c16bc0602a1b450f8b3e993366c4", "merged_at": "1478019374", "merged_by": "cmsbuild", "milestone": "CMSSW_8_0_X", "number": 16374, "release-notes": [], "review_comments": 0, "state": "closed", "title": "reduction of in-module memory peaks (backport of #16375)", "updated_at": "1478019374", "user": "slava77"}