{"additions": 3784, "auther_ref": "hdf5ConditionsReader", "auther_sha": "ad952185514c9a6fb51c710257e6013affddad79", "author": "Dr15Jones", "body": "#### PR description:\r\n\r\nThis adds the CondHDF5ESSource which is capable of reading standard conditions data dumped from the database into an HDF5 format file.\r\n\r\nRetrieving data from an HDF5 file is considerably faster than retrieval via frontier (at FNAL for 1 thread it was 6-14 times faster and for 30 threads it is 25-35x faster). The design allows concurrent reading from disk, decompression and object deserialization to occur of multiple EventSetup data products being retrieved from the file.\r\n\r\nA python utility is used to dump a global tag from the DB and writes it to a file. Another utility exists to dump a global tag from one HDF5 file to another one (as reading a full GlobalTag from the DB can take many hours).\r\n\r\nTo accomplish this a new light-weight plugin interface to the boost serialization was created.\r\n\r\nThis system could be used when either more concurrency is needed and/or for HPC sites which have limited external access.\r\n\r\n\r\n#### PR validation:\r\n\r\nThe new unit tests all pass. Running a job which forced reading back all conditions from the file (and another one from the DB) also showed that the retrieval occurred without causing any errors. Also locally changed one RECO step of a workflow to only read conditions from the HDF5 file (and not from the DB) and the job ran without issue. No comparison of data was attempted, however.\r\n\r\n[This should be identical to #42345 before I broke that one]", "branch": "master", "changed_files": 72, "comments": 12, "commits": 26, "created_at": "1690819114", "deletions": 311, "labels": ["dqm-pending", "l1-pending", "core-pending", "analysis-pending", "alca-pending", "db-pending", "pending-signatures", "orp-pending", "tests-started", "code-checks-pending", "tracking", "trk"], "milestone": "CMSSW_13_3_X", "number": 42431, "release-notes": [], "review_comments": 24, "state": "open", "title": "[RFC] Retrieve conditions data from an Hdf5 file", "updated_at": "1692023868", "user": "Dr15Jones"}