{"additions": 168, "auther_ref": "updated-castor-geometry-seperated-halves", "auther_sha": "206d91c067778c3911cfcf9a1910a9a41937aabf", "author": "cbaus", "body": "Why we need the change:\nThe updated geometry can decribe a gap in the 2 (physical) detector halves. Previously castor was only 1 geant volume. We have reason to believe that due to the magnetic field castor is separated by ~1.5mm. This commit keeps the nominal position in castor.xml for the moment.\n\nWhat is changed:\nThis includes changes in the sector to volume numbering scheme in order match the original numbering (CastorNumberingScheme.xx)\nThe geant volumes are duplicated and each half contains 8 sectors. (castor.xml)\nAlso added the possibility for a rotation or tilt as we call it. (castor.xml)\n\nValidation:\nThe geometry has been validated extensively in CMSSW_4_4 (we will prepare some slides) and I just ran for 7_1_X 500k pion events (each old and new) and compared nominal to nominal which looked good in the statistical uncertainty.\n\nFuture:\nWe already obtained a position from different measurements in 2013. This has to be integrated.\nOne remark. The position can in principle change for each run. It may be needed to store x and y for each half in the database. I will discuss this in the next CASTOR meeting. The changes here will still be required.\n\nExample for validation plot:\n![Comparison for sector numbering](https://f.cloud.github.com/assets/5031063/2328646/6df56e38-a403-11e3-879b-d4ca8b77b0b5.png)\n", "branch": "CMSSW_7_1_X", "changed_files": 3, "closed_at": "1395250487", "comments": 12, "commits": 1, "created_at": "1393978498", "deletions": 144, "labels": ["fully-signed", "geometry-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "c8f58f9f7d7c7de1276d03879b204c0b172a1e65", "merged_at": "1395250487", "merged_by": "ktf", "milestone": "CMSSW_7_1_0_pre5", "number": 2722, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Updated CASTOR geometry to support to separated halves", "updated_at": "1398894504", "user": "cbaus"}