{"additions": 45, "auther_ref": "fftConcurrentIOVs", "auther_sha": "4e0cb014c5e83b09f66ccd437268c9a1c011df5f", "author": "wddgit", "body": "Currently the Framework only allows one EventSetup IOV (Interval of Validity) to be processed at a time, but we are preparing to change this in the future and allow multiple concurrent IOVs. This PR modifies the ESProducers related to FFT jet corrections in preparation for this change.\r\n\r\nPrior to this, these ESProducers held a pointer to a single produced object. After this PR it will use the ReusableObjectHolder class to manage multiple objects, one for each concurrent IOV. The objects needs to hold different content for different IOVs and the ESProducer needs to modify them during its produce call in a thread safe manner.\r\n\r\nThe dependsOn feature of the EventSetup has difficulty communicating with these different objects in the callbacks and produce function calls. The usage of the dependsOn feature is replaced by usage of the new ESProductHost class. It has a similar purpose, but works better when there are multiple IOVs because its interface allows direct communication via arguments between the produce methods and the lambda function that gets called when the dependent record changes.\r\n\r\nNote, I could not find anything in CMSSW that actually uses these modules. The limited runTheMatrix tests do not run them.  It is possible they are obsolete and not needed at all. Or maybe I just do not understand where to look. To test I manually created a test configuration that runs them and stepped through in the debugger to see they were performing as I expected through the code I modified although at some point later both failed because I do not know how to prepare the proper input they expect (which is not related to the changes in this PR).\r\n", "branch": "master", "changed_files": 3, "closed_at": "1537547743", "comments": 12, "commits": 1, "created_at": "1536854431", "deletions": 59, "labels": ["analysis-pending", "code-checks-approved", "comparison-available", "orp-approved", "pending-signatures", "tests-approved"], "merge_commit_sha": "28a29d710be50e72ea68cc4bbe55f6dea02b62db", "merged_at": "1537547743", "merged_by": "cmsbuild", "milestone": "CMSSW_10_3_X", "number": 24536, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Prepare FFT ESProducers for concurrent IOVs", "updated_at": "1537547743", "user": "wddgit"}