{"additions": 8, "auther_ref": "METZEROFIX", "auther_sha": "e5edabdf2f77a590a947a655d2784d56f4db23fb", "author": "bachtis", "body": "This PR contains two bug-fixes:\n\nA) There is a post cleaning algorithm that is deactivated since 62X. This algorithm has two sub-algortihms . One to remove HF candidates from PF if noisy/spikey and one to add HF cleaned hits if they were previously cleaned by DPG but they balance better the MET. \nThe second one method: checkCleaning() in PFAlgo was not deactivated. In 25 ns data taking the second one can start adding to PF cleaned out of time hits picking the ones that balance the MET better biasing the MET. This bias would make the MET O(200) MeV\n\nB)There was an additional small bug in the new clustering  that adds hits below threshold to the collection of the cleaned HF hits while in this collection we need only the DPG cleaned hits. The checkCleaning() sequence runs on those very low energy hits and finds a combination   that can bring the MET down from 200 MeV down to 10 MeV or less!\n\nThe fix A dominates the spike that is seen only in the data . If we apply only fix B then the met will still peak at 0.0 but at 100 MeV instead of 20 MeV\n\nThe fix B has also a small effect of the MC since low energy HF hits can be added back but the energy of those hits is so small that they can only change the Jet/MET by 100 MeV max\n\nTests were performed with any combination of cleaning and bug fixes. The conclusion is:\n+checkCleaning needs to be deactivated since postCleaning is deactivated  \n+Fix needed to not add the below threshold hits to the Cleaned collection\n## Notes\n\n1.The nature and understanding of the problem implies that the problem will not appear on metNoHF which is the default one for now in CMS \n\n2.The problem is also at HLT but cannot change efficiency or rate since the change of MET is max 5-10 GeV      - much lower than the HLT thresholds\n", "branch": "CMSSW_7_4_X", "changed_files": 3, "closed_at": "1479228016", "comments": 9, "commits": 1, "created_at": "1442405434", "deletions": 4, "labels": ["comparison-available", "fully-signed", "orp-pending", "reconstruction-approved", "tests-approved"], "milestone": "Next CMSSW_7_4_X", "number": 11280, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Fix in PF reconstruction for the  spike at MET=0.0", "updated_at": "1479228016", "user": "bachtis"}