{"additions": 1020, "auther_ref": "dd4hep-payloads-3", "auther_sha": "a9b3ef1acadccd40e39b6b8d88567083673734f2", "author": "cvuosalo", "body": "There is a tool for expert use to create geometry DB payloads from DDD XML files. This PR provides a DD4hep version of the same tool. An initial decision was made to match the design and function of the DDD tool to reduce development risks and to facilitate validation.\r\n\r\nNote that this tool is intended for the creation of Run 3 DD4hep geometry DB payloads. At this time, it is not anticipated that Runs 1-2 DB geometry payloads will be re-built. For Phase 2, the suitability of this design will have to be assessed, and changes may be necessary.\r\n\r\nThis tool produces the complete detector geometry in a human-readable XML file, which is not only suitable for loading into the DB but also can be used for diagnostics and validation.\r\n\r\nThere are two minor issues that will be addressed in follow-up PRs. The DB payload creation script currently has the reduced material scenarios commented out. A subsequent PR will implement those scenarios. Secondly, PPS uses a special XML payload for reconstruction, which is currently created with DDD. A later PR will implement creation of this payload with DD4hep.\r\n\r\nValidation\r\nThe extended geometry description DB payload created by the tool was validated against its DDD counterpart incrementally, section by section, to ensure the content was identical. A stress test where the tool read its own output was also done to verify it would reproduce that output. Also, 100 ttbar events generated with DD4hep XML and DD4hep DB payloads were checked to verify that there were no significant differences in results. A RelVal is underway for further validation.\r\n\r\nReco geometry DB payloads were checked to see that they are identical to the ones created with DDD. The Tracker Reco geometry DB payload created with DD4hep is not numerically identical to the DDD version, but it was thoroughly checked to see that the content is the same as DDD, except for insignificant numerical variations. The output of `DDDCmsTrackerContruction::printAllTrackerGeometricDets` was checked, as well as the `ModuleInfo.log`, `ModuleNumbering.dat`, `TECLayout_CMSSW.dat` outputs from `Geometry/TrackerGeometryBuilder/test/ModuleInfo.cc`, and all were found to be the same for DD4hep and DDD. The only differences were phi angles equal to |pi| that varied between -pi and +pi, and tiny values near 0 that could varied between -1e-12 and +1e-12.\r\n\r\nTo avoid these variations in future comparisons when new DB payloads are candidates for uploading, this PR proposes that values in the DD4hep Tracker Reco geometry record (the `PGeometricDet`) be standardized as follows:\r\n* phi values of |pi| will be set to +pi.\r\n* Translation x, y, z values and rotation matrix elements that are <=|1e-10| will be set to true 0.\r\nThis proposal has already been discussed with the Tracker DPG.", "branch": "master", "changed_files": 22, "closed_at": "1627397474", "comments": 60, "commits": 3, "created_at": "1623645491", "deletions": 116, "labels": ["code-checks-approved", "db-approved", "fully-signed", "geometry-approved", "orp-approved", "requires-external", "tests-approved", "urgent"], "merge_commit_sha": "532acfea5effc0929b9db42ce0a02dffa2474809", "merged_at": "1627397474", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 34111, "release-notes": [], "review_comments": 34, "state": "closed", "title": "[DD4hep] Tool for creation of DD4hep geometry DB payloads and for migration validation", "updated_at": "1627397474", "user": "cvuosalo"}