{"additions": 2072, "auther_ref": "totem_timing_digiProducer_PR", "auther_sha": "b3f48e58f3c6ba09e2fa651f2554d32269bd6592", "author": "CTPPS", "body": "This PR introduces support for the new timing detectors (TOTEM) in the vertical roman pots (RPs).\r\nThis code will be needed for the 90m dedicated run in t0 and P5 for DQM (10_2); however, it would be very much appreciated, but (considering the time scale) only if possible, to approve it before the alignment run (17th April) so that it can be used for the DQM.\r\n\r\nNOTE: the digital part of this detector is completely different from the CTPPS diamond detector. Here we use a sampler (SAMPIC) instead of a TDC. Therefore, even if we can share part of the unpacker (for the OptoRx frames), the dataformat is substantially different.\r\n\r\nThis PR introduces many modifications because an effective test is only possible using the TotemTimingDIGIs.\r\n\r\nSuggested test:\r\nEventFilter/CTPPSRawToDigi/test/test_standard_sequence_cfg.py\r\n\r\nData with this detector are available in:\r\n/store/group/dpg_ctpps/comm_ctpps/TotemTiming/Minidaq/519/\r\n\r\nFuture plan:\r\n- DQM using DIGI in preparation, PR soon\r\n- Geometry of the new detectors\r\n- Migration to db for mapping and geometry\r\n- RecHitProducer: we plan to produce the CTPPSDiamondRecHits, so that the rest of the code can be common with the CTPPS Diamond detector.\r\n- DQM using recHits\r\n\r\nWe are reasonably sure that all the bugs were fixed, however being a completely new detector, we foresee the possibility of other \"bugfixing\" PR.\r\n\r\nThanks!\r\n\r\n@fabferro ", "branch": "master", "changed_files": 27, "closed_at": "1523448078", "comments": 71, "commits": 29, "created_at": "1522308684", "deletions": 151, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "db-approved", "fully-signed", "orp-approved", "reconstruction-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "029a3a60588933d0cfd7cc2a002d006e1bcd5f4a", "merged_at": "1523448078", "merged_by": "cmsbuild", "milestone": "CMSSW_10_2_X", "number": 22796, "release-notes": [], "review_comments": 28, "state": "closed", "title": "CTPPS: TotemTimingDigi, totemTimingRawToDigi and mapping for the new Timing detector in Vertical RPs", "updated_at": "1523448085", "user": "nminafra"}