{"additions": 44, "auther_ref": "hgcal-dqm_with_th2poly-13_2_X", "auther_sha": "14e856fb2cbd7915b8e34efd6e62007ba55dbdab", "author": "ywkao", "body": "#### PR description:\r\n\r\nThis PR introduces a new type of DQM MonitorElement, TH2Poly, for HGCal DQM in the future. This feature allows a display of polygonal histograms on the CMS DQM GUI. As a demonstration, a wafer map can be displayed like the screenshot here [1].\r\n\r\nTH2Poly is a 2D histogram class inherited from TH2. Polygonal bins, defined by TGraph, can be loaded using the AddBin() method. After setting up the polygonal bins, a TH2Poly object can store information through Fill() or SetBinContent().\r\n\r\nA workflow for creating polygonal histograms looks like this:\r\nDQM Service -> DQM EDAnalyzer -> CMS DQM GUI\r\n\r\nAn implementation of TH2Poly in DQM Service and MonitorElement is necessary to display the polygonal histograms. It involves updates on two repositories: cmssw and dqmgui_prod. A pull request is created in the dqmgui_prod repository [2] with a relevant issue reported in this link [3], which is about setting up a CMS DQM GUI with the new feature.\r\n\r\n#### PR validation:\r\n\r\nThe workflow and the implementation have been tested: (a) From this feature branch, monitor elements of TH2Poly can be stored in a DQM root file [4]. (b) The DQM root file can be uploaded to a CMS DQM GUI, which is built following the steps noted in this issue [3]. Polygonal maps can be displayed on the DQM GUI, as demonstrated in [1].\r\n\r\n[1] https://ykao.web.cern.ch/ykao/raw_data_handling/hgcal_dqm_gui/screenshot_demo_th2poly_wafermap.png\r\n[2] https://github.com/cms-DQM/dqmgui_prod/pull/14\r\n[3] https://github.com/cms-DQM/dqmgui_prod/issues/13\r\n[4] A DQM root file containing demo polygonal maps: /afs/cern.ch/work/y/ykao/public/example_HGCAL_DQM/DQM_V0001_HGCAL_R000123469.root\r\n", "branch": "master", "changed_files": 5, "comments": 46, "commits": 3, "created_at": "1686577887", "deletions": 0, "labels": ["dqm-pending", "core-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved", "hgcal", "root"], "milestone": "CMSSW_14_2_X", "number": 41932, "release-notes": [], "review_comments": 6, "state": "open", "title": "Implement TH2Poly in DQM Services for HGCal DQM", "updated_at": "1725370191", "user": "ywkao"}