{"additions": 3987, "auther_ref": "NM_TP_Phase2_V0_13_1_0_pre3", "auther_sha": "8560fd03a04fbc0beef930b30d480d40e39bb98e", "author": "nancymarinelli", "body": "#### PR description:\r\n\r\nThis PR addresses (although probably not entirely) the emulation of the TP generation with the EB upgraded off detector electronics (BCP). We implemented the algorithms (as we know them now) which will be running on the BCP.\r\nIn doing this we decided not to reinvent the wheel and try to follow (as long as it was possible) what done for PhaseI (structure wise)\r\nTwo packages, SimCalorimetry/EcalEBTrigPrimProducers and SimCalorimetry/EcalEBTrigPrimAlgos were already existing since a long time with algorithms based on hacking the Phase I algos and using the Phase I digis. We keep those files \r\nin the packages until the development of the new stuff is completed. \r\nWe have added new files (.cc and .h with a clear Phase2 name in them.\r\nThe packages SimCalorimetry/EcalEBTrigPrimProducers contain the producer and the ES producers while \r\nSimCalorimetry/EcalEBTrigPrimAlgos contains all the algorithmic modules. The main input to all this are the Phase 2 digis.\r\nAt this point in time we are not yet interfaced with the brand new digis made out of the new signal shape. \r\n\r\nIn DataFormats/EcalDigis the new EBTrigPrim formats were already present since long time but we had to apply some\r\nupdates. \r\nNew files were added to CondFormats/DataRecors and CondFormats/EcalObjects to provide the necessary environment\r\nfor the new algorithms. \r\nIn SimCalorimetry/Configuration/python the  ecalDigiSequence_cff.py has been update to run the Phase2 TP sequence\r\nand a new Era modifier has been added in Configuration/Eras , called phase2_ecalTP_devel (so to keep the TP generation independent from the phase2_ecal_devel which mainly drives the digi production)\r\nWe consider this PR only a starting point: a) many details strictly related to the final electronics are missing, because they are not yet fully known, b) all what is related to databases is missing and I surely am forgetting many other items. \r\nIt's also very possible that this PR will be updated in some places in the very near future \r\n\r\n\r\n\r\n#### PR validation:\r\nThe PR has been tested with a private .cfg (also committed in SimCalorimetry/EcalEBTrigPrimProducers/test).\r\nI also tried cmsDriver with the workflow 24234.61. For step2 I did not manage to run it in automatic.  If I add to the eras options the new phase2_ecalTP_devel, cmsRiver does not recognize it. But if I run the cmsDriver with --no_exec and I add\r\nby hand the new era in the step2.cfg all works fine. There are details which I do not know about including it automated in the cmsDriver.\r\nFinally, the code has been committed after running the scram b code-format\r\n\r\n\r\n\r\n\r\n\r\n", "branch": "master", "changed_files": 67, "comments": 52, "commits": 13, "created_at": "1692727678", "deletions": 9, "labels": ["simulation-pending", "l1-pending", "alca-pending", "db-pending", "operations-pending", "pending-signatures", "tests-pending", "orp-pending", "upgrade-pending", "code-checks-approved"], "milestone": "CMSSW_13_3_X", "number": 42633, "release-notes": [], "review_comments": 88, "state": "open", "title": "Phase2 Trigger Primitive generation for Ecal Barrel ", "updated_at": "1695908201", "user": "nancymarinelli"}