{"additions": 4427, "auther_ref": "t4_creation", "auther_sha": "45e831bb0faf8898c12d6435d505251b6b386804", "author": "SegmentLinking", "body": "This PR introduces the T4 (quadruplet) object to increase efficiency at large displacement. T4s are built from two T3s that share a common LS. Only T3s that are not used in pT5s, pT3s or T5s are considered, and the T3s must start in either the endcap or on barrel layer 3 to reduce duplicates with the other objects. T4s are added as an additional track candidate so that the final TC collection is in the following order: pT5, pT3, T5, T4, and pLS. Motivation for the introduction of T4s was presented at the [Tracking POG meeting on 30 Sep 2025](https://indico.cern.ch/event/1586902/#76-lst-using-t4-objects-to-imp).\r\n\r\n5 selections are applied to T4s: requiring that the charges of the two T3s must be the same, a DNN classifier, a beta cut for consistency with a circle in r-phi (identical to that used for T5s), a chi-squared cut for consistency with a helix in r-z, and a cut on the impact parameter (dxy). The T4 DNN uses a multi-class architecture (similar to the T3 DNN) which classifies T4s as fake, real prompt, and real displaced. The DNN and dxy cut values are set to keep real displaced tracks while rejecting fake and real prompt tracks.\r\n\r\nThe displaced efficiency gain on a 50cm cube muon gun sample is shown below, where the current configuration is shown in blue and the addition of T4s is shown in red.\r\n<img width=\"405\" height=\"517\" alt=\"eff_v_simDistPos\" src=\"https://github.com/user-attachments/assets/e6a2b2e4-da05-45c9-9dff-160654b89bba\" />\r\n\r\n\r\nFull plots can be found here for [ttbar PU200](http://uaf-2.t2.ucsd.edu/~jachisma/PR189/muCube50_10000ev/plots_highPtTripletStep.html) and [50cm cube muon gun](http://uaf-2.t2.ucsd.edu/~jachisma/PR189/muCube50_10000ev/plots_highPtTripletStep.html).\r\n", "branch": "master", "changed_files": 37, "comments": 3, "commits": 1, "created_at": "1764674874", "deletions": 175, "labels": ["reconstruction-pending", "dqm-pending", "hlt-pending", "operations-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved", "tracking"], "milestone": "CMSSW_16_0_X", "number": 49529, "release-notes": [], "review_comments": 0, "state": "open", "title": "LST: Creation and implementation of T4 (quadruplet) object", "updated_at": "1764675016", "user": "jchismar"}