{"additions": 59, "auther_ref": "tinyRot", "auther_sha": "f5ab49e8310eb7c700ee8269aeb74fc96a49ccaa", "author": "cvuosalo", "body": "In the ECal endcap, the physical volumes `eregalgo:EFRY_100`, `eregalgo:EFRY_200`, and `eregalgo:EFRY_300` are intended to be placed in mother volumes `eregalgo:EESCAlv1`, `eregalgo:EESCAlv2`, and `eregalgo:EESCAlv3`, respectively, with rotations of x = -7.045281e-07 radians and y = 7.045385e-07 radians. The rotation is named `eealgo:EECrRoC1R1`. However, this rotation is too small, and an internal ROOT check in the method `TGeoRotation::CheckMatrix()` causes this rotation to be ignored. For as long as we've used DD4hep, these three physical volumes have been placed with no rotation. This placement occurs in the algorithm and affects both DD4hep from XML and DD4hep from the DB. We haven't noticed the lack of rotation since our tests are not sensitive enough to catch a missing 1e-6 radian rotation.  DDD does not use ROOT to place volumes, so it placed the volumes correctly.\r\n\r\nThis PR enables this rotation by increasing it by 1%. That amount is all that is needed to allow the rotation to be recognized by ROOT as valid. Increasing a 7e-7 radian rotation by 1% is not expected to have any noticeable effect on the geometry.\r\n\r\nA scan of all the rotations used in the geometry shows this rotation is the only one that is so small as to be ignored by ROOT.\r\n\r\n#### PR validation:\r\n\r\nWith the PR, the rotation is recognized by ROOT and the volumes are placed with the slightly increased rotation.\r\n\r\n\r\nThe changes in this PR will be backported to 12_0.", "branch": "master", "changed_files": 1, "comments": 4, "commits": 3, "created_at": "1632513780", "deletions": 6, "labels": ["geometry-pending", "pending-signatures", "orp-pending", "tests-started", "code-checks-approved"], "milestone": "CMSSW_12_1_X", "number": 35414, "release-notes": [], "review_comments": 0, "state": "open", "title": "[DD4hep] Increase tiny rotation by 1% so it will be recognized by ROOT", "updated_at": "1632515125", "user": "cvuosalo"}