{"additions": 351, "auther_ref": "CMSSW_13_3_X_revert_PR40443", "auther_sha": "7ff94d8b66eecc3845226214c03c97a4a1fe6e06", "author": "emiglior", "body": "#### PR description:\r\n\r\nThis PR is the first step towards the description of the so-called big pixels for the phase-2 InnerTracker as proposed in\r\n\r\nhttps://indico.cern.ch/event/1242584/contributions/5517916/attachments/2691752/4671198/em20230728.pdf\r\n\r\nThe plan is to describe the phase-2 big pixels in the file pixelStructureTopology.xml or by using the TrackerAdditionalParametersPerDet rcd for geometries loaded from DB.\r\n\r\nThe goal of this PR is to put back the changes of the infrastructure needed for using the TrackerAdditionalParametersPerDet rcd, introduced for the bricked pixels and then removed with PR#40443 (but without reintroducing the functions related to bricked pixels).\r\n\r\n**NOTE (similar to PR#34120): the record PTrackerAdditionalParametersPerDetRcd is consumed by the TrackerGeomBuilderFromGeometricDet, which is the same for Runs 2&3 and Phase 2. Therefore, this PR also modifies Runs 2&3, by including the new record. Anyway, for the moment no new parameters are introduced. We will take care setting the new parameters describing big pixels to dummy values for the geometries before phase-2.**\r\n\r\n#### PR validation:\r\n-  compilation ok after git cms-checkdeps -a\r\n- scram b code-checks, code-format\r\n- checked on ph-2 w/f 25610\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport and no backport needed\r\n(related PR#42448 targeting 13_2_X can be dismissed) \r\n\r\n@tvami @mmusich @adewit @gbardell\r\n", "branch": "master", "changed_files": 112, "comments": 32, "commits": 2, "created_at": "1691003101", "deletions": 29, "labels": ["hlt-pending", "alca-pending", "db-pending", "geometry-pending", "pending-signatures", "tests-approved", "orp-pending", "upgrade-pending", "code-checks-approved", "trk"], "milestone": "CMSSW_14_0_X", "number": 42454, "release-notes": [], "review_comments": 14, "state": "open", "title": "revert PR 40443 w/o introducing bricked pixels", "updated_at": "1699288374", "user": "emiglior"}