{"additions": 875, "auther_ref": "TrigObjTnP1030pre1", "auther_sha": "d96c38567cbdef6c28200667c7ca0556d8cf826b", "author": "Sam-Harper", "body": "Dear All,\r\n\r\nThis PR adds a DQM module which aims to monitor trigger efficiencies using only information calculated by the trigger.  In principle it is completely agnostic of the particle type, in practice it is probably only applicable to electrons. \r\n\r\nIt is intended that this module is run as part of the HLT job, hence why its not include in any \"DQM\" sequence. Running in the HLT was seen as the optimal solution as \r\n\r\n1. it needs the full stats (excludes online DQM, express) \r\n1. it requires a short latency (excludes offline DQM)  \r\n1. it has no need for any quantities calculated outside the HLT. \r\n\r\nThis module just provides the source histograms. The client will be run outside of the CMSSW framework and will be maintained in a separate git repo.  The client will acquire the histograms via the DQM gui api. \r\n\r\nThe goal of this DQM is to allow fast feedback of current E/gamma data taking efficiency with a latency of ~30-60mins from the fill ending. \r\n\r\nFinally, it is reasonable to ask, why bother? Two reasons. I am still paranoid about possible pixel issues causing efficiency losses and this will reduce the latency of finding them from <1 week> to <1 day>. More importantly, I want this up and running before the end of the Run so it doesn't get forgotten about for the start of RunIII where it will be extremely useful. \r\n\r\nWe will need this running at P5 so expect backports to 10_2 and 10_1.\r\n\r\n@Martin-Grunewald @silviodonato ", "branch": "master", "changed_files": 10, "closed_at": "1535112361", "comments": 50, "commits": 3, "created_at": "1534443674", "deletions": 16, "labels": ["code-checks-approved", "comparison-available", "dqm-approved", "fully-signed", "hlt-approved", "orp-approved", "tests-approved"], "merge_commit_sha": "38e87305a955b549d053858c1ccf189dd9d86206", "merged_at": "1535112361", "merged_by": "cmsbuild", "milestone": "CMSSW_10_3_X", "number": 24319, "release-notes": [], "review_comments": 6, "state": "closed", "title": "Trigger Object Tag and Probe DQM source", "updated_at": "1535112361", "user": "Sam-Harper"}