{"additions": 170, "auther_ref": "CMSSW_12_0_X_tau-pog_DeepTauAtHLT", "auther_sha": "b13a1b3ffc3e6c3c372a96162e3815be39b99426", "author": "cms-tau-pog", "body": "#### PR description:\r\nThis PR contains a set of changes needed to enable deepTauID at HLT:\r\n* Producer of PFTaus matched to L1 seeds (`L1THLTTauMatching`) updated to produce (depending on a python configuration argument) either PFTaus with all data members filled for further processing or \"empty\" PFTaus with only p4 and vertex information filled which is minimal information needed for filtering;\r\n* Added simpler (a more user-friendly) approach to define working points in `deepTauBase`;\r\n* Define default output values if a preselection in the deepTauID producer fails;\r\n* PFTauSelectorDefinition updated to handle outputs from the DeepTauID module and thus allow for filtering on deepTauID output;\r\n* The `deepTauAtHLT.py` customisation file updated to simulate a full di-tau paths with deepTauID for measurements needed before integration with an actual HLT menu. Module names in the customisation file adapted to not cause unwanted overlap with other paths/sequences; Implemented proper deepTauID working points for HLT which are a function of tau pt.\r\n\r\nThe PR is targeting 12_1_0 to allow tests and then integration with HLT for Run3.\r\n\r\n#### PR validation:\r\n\r\nThe PR has been validated on top of 12_1_0_pre4:\r\n\r\n* DeepTauID modules have been run both for offline and online (with the two customisation functions) and run smoothly without unexpected surprises in the output. Results with standard workflows containing deepTauID (miniAOD) are expected to not change.\r\n\r\n* The following command has been run to perform tests, which all succeeded:\r\n\r\n```\r\nscram b distclean \r\ngit cms-checkdeps -a -A\r\nscram b -j 8\r\nscram b runtests\r\nrunTheMatrix.py -l limited -i all --ibeos\r\n```\r\n\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nN/A", "branch": "master", "changed_files": 6, "closed_at": "1634583014", "comments": 25, "commits": 5, "created_at": "1634021609", "deletions": 35, "labels": ["hlt-approved", "reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "59b5b6e13de49ef9d16906d13cda7f8f841ffa8c", "merged_at": "1634583014", "merged_by": "cmsbuild", "milestone": "CMSSW_12_1_X", "number": 35619, "release-notes": [], "review_comments": 10, "state": "closed", "title": "Updates towards enabling deepTauID at HLT", "updated_at": "1634583014", "user": "mbluj"}