{"additions": 86, "auther_ref": "CMSSW_11_1_X_2020-05-04-1100/sign1101a/miniUL", "auther_sha": "eac0dc26d24ad80f85d4b4bf638ce1b931feac0f", "author": "slava77", "body": "- ```run2_miniAOD_UL``` process modifier is introduced for UL reminiAOD needs. \r\n    - note that using proc modifiers has been preferable over eras since a while; I took the chance to switch to the new way\r\n    - I expect that one modifier should be enough for all years; a year-specific config modifications should be possible with standard modifiers in combination, e.g. as ```(ctpps_2016 & run2_miniAOD_UL).toModify```\r\n        - if this will not be enough e.g. for 2016 we can add ```run2_miniAOD_UL16extra```, but hopefully this can be avoided\r\n- only minimal updates to miniAOD parameters compared to the defaults are made to have the workflow running\r\n    - rerun container discriminators as in run2_miniAOD_94XFall17 @mbluj @swozniewski please check and confirm if this needs a simple change (a more complex one would better be done by you in a follow up PR)\r\n    - drop trying to add pixelClusterTagInfos as in other run2 reminis because this collection is not available in 106X AODs (added in 11_X)\r\n    - PUPPI re-addition will be needed after a fixed version of #29254 is available\r\n    - I did not add the photon/electron correctors, assuming that these will be added by EGM @jainshilpi either in #29526 \r\n- tentative data and MC workflows are set up for 4 periods of Run2 (2 for 2016, 2017, and 2018)\r\n    - the data workflow numbering takes the existing \"legacy\" remini as \"10\" as a reference (even though 0 is implicit due to the numeric nature) and assigns this UL to be \"11\": e.g. 136.8311 (= 136.83110) -> 136.83111. This minimizes conflicts with some nanoAOD workflows and uses a common pattern\r\n    - the MC workflow numbering starts from 1325.5 as a base (this corresponds to the old 2016 MC remini) and appends \"160\" (1325.516) and \"161\" (1325.5161) for the 2016 pre and post-VFP, respectively; similarly \"17\" and \"18\" are used for the 2017 and 2018 UL workflows. This was an attempt to establish a somewhat intuitive pattern and avoid conflicts with existing wfs.\r\n- the input datasets are not available at CERN for most of the cases, a request will need to be made (somehow, for data the cmsDriver is not generating a site=T2_CH_CERN requirement and the workflows can run out of the box).\r\n    - for ```TTbar_13_reminiaod2017UL_INPUT``` I couldn't find an AODSIM relval with PU and use a RECO input instead\r\n- 136.88811, 2018D UL remini wf is added to the short matrix\r\n\r\nA summary of limited validation for 1325.517 (MC 2017) by comparing the original 10_6_X MINIAOD with remini in CMSSW_11_1_X_2020-05-04-1100 using FWLite: the differences are apparently in recognizable places where changes were introduced since 10_6_X\r\n- PUPPI updates are visible, including bugfixes in the MET uncertainties and corrections\r\n- muon beta variables are filled\r\n- tau ID variables are hard to compare with a plain branch diff due to reshuffling of the IDs introduced in 11_1_X\r\n\r\n@chayanit @pgunnell @wajidalikhan please let me know if you can make PhedEx request for the datasets proposed here in the tests or if an alternative can be transferred (I can make an update to the PR then)", "branch": "master", "changed_files": 8, "closed_at": "1589351357", "comments": 29, "commits": 8, "created_at": "1588809185", "deletions": 47, "labels": ["analysis-approved", "code-checks-approved", "comparison-available", "fully-signed", "operations-approved", "orp-approved", "pdmv-approved", "reconstruction-approved", "tests-approved", "upgrade-approved", "xpog-approved"], "merge_commit_sha": "92bec1a9938170ab7d36d181ae72457f3ab93ef0", "merged_at": "1589351357", "merged_by": "cmsbuild", "milestone": "CMSSW_11_1_X", "number": 29756, "release-notes": [], "review_comments": 0, "state": "closed", "title": "run2 re-miniAOD setup based on UL inputs", "updated_at": "1589452547", "user": "slava77"}