{"additions": 1462, "auther_ref": "DBremSim_12_5_X", "auther_sha": "4246b3829a709846f05087e28dd917d099934491", "author": "revering", "body": "#### PR description:\r\nImplemented physics for dark bremsstrahlung and cross section biasing into SimG4Core/CustomPhysics. Overview of implementation method and motivation available from presentation to SIM group: https://indico.cern.ch/event/1162548/contributions/4882745/attachments/2447856/4194591/Revering_DarkBrem_Sim_22_5_20.pdf\r\n\r\nDark Bremsstrahlung is implemented as an optional process in the CustomPhysics module, and an example _cfi file with brief instructions has been added to SimG4Core/CustomPhysics/DarkBrem_SIM_cfi.py. The new process should have no impact on event generation that does not explicitly call it and include the necessary watcher plugin. A location dependent cross section biasing class is also implemented, and as with the process itself is only instantiated through the DBremWatcher plugin.\r\n\r\n#### PR validation:\r\n\r\nA small sample of events was generated locally in CMSSW_12_5_X_2022-06-09-1100 to verify that the cross section biasing was taking place in the correct areas of the detector and was producing events at a reasonable rate. Large samples have been generated in CMSSW_10_2_6 to validate the process itself and verify that the cross section calculations are functional for both the total cross section and the expected kinematics. The kinematic calculations do not have any reliance on external cmssw modules, so the behavior should be identical between the two versions.\r\n", "branch": "master", "changed_files": 17, "comments": 0, "commits": 2, "created_at": "1654892785", "deletions": 1, "labels": ["simulation-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending"], "milestone": "CMSSW_12_5_X", "number": 38329, "release-notes": [], "review_comments": 0, "state": "open", "title": "Implementation of Dark Bremsstrahlung Custom Process", "updated_at": "1654892803", "user": "revering"}