{"additions": 11, "auther_ref": "Category_not_found_fix", "auther_sha": "7b0b8cde132794ea19ea8a03ffa3a8cb8bc3766c", "author": "guitargeek", "body": "Hello, unfortunately it's me again.\r\n\r\nThere were again some errors in the most recent IB due to the new electron MVA, related to the new category check I introduced [1]. I was unable to reproduce these errors locally so far*, but we can see that this problem affects not all electrons in the workflow. It crashes after a few 100 events.\r\n\r\nBy testing 1329.1 locally (which succeeded locally and failed in the IB), I observed that there were some electrons below 5 GeV in the crashing event, for which the MVA value gets computed. This is not foreseen by egamma, and if the category errors are exclusively on these very low pt electrons, everything is fine.\r\n\r\nHence I propose the following fix: let's change the _category not defined error_ to a warning that spits out pt and eta and just return -999 for the MVA if the category is not defined. We can check later in the logs if any electron in the kinematic region that the ID is designed for (pt > 5 GeV, |eta| < 2.5) failed, keeping an eye on the previously failing workflows which were:\r\n\r\n1325.6\r\n1325.8\r\n1329.1\r\n16.0 \r\n134.903\r\n136.777\r\n136.797\r\n10001.0\r\n\r\nAll due to the _category not defined_ error. The last one was actually a workflow that cms-bot successfully tested here at the end: https://github.com/cms-sw/cmssw/pull/23700. \r\n\r\n[1] https://github.com/cms-sw/cmssw/blob/master/RecoEgamma/ElectronIdentification/src/ElectronMVAEstimatorRun2.cc#L151\r\n\r\n\\* 1325.6 1325.8 and 16.0 gave me DAS errors, 1329.1 succeeded and for the others I didn't have time so far. Working on it.", "branch": "master", "changed_files": 2, "closed_at": "1531034511", "comments": 48, "commits": 3, "created_at": "1530765702", "deletions": 3, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "4d160dbcbff975d3bc31570fad466f423a348ae2", "merged_at": "1531034511", "merged_by": "cmsbuild", "milestone": "CMSSW_10_2_X", "number": 23746, "release-notes": [], "review_comments": 1, "state": "closed", "title": "Changed category not defined error to warning in ElectronMVA", "updated_at": "1531034512", "user": "guitargeek"}