{"additions": 996, "auther_ref": "TwoFrameworkImprovementsForMultithreading", "auther_sha": "32475cb20ee886b0f201f100e5a581eea78b49ff", "author": "wmtan", "body": "Two different changes to the framework to support multithreading are being submitted together because they touch some of the same lines of code:\n\nChange 1:\nFunctions that read a run, lumi, or an event principal fill in the principal that is passed in by reference. These functions no longer create the principal. Therefore, there is no need for them to return a pointer to the principal.\nWith this pull request, these functions now return void or bool, as appropriate.  Furthermore, the functions that read a run or lumi principal were passed a shared pointer for filling. As this is no longer needed, we now pass references instead.  Also, the functions readAndCacheRun and readAndCacheLumi were modified to fill in the principal rather than creating it, and were renamed readRun and readLuminosityBlock respectively, because the caching of the principal has been moved outside these functions.\n\nChange 2:\nThe process history registry is redone so that it is no longer a singleton instance of the ThreadSafeRegistry template.  It is now a separate class, and the primary input source, each secondary input sources, and each ROOT/EDM output module now each has its own instance of this registry.\n\nThis pull request contains and supersedes #641, which is being closed.\n", "branch": "CMSSW_7_0_X", "changed_files": 100, "closed_at": "1378038816", "comments": 11, "commits": 1, "created_at": "1377895050", "deletions": 967, "labels": ["core-approved", "daq-pending", "dqm-pending", "generators-pending", "pending-signatures", "visualization-approved"], "merge_commit_sha": "8b0d156db09093fd647338d4f4b868a0b4664c97", "merged_at": "1378038816", "merged_by": "davidlt", "number": 681, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Make history registry non-singleton and also fix read calls to not use p...", "updated_at": "1406901271", "user": "wmtan"}