{"additions": 2, "auther_ref": "IB/CMSSW_14_2_X/master_hwloc_2.11.2", "auther_sha": "206bbe21a670b562097ea01354fe78ad70613877", "author": "fwyzard", "body": "Version 2.11.2\r\n--------------\r\n* Add missing CPU info attrs on aarch64 on Linux.\r\n* Use ACPI CPPC on Linux to get better information about cpukinds, at least on AMD CPUs.\r\n* Fix crash when manipulating cpukinds after topology duplication, thanks to Hadrien Grasland for the report.\r\n* Fix missing input target checks in memattr functions, thanks to Hadrien Grasland for the report.\r\n* Fix a memory leak when ignoring NUMA distances on FreeBSD.\r\n* Fix build failure on old Linux distributions without accessat().\r\n* Fix non-Windows importing of XML topologies and CPUID dumps exported on Windows.\r\n* hwloc-calc --cpuset-output-format systemd-dbus-api now allows to generate AllowedCPUs information for systemd slices. See the hwloc-calc manpage for examples. Thanks to Pierre Neyron.\r\n* Some fixes in manpage EXAMPLES and split them into subsections.\r\n\r\nVersion 2.11.1\r\n--------------\r\n* Fix bash completions, thanks Tavis Rudd.\r\n\r\nVersion 2.11.0\r\n--------------\r\n* API\r\n  + Add HWLOC_MEMBIND_WEIGHTED_INTERLEAVE memory binding policy on Linux 6.9+. Thanks to Honggyu Kim for the patch. - weighted_interleave_membind is added to membind support bits. - The \"weighted\" policy is added to the hwloc-bind tool.\r\n  + Add hwloc_obj_set_subtype(). Thanks to Hadrien Grasland for the report.\r\n* GPU support\r\n  + Don't hide the GPU NUMA node on NVIDIA Grace Hopper.\r\n  + Get Intel GPU OpenCL device locality.\r\n  + Add bandwidths between subdevices in the LevelZero XeLinkBandwidth matrix.\r\n  + Fix PCI Gen4+ link speed of NVIDIA GPU obtained from NVML, thanks to Akram Sbaih for the report.\r\n* Windows support\r\n  + Fix Windows support when UNICODE is enabled, several hwloc features were missing, thanks to Martin for the report.\r\n  + Fix the enabling of CUDA in Windows CMake build, Thanks to Moritz Kreutzer for the patch.\r\n  + Fix CUDA/OpenCL test source path in Windows CMake.\r\n* Tools\r\n  + Option --best-memattr may now return multiple nodes. Additional configuration flags may be given to tweak its behavior.\r\n  + hwloc-info has a new --get-attr option to get a single attribute.\r\n  + hwloc-info now supports \"levels\", \"support\" and \"topology\" special keywords for backward compatibility for hwloc 3.0.\r\n  + The --taskset command-line option is superseded by the new --cpuset-output-format which also allows to export as list.\r\n  + hwloc-calc may now import bitmasks described as a list of bits with the new \"--cpuset-input-format list\".\r\n* Misc\r\n  + The MemoryTiersNr info attribute in the root object now says how many memory tiers were built. Thanks to Antoine Morvan for the report.\r\n  + Fix the management of infinite cpusets in the bitmap printf/sscanf API as well as in command-line tools.\r\n  + Add section \"Compiling software on top of hwloc's C API\" in the documentation with examples for GNU Make and CMake, thanks to Florent Pruvost for the help.", "branch": "IB/CMSSW_14_2_X/master", "changed_files": 1, "comments": 6, "commits": 1, "created_at": "1727348401", "deletions": 2, "labels": ["externals-pending", "pending-signatures", "tests-started", "orp-pending"], "number": 9437, "release-notes": [], "review_comments": 0, "state": "open", "title": "Update hwloc to version 2.11.2", "updated_at": "1727432364", "user": "fwyzard"}