{"additions": 510, "auther_ref": "puppiNoLep_weight_in_aod", "auther_sha": "d6e1687dd7ddc103feedc725b0f018fe24b1dec4", "author": "ahinzmann", "body": "#### PR description:\r\n\r\nThis PR computes puppiNoLep weights and puppi MET in RECO and stores the puppiNoLep weight as a value map. PUPPI MET is clustered based on standard PF candidates together with the value map of weights. A new boolean \"isWeighted\" is added to the reco::PFMet interface to indicate whether weights were applied during jet clustering. The packed candidates pick up the value map such that puppi does not need to be re-computed in MiniAOD.\r\n\r\nThe same was done for the puppi and PUPPI jets in #28936.\r\n\r\nOther changes:\r\n- Produce puppiForMET directly in PuppiProducer instead of a two step procedure puppiNoLep->puppiForMET and rename it to puppiNoLep, consistent with the name in PackedCandidates\r\n- Implement fillDescriptions for PFMetProducer\r\n- Rename PFMET_cfi to pfMet_cfi everywhere (for consistency with the module name)\r\n- Fix input jet collection of pfMetEI\r\n- Remove pfMetEI from RecoMET_EventContent (however, leave EITopPAG_EventContent_cff untouched)\r\n- Resolve issue #29264\r\n- By moving to the same input PF candidate collection for puppi MET and puppi jets (with just different weights), PUPPI MET significance and unclustered pT computation then don't rely on dR matching as implemented in #29331 anymore.\r\n- Store ref to PF candidate inside pat muons (just like done for all other PAT objects). PUPPI MET significance and unclustered pT computation then don't rely on dR matching as implemented in #29385 anymore.\r\n- Fix particle multiplicity computation in xy-correction for PUPPI MET. Previously, particles with a weight of 0 could also count in the multiplicity as a function of which the xy-corrections are computed. Since xy-correction are not needed/recommended for PUPPI MET, this fix is not backported.\r\n- For HI workflows, raise candidate pT threshold for chsMet and trkMet to 999. consistent with pfMet.\r\n\r\n#### PR validation:\r\n\r\nrunTheMatrix -l limited\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nNo backport foreseen.", "branch": "master", "changed_files": 65, "closed_at": "1588693307", "comments": 178, "commits": 20, "created_at": "1584716722", "deletions": 326, "labels": ["analysis-approved", "code-checks-approved", "comparison-available", "dqm-approved", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "6d0e276c82e1a460a634b92f141252d534adc1c2", "merged_at": "1588693306", "merged_by": "cmsbuild", "milestone": "CMSSW_11_1_X", "number": 29254, "release-notes": [], "review_comments": 48, "state": "closed", "title": "PUPPI MET in RECO", "updated_at": "1589138699", "user": "ahinzmann"}