{"additions": 1756, "auther_ref": "particle_net_hlt", "auther_sha": "afc869db2e5c4d01ca84f893aaad6b2afea6668d", "author": "rgerosa", "body": "We have developed new trainings for particle-net based on 12X simulated samples in Run3 conditions. This PR contains both models for AK4 jet flavour tagging and AK8 2-prong MD tagging. For each of the two cases, one onnx model for offline (RECO/miniAOD) and one for online (HLT) jets is provided. The HLT version of particle-net are meant to be used in the HH4b dedicated triggers proposed in the trigger review by the Higgs PAG [0]. \r\n\r\n[0] https://indico.cern.ch/event/1099590/contributions/4626739/attachments/2358674/4025770/TSGHIG_03Dec21.pdf\r\n\r\nMore details:\r\n1. ParticleNetAK4/HLT/V00/ contains models for AK4PF jet tagging at HLT. Two distinct models are proposed: one able to classify b-jet/c-jet/uds-jet/gluon-jets, one adding hadronic tau-jets. In fact, we are studying possible improvements over DeepTau.\r\n2. ParticleNetAK4/HLT/V00/ same networks as point 1. but trained on offline (reco) AK4CHS jets.\r\n3. ParticleNetAK8/MD-2prong/HLT/  contains models for AK8PF 2-prong tagging at HLT (mass decorrelated). Two distinct models are proposed: one able to classify Xbb/Xcc/Xqq/Xgg/QCD, the second adds a Xtautau (hadronic tau) class.\r\n4. ParticleNetAK8/MD-2prong/V02 same network as point 3. but trained on offline AK8Puppi jets.\r\n\r\nThese models are built starting from already existing particle-net models but training samples, input features, and NN hyper-parameters have been modified/tuned in order to achieve best performance & the possibility of being evaluated on both online and offline jets.\r\n\r\nWe will open soon another PR into cmssw-master in order merge changes needed for the evaluation. The HLT models will be used in Run3 data-taking. Instead, the RECO ones don't need, for the time being, to replace those used in standard sequences (RECO/MiniAOD). However, we would like to have them shipped as external to future CMSSW releases for testing/studying purposes given that it is always possible easily infere networks using miniAOD collections.", "branch": "master", "changed_files": 10, "closed_at": "1644829514", "comments": 14, "commits": 2, "created_at": "1643798973", "deletions": 0, "labels": ["fully-signed", "tests-approved", "externals-approved", "orp-approved", "urgent", "reconstruction-approved", "hlt-approved"], "merge_commit_sha": "59e2c2b076e07a173e850b481a808f538f608f8a", "merged_at": "1644829514", "merged_by": "cmsbuild", "number": 47, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Merge ParticleNet AK4 and AK8 models for Run3", "updated_at": "1644829514", "user": "rgerosa"}