{"additions": 0, "auther_ref": "jetCorrectorMigrationRecoJets", "auther_sha": "97c452bc59e64598a0dafc766d2bbf409fd8fb6a", "author": "wddgit", "body": "#### PR description:\r\n\r\nCleanup in RecoJets/JetAnalyzers. Removes archaic example modules. This only deletes files.\r\n\r\nThe Core group is attempting to complete a migration started in 2014 that moves from using the old ::JetCorrector class to using the reco::JetCorrector class. We are trying to centrally complete this migration. In RecoJets, the old JetCorrector class is only used in the example modules deleted by this PR. This PR is one of many PRs related to this migration. At this point, there are PRs submitted removing all usage of the old JetCorrector. Four of these PRs are still under review (including this one) and the rest already merged. This is related to the consumes migration and multi-threading performance.\r\n\r\nAll of the deleted example modules are 10 to 15 years old and so full of deprecated non-functional code that it would be harmful for someone to read as an example. 10 to 15 years ago these might have been useful, but at this point deleting them is a positive thing independent of the JetCorrector migration. We should not be using resources to distribute, build, and maintain code like this.\r\n\r\nNote that if someone believes these examples are valuable, the code could be restored from the git history and fully updated at some point in the future.\r\n\r\nI'll also note that I only looked at code using the deprecated JetCorrector class. There is more code that could be updated or deleted in this package.\r\n\r\nSome of the problems:\r\n\r\n- Don't call consumes and use getByLabel (fails).\r\n- Use deprecated JetCorrector (fails).\r\n- No unit tests or relVal tests.\r\n- Nothing references any of these other than test configs also deleted\r\n- Configs load cff files that no longer exist\r\n- Use corrections that no longer exist\r\n- Ancient input files that probably no longer exist\r\n- There is nothing deep and useful that really needs saving\r\n\r\n#### PR validation:\r\n\r\nOnly deletions. Nothing to test. Nothing could be using them because they don't work anymore.\r\n", "branch": "master", "changed_files": 11, "closed_at": "1668420590", "comments": 17, "commits": 1, "created_at": "1666804944", "deletions": 1466, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "39ddd424cc68e924ce8ae210c98dd00ebb744f75", "merged_at": "1668420590", "merged_by": "cmsbuild", "milestone": "CMSSW_12_6_X", "number": 39864, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Cleanup, RecoJets/JetAnalyzers, Motivated by JetCorrector Migration", "updated_at": "1668420590", "user": "wddgit"}