{"additions": 156, "auther_ref": "muBSConstraint_133X", "auther_sha": "8367f57f5977cf7be0cbeea5c1db08da9f504a69", "author": "namapane", "body": "#### PR description:\r\nFollowing discussions between H4l and Hmumu analysis teams, we would like to put forward a proposal to add the beamspot-constrained muon pT to nanoAOD v13.\r\n\r\nSome background:\r\n\r\nA BS constraint applied on top of PAT:Muons has been already adopted for the mH measurement in 4l  (HIG-21-019) after discussion/blessing in the muon POG [[talk1](https://indico.cern.ch/event/1012952/contributions/4251427)]. It was shown to significantly improve the mH resolution, especially since 2018 when the BS widths are of the order of ~6 microns, and was preferred for such an high profile analysis to ad-hoc parametrizations (eg GeoFit) as it is a natural step in reconstruction rather than an heuristic a-posteriori correction, that requires tuning. There are also ongoing studies for using this for Hmumu.\r\n\r\nAt the time of discussion in the muon POG, including this in standard sequences was not considered, as this constrain can be easily applied by the user while running on miniAODs.\r\n\r\nHowever, it is not possible to apply the constraint on top of NanoAODs, and this limitation is becoming apparent now. The statement that for mH4l we may be forced to stay with a miniAOD framework for this reason  sparked some discussion within the ATTF framework surveys [[talk2](https://indico.cern.ch/event/1098320/contributions/4621442) - see last page of the discussion document at the end of the agenda]; there were several suggestions to investigate possible ways to include the required information in nanoAODs. My reply at the time was that the implementation of the \"VX+BS\" approach used in the H4l analysis includes both a BS constraint and a common vertex constraint among the 4 selected muons; this makes it impossible to define a general-purpose constrained pT variable.\r\nBut actually, for 2018 and Run3, the BS width is so small that essentially all improvement comes from the BS constraint, not the common vertex constraint, so constraining each muon individually would be enough.\r\n\r\nThe present implementation is based on SingleTrackVertexConstraint. It essentially just adds 3 variables: the updated pt, ptError (precision=6) and chi2 (precision=6) We checked that the variation of eta and phi (and of their errors) are negligible so it would not be necessary to store these.\r\n\r\nOne more small update included is the increase of the precision of Muon_eta and Muon_phi from 12 bits to 16 ([code here](https://github.com/namapane/cmssw/blob/muBSConstraint_124X/PhysicsTools/NanoAOD/python/muons_cff.py#L159-L160)). This is because with the current precision we have a small rounding error on the reconstructed invariant masses, of about ~3.5 MeV (RMS) for H4mu [[talk3](https://indico.cern.ch/event/1253164/contributions/5265017/subcontributions/418422)]. Although this is a very small effect from the statistical point of view, authors feel it is somewhat unsatisfactory for the world's most precise single-channel measurement of mH to add a rounding smearing after they been fighting to reduce the systematic down to 17 MeV ([HIG-21-019](https://cms.cern.ch/iCMS/analysisadmin/cadilines?line=HIG-21-019), expected, 4mu only), especially if that can be avoided by just adding as little as 8 bits per muon.\r\n\r\n#### PR validation:\r\n\r\n Both changes have been tested on 2018 (using a backport) and 2022 data/MC.\r\n\r\n", "branch": "master", "changed_files": 4, "comments": 20, "commits": 3, "created_at": "1692793905", "deletions": 4, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-pending", "code-checks-approved", "xpog-approved"], "milestone": "CMSSW_13_3_X", "number": 42646, "release-notes": [], "review_comments": 0, "state": "open", "title": "Add mu beamspot constrained pT. Increase mu eta and phi precision to 16 bits", "updated_at": "1694616143", "user": "namapane"}