{"additions": 3414, "auther_ref": "133x_L1ScoutingDaqSource", "auther_sha": "9d13a12df6dbea3ffa136b04f7c9694653a861e4", "author": "Mmiglio", "body": "#### PR description:\r\nThis PR introduces a new DAQ source for the L1Trigger Scouting Run3 demonstrator. \r\nThe L1 Data Scouting (DS) system operates in parallel with respect to the central DAQ. Therefore, L1 DS data are not inserted in the CMS event data, ensuring complete Independence of the two systems.\r\nBy design, L1 Scouting data are collected and processed based on the orbit counter. Hence, one CMSSW event correspond to data collected during one LHC orbit (3564 BX).\r\nAn overview of this system can be found in [this presentation](https://indico.cern.ch/event/1288327/timetable/#13-computing-models-for-online).\r\n\r\nThe main components introduced in this PR include:\r\n* A DAQSourceModel that reads data from all scouting sources and merges them based on the Orbit counter.\r\n* Unpackers for the two sources currently tested during Run3 (uGMT and Calo DeMux).\r\n* Data formats for the scouting objects.\r\n\r\n#### PR validation:\r\nThe system has been tested from two perspectives:\r\n* Verified that events collected in the Zero Bias dataset match the raw data collected and unpacked from the L1DS.\r\n* Tested online data tacking using DAQ3VAL resources (scout-rubu -> d3v-fu (filter units) -> d3v lustre + monitoring).\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNo backport needed.", "branch": "master", "changed_files": 64, "comments": 21, "commits": 21, "created_at": "1701420943", "deletions": 1230, "labels": ["daq-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending"], "milestone": "CMSSW_14_0_X", "number": 43467, "release-notes": [], "review_comments": 43, "state": "open", "title": "New DAQ source for L1Trigger scouting ", "updated_at": "1702658083", "user": "Mmiglio"}