{"additions": 841, "auther_ref": "Phase2-WF45val", "auther_sha": "6f24a7fc4a081dd713c55066ced751c83a6a20bc", "author": "kpedro88", "body": "This PR introduces a full workflow for the new HGCal geometry. There are corresponding new Eras, `Phase2C4` and `Phase2C4_timing`.\r\n\r\nNumerous fixes in simulation, digitization, reconstruction, and validation were needed to make the workflow run to completion. In particular, the digi collection for HEB changes its type. The changes in DetId and geometry access had to be propagated to reconstruction in a number of places.\r\n\r\nA few things that will need to be fixed later:\r\n* L1T for HGCal is disabled. @jbsauvan you should revert 1efeb680e43e8cb6b9ddf6af9567cc9f92577285 once there is a trigger mapping for V9.\r\n* @rovere I'm not 100% sure the layer z position is done correctly for the new geometry in the egamma algorithms (ebd8f4066dab207397afb80b31916163e33689f4).\r\n* The layer offset for HEB (now that it is no longer HCAL but part of HGCal) needs to be handled in validation sequences. Right now, a simple hack is used to avoid out-of-range exceptions (e5bb5f9b177f232f66579109c4a5f294c7f8bbd5). I hope @bsunanda can figure out the right way to incorporate this.\r\n\r\nI tested locally with 100 events in WF 24034.0, and it ran to completion without crashing or emitting unexpected warnings. A more thorough validation campaign will begin once this is approved (or even before).\r\n\r\nThis PR includes #23503.", "branch": "master", "changed_files": 53, "closed_at": "1529647942", "comments": 95, "commits": 31, "created_at": "1528489363", "deletions": 504, "labels": ["code-checks-approved", "comparison-available", "dqm-approved", "geometry-approved", "l1-approved", "operations-approved", "orp-approved", "pdmv-pending", "pending-signatures", "reconstruction-approved", "simulation-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "0c79770d87e4c32f66ea065134178250db59a706", "merged_at": "1529647942", "merged_by": "cmsbuild", "milestone": "CMSSW_10_4_X", "number": 23545, "release-notes": [], "review_comments": 9, "state": "closed", "title": "Full workflow for HGCal v9", "updated_at": "1542730308", "user": "kpedro88"}