{"additions": 1028, "auther_ref": "from-CMSSW_13_1_0_pre2", "auther_sha": "69c5fe75c520b767a3cab1dcbab3fa4af2faf43f", "author": "AnnikaStein", "body": "#### PR description:\r\n\r\nThis is to add (Robust)ParticleTransformerAK4, in particular for Mini and Nano, update the DeepJet (aka DeepFlavour) model and remove outdated DeepCSV (aka bTagDeep) entries for Run 3. New models have been trained on 122X samples (PUPPI). This refers to multiple issues on GitLab, https://gitlab.cern.ch/cms-nanoAOD/xpog-coordination/-/issues/61 https://gitlab.cern.ch/cms-nanoAOD/xpog-coordination/-/issues/56 \r\n\r\nIts a follow-up of PR #40706 (where DataFormats were defined, which are filled with meaning now).\r\n\r\nWe are currently using model files of https://github.com/cms-data/RecoBTag-Combined/pull/51 but we aim to slightly adapt the ParT .onnx file, timeline depending on the discussions / outcome of https://indico.cern.ch/event/1263008/#10-ak4-jets-tagging-algorithms - there is a realistic chance a better performing, robust and yet quicker model (for inference) will be ready soon. Wed like to start reviewing the technical aspects of the PR now, at most wed switch the static files in RecoBTag-Combined/data for the best one we can get.\r\n\r\nOne of the most comprehensive overviews on the new tagger along with the different developments that go in was given lately: https://indico.cern.ch/event/1218506/#6-particle-transformer-run-3-t\r\nThe new concept we want to introduce in RecoBTag is adversarial training, e.g. explained in the jet tagging context here https://doi.org/10.1007/s41781-022-00087-1, with first full CMS application here https://cds.cern.ch/record/2839919. Implications / advantages have been studied already for earlier versions of ParTAK4 (e.g. https://indico.cern.ch/event/1218501/#4-adversarial-training-for-par, https://indico.cern.ch/event/1218499/#5-adversarial-training-for-par). More (written) documentation to follow.\r\n\r\n\r\nCollaboration with @ademoor\r\n\r\n#### PR validation:\r\n\r\nThe comparisons between CMSSW and PyTorch have been run lately, results presented here: https://indico.cern.ch/event/1272115/#1-news\r\n\r\nA set of basic checks was run:\r\n```\r\nscram b runtests\r\nscram build code-checks\r\nscram build code-format\r\n```\r\n\r\nCustom tests (which we think shall not go in the official repo, but would be available if needed: https://github.com/AnnikaStein/cmssw/commit/07aac71ca553cb346786bd4b98375e9158db20b9) have been run to perform the AOD -> MiniAOD step, (step1_PAT.py) as well as step1_NANO.py to go from Mini to Nano, both without errors, adding the new branches as expected.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis is for master, but a backport to 130X is planned.\r\n", "branch": "master", "changed_files": 20, "comments": 2, "commits": 8, "created_at": "1680635536", "deletions": 26, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-rejected", "xpog-pending"], "milestone": "CMSSW_13_1_X", "number": 41275, "release-notes": [], "review_comments": 0, "state": "open", "title": "Introduce (Robust)ParTAK4 jet tagger, DeepJet model update for Run 3, remove DeepCSV from nano", "updated_at": "1680637396", "user": "AnnikaStein"}