{"additions": 17, "auther_ref": "addAutoProcessModifierStorage", "auther_sha": "b66db5fac0a7f6b7c89e8999d6f63f777b6ade8e", "author": "mark-grimes", "body": "**Current code**\nCurrently the only way for an era to make a modification to the whole process object is to create a ProcessModifier and assign it a unique name, e.g.:\n\n``` python\ndef _modificationFunction( theProcess ) :\n    theProcess.someThing = blah\nsomeUniqueName_ = eras.run2_common.makeProcessModifier( _modificationFunction )\n```\n\nWhen the process object scans the imported objects at the end of the `load(...)` it sees that `someUniqueName_` is an instance of ProcessModifier and applies the change to itself.\n\nThis has the disadvantage of requiring a unique name, and also that it can be easily broken depending on how the file with the era change is imported.  For example, if the file above is imported with\n\n``` python\nfrom SomePackage.SubPackage.file import somePSet\n```\n\nThen only `somePSet` is imported and not the ProcessModifier object, hence the era changes are never applied.\n\n**Proposal**\nThis pull request adds the method `toModifyProcess` to the era which stores the ProcessModifier object inside the era itself.  When the process object has finished the `load(...)` it scans all its active eras and applies any stored ProcessModifiers, then clears the list ready for the next `load(...)`.  This bypasses the import problem above and also (I think) looks much cleaner.  The new way of modifying the process object would be:\n\n``` python\ndef _modificationFunction( theProcess ) :\n    theProcess.someThing = blah\neras.run2_common.toModifyProcess( _modificationFunction )\n```\n\nThe old way of modifying the process is still available.  If this PR is accepted then we could mark it as deprecated or remove it later.\n\n@Dr15Jones let me know if you can see any disadvantages or have any comments.  Note that as well as adding methods I've made use of the `__processModifiers` attribute which doesn't appear to be used elsewhere.  If this is a problem I can easily modify it to use a different attribute.\nAutomatically ported from CMSSW_8_0_X #12256 (original by @mark-grimes).\n", "branch": "CMSSW_8_1_X", "changed_files": 1, "closed_at": "1463634097", "comments": 39, "commits": 1, "created_at": "1455786531", "deletions": 0, "labels": ["comparison-pending", "core-rejected", "orp-pending", "pending-signatures", "tests-pending"], "milestone": "Next CMSSW_8_1_X", "number": 13381, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Add a simplified way for eras to modify the whole process", "updated_at": "1463634097", "user": "cmsbuild"}