{"additions": 211, "auther_ref": "HcalHardcodeEras", "auther_sha": "518f67116f5a44e4be44a5e053ab013e9f24df4b", "author": "kpedro88", "body": "There have been a number of \"solutions\" for enabling HCAL hardcode conditions and avoiding the packer/unpacker (customization functions, phase2-specific Era modifications, EDAliases, etc.). None of these were general enough to be completely satisfactory.\r\n\r\nThis PR introduces two general-use Eras:\r\n1. `hcalHardcodeConditions`, which enables the use of HCAL hardcoded conditions. The subdetector-specific settings for `HcalHardcodeCalibrations` are now enabled with the relevant Eras, so they will be consistently set for any simulation scenario.\r\n2. `hcalSkipPacker`, which skips the packer and runs the new fake unpacker `HcalRawToDigiFake`. This fake unpacker just duplicates the simulated digi collections as `hcalDigis` collections, in order to avoid changing any InputTags.\r\n\r\nTypically, `hcalSkipPacker` should be used when `hcalHardcodeConditions` is used, unless a real ElectronicsMap is used (rather than the hardcoded one, which is not appropriate for packing). Both of these Eras are now used for Phase2, and will be used for the upcoming Run3 workflow. They can also be manually chained with any other Era to enable the hardcode conditions and/or skip packing, in case such behavior is needed by a user.\r\n\r\n`HCalCustoms.py` is deleted, since it is no longer needed for any purpose.", "branch": "master", "changed_files": 16, "closed_at": "1500887263", "comments": 24, "commits": 4, "created_at": "1499877602", "deletions": 305, "labels": ["alca-approved", "comparison-available", "geometry-approved", "operations-pending", "orp-pending", "pending-signatures", "reconstruction-approved", "simulation-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "29eeb3ccbf5dc8039956257fbcca6b6a2a14a224", "merged_at": "1500887263", "merged_by": "cmsbuild", "milestone": "CMSSW_9_3_X", "number": 19712, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Eras for HCAL hardcode conditions and packer skipping", "updated_at": "1500887263", "user": "kpedro88"}