{"additions": 76, "auther_ref": "mm_dev_fixErrBars_PVplots", "auther_sha": "acb0ab0ddcb937aaab58d320d0918a5f46e665a7", "author": "mmusich", "body": "#### PR description:\r\n\r\nThe title tells it all. It was recently realized that some of the plots that were made public in [CMS-DP-2024-071](https://twiki.cern.ch/twiki/bin/view/CMSPublic/TkAlignmentPerformanceRun3Reprocessing) are affected by a bug in the computation of the error bars.\r\nUpon further investigation an issue was found with the error bars in this particular set of plots ([primary vertex run averaged](https://twiki.cern.ch/twiki/bin/view/CMSPublic/TkAlignmentPerformanceRun3Reprocessing#Primary_vertex_validation_Averag)): in general we use a likelihood gaussian fit to account for empty bins when we look at run by run primary vertex validation during operations which can happen relatively frequently in single runs. However, this is not appropriate for weighted inputs (as is the case for lumi-averaging) and here one should use a least squares fit. \r\nThis PR provides some changes to plotting macro `FitPVResiduals` such that it auto-detects if the input file is lumi-weighted or a regular single run file and then acts accordingly in the fit procedure.\r\nSome preliminary commit (86e2e0d073610be6b1fa2f8fd1d1b1874cf98fa3) was needed in order to make the fetching of the validation \"metadata\" agnostic on the type of input file (before this PR this was dealt with by using a separate and different code).\r\n\r\n#### PR validation:\r\n\r\nI've run this branch with and without the commit acb0ab0ddcb937aaab58d320d0918a5f46e665a7. \r\nWithout the changes I get plot with exaggerated error bars e.g:\r\n\r\n![image](https://github.com/user-attachments/assets/079a928f-f176-49a1-8844-b6fb83fa7216)\r\n\r\nwhile, when using the commit I get much more reasonable error bars:\r\n\r\n![image](https://github.com/user-attachments/assets/0d8a395b-c636-4dd6-b953-775b4b90d300)\r\n\r\nIn addition I have also tested the single run (unweighted case) to make sure there are no changes, and none are observe (see [this](https://marcomusich.web.cern.ch/TestPVValidation/single/mods/) vs [that](https://marcomusich.web.cern.ch/TestPVValidation/single/vanilla/)).\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nN/A\r\n\r\nCc:\r\n@henriettepetersen @TomasKello ", "branch": "master", "changed_files": 2, "comments": 5, "commits": 2, "created_at": "1726229235", "deletions": 15, "labels": ["alca-pending", "pending-signatures", "orp-pending", "tests-started", "bug-fix", "code-checks-approved", "trk"], "milestone": "CMSSW_14_2_X", "number": 46000, "release-notes": [], "review_comments": 0, "state": "open", "title": "Support lumi-weighted input files for the TkAl Primary Vertex Validation plotting", "updated_at": "1726229787", "user": "mmusich"}