{"additions": 1227, "auther_ref": "consumesL1", "auther_sha": "9bc44baf49ce636535670dcafcdc2abad433c275", "author": "wddgit", "body": "This modifies L1GtUtils to call the consumes function\nfor all the products it gets. It also modifies the numerous\nmodules that use L1GtUtils to work with these changes.\n\nThe L1GtUtils constructor is modified and its arguments\ndetermine its behavior. This PR preserves the previous\nbehavior where it is possible to have L1GtUtils look for\nthe products by type without specifying the InputTags in\nthe configuration. This makes the migration of the\nmodules easier as configurations will not need modification\nto add the InputTag parameters. It is also possible to pass\nthe InputTags into the constructor as arguments, which was\nalso an option in the earlier versions. And I added the the new\npossibility to set the InputTags in the configuration as well.\n\nAll modules that use L1GtUtils will also have to remove InputTags\nwhere they were being passed in at points other than the constructor.\nThey have to be set in the constructor now. This has to be decided\nearlier and the module can no longer decide the InputTag when processing\nthe event or run.\n\nThe new L1GtUtilsHelper class encapsulates most of the logic of the\ninput tag selection and holds the EDGetTokens. It also registers the\ncallback function (its operator() function) which is called for all products\nin the ProductRegistry if the InputTags are not specified in the configuration\nor as arguments to the constructor.\n", "branch": "CMSSW_7_5_X", "changed_files": 69, "closed_at": "1432265056", "comments": 31, "commits": 9, "created_at": "1431436704", "deletions": 1117, "labels": ["alca-pending", "analysis-pending", "comparison-available", "dqm-approved", "hlt-approved", "l1-approved", "orp-pending", "pdmv-pending", "pending-signatures", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "2edc5df73c6548fb10694c3ce08451c7f2ab203b", "merged_at": "1432265056", "merged_by": "davidlange6", "milestone": "CMSSW_7_5_X", "number": 9055, "release-notes": [], "review_comments": 4, "state": "closed", "title": "Consumes migration for L1GtUtils", "updated_at": "1436189795", "user": "wddgit"}