{"additions": 2344, "auther_ref": "MiniAOD2017V2_101X", "auther_sha": "7a27eab0bf4aae561ca84573e7e95bf2d278c2c7", "author": "Sam-Harper", "body": "Dear All,\r\n\r\nThis is the miniAOD V2 PR in a 10_1_X flavour. \r\n\r\nIt mostly involves adapting the Energy Scale & Smearing code to be able to put it into the pat::Electron. I freely admit, the design is not the best, I had to work with what I had. \r\n\r\nThis PR does two things\r\n1) enables 2016/2017 IDs in the miniAOD and also stores the bit maps of the cuts for the cut based IDs, everything is embeded in pat::Electron,pat::Photon as well as removing all old IDs. This is the more or less trival bit\r\n2) lays the ground work to apply the residual scale and smearing corrections to electrons. As these scale and smearing are only appropriate to 2017 Fall17 re-reco, these corrections are not actually enabled in the sequence as I dont want them run in the release. The 94X flavour of this does of course enable it.\r\n\r\nThe scale and smearing is the bigger of the two. First @shervin86  enabled this to be gain dependent and updated to the latest way of doing the corrections. Then I modified this code to fit the needs better, I made the CalibratedElectronRun2 and CalibratedPhotonRun2 producers more robust, wrote out some more variables and generally made the code more compact. I also added two modes, one where it does not write out the calibrated electrons/photons, just the value maps with the energy + sys errors and another where it now has a deterministic random number based on the event nr, runnr, lumiSec, supercluster seed id and number of crystals in the supercluster. This means the electron and photon get the same random number when they are the same object. If there is no stored supercluster, I fall back to a modified method @gpetruc had already implemented (in fact it was highly inspired by his code). \r\n\r\nIn order to deal with all the value maps,  the best option was to calibrate inside the reducedEgammaProducer. This producer also gathers up all the calibrated energy ValueMaps keyed to the gsfElectrons/gedPhotons in the same way it does for the other valuemaps.\r\n\r\nThen in the slimming stage, these can be embeded in the pat::Electron/Photon via the normal means. \r\n\r\nThe only thing I'm not sure of is I need some files data files in EgammaAnalysis/ElectronTools/data, but there is no repo for this in cms-data, who do I contact to deal with that. \r\n\r\n@lsoffi @varuns23 @jainshilpi @shervin86 ", "branch": "master", "changed_files": 41, "closed_at": "1520785957", "comments": 104, "commits": 16, "created_at": "1519319011", "deletions": 726, "labels": ["analysis-pending", "code-checks-approved", "comparison-available", "orp-pending", "pending-signatures", "reconstruction-rejected", "requires-external", "tests-approved"], "milestone": "CMSSW_10_1_X", "number": 22308, "release-notes": [], "review_comments": 55, "state": "closed", "title": "EGMiniAODV2 : 10_1_X", "updated_at": "1520785957", "user": "Sam-Harper"}