{"additions": 0, "auther_ref": "legacyCleanupLastInReco", "auther_sha": "1dc40b026e3aa7c2943d861accc8175758167875", "author": "wddgit", "body": "#### PR description:\r\n\r\nRemove last legacy type modules in reco packages. This is a part of a migration to remove all references to legacy type modules in CMSSW.\r\n\r\nNone of these modules are currently compiled and compilation has been broken since at least January 2023.\r\n\r\nExcept for TestPixTracks.cc, none of these has undergone the consumes migration for ED products. That means they would fail if run since at least 2015. I attempted to convert TestPixTracks.cc to a one::EDAnalyzer, but it has other unrelated problems that cause compilation to fail (and then I gave up and deleted it also).\r\n\r\nAll of the files have some commit history from various migrations (which used developer time to perform the maintenance), but most don't have substantive commits or development for a very long time.\r\n\r\n* TestPixTracks - Newest, original commit in 2014. Everything since has been migrations and similar things. Doesn't look like the module has seen real development since 2014.\r\n* EcalMatacqHist2 - Only substantive commit was the first in 2009.\r\n* SeedGeneratorFromTrackingParticleEDProducer - Only substantive commit in 2011. Content always has been completely commented out.\r\n* DTRecSegment2DReader and DTRecSegment4DReader - Only substantive commit in 2006\r\n* PixelTrackRoot - last substantive commits in 2006\r\n* PixelVertexTest - last substantive commits in 2010\r\n* CVRAnalysis - last substantive commit in 2008\r\n* TrivialExample - only substantive commit in 2007\r\n\r\nExcept SeedGeneratorFromTrackingParticleEDProducer, these are analyzers that make histograms and/or print stuff out, usually to cout or cerr.\r\n\r\n#### PR validation:\r\n\r\nNone. This is exclusively deletions of code that already was not compiled.\r\n", "branch": "master", "changed_files": 14, "comments": 2, "commits": 1, "created_at": "1701804062", "deletions": 2226, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved", "tracking", "trk"], "milestone": "CMSSW_14_0_X", "number": 43503, "release-notes": [], "review_comments": 0, "state": "open", "title": "Remove legacy modules cleanup, last ones in reco packages", "updated_at": "1701804346", "user": "wddgit"}