{"additions": 68, "auther_ref": "backportL2TauNNTag", "auther_sha": "73d1eea31f031cb980947837fbcae5a5a75c0bd8", "author": "valeriadamante", "body": "#### PR description:\r\nDoing tests on GPU, some issues in L2NNTag produced outputs have been reported: running twice the L2NNTag producer, it gave different results on the same events/taus. The problem has been addressed to the filling of the CNN inputs : PatatrackPtSumWithVertex and PatatrackSizeWithVertex.\r\nThe reason is the following: to fill the aforementioned variables while looping on tracks, a match between the vertex associated to the track (*) is required by associating the observable idv (which is the vertex index related to the patatrack) to be the same of the sortInd (**) which is the vertex index sorted by the vertex observable ptv2 .\r\nIf you want to give a look to the vertex related observables, they are described [here](https://github.com/cms-sw/cmssw/blob/master/CUDADataFormats/Vertex/interface/ZVertexSoA.h).\r\n\r\nThis match is not correct: indeed, the idv has to be compared with the vertex index.\r\n\r\n(*) all tracks with vertex index -1 are not considered, since this means that they are not associated to any vertex\r\n(**) the sortInd is of a subset of all vertices, since they are required to pass some quality cuts described in the function SelectGoodVertices. Also in this function there is a similar matching requirement and also in that case it has been changed.\r\n\r\nIn this PR, this bug is fixed.\r\n \r\n#### PR validation:\r\n\r\nThis bug was spotted because while looping multiple times on GPU, results were not consistent among each other.\r\nWith the aforementioned change, some preliminar tests on GPU and CPU have been carried on, selecting specific bugged events and from those preliminar tests there are no more differences.\r\n\r\nWith CPUs there were no difference both before and after the bugfix. So integrating this PR CPU results should be kept unchanged (in terms of efficiencies and rates).\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n This is the backport of the PR [cmssw-37291](https://github.com/cms-sw/cmssw/pull/37291#event-6316402847)  \r\n", "branch": "CMSSW_12_3_X", "changed_files": 1, "closed_at": "1648507116", "comments": 8, "commits": 1, "created_at": "1648454021", "deletions": 95, "labels": ["hlt-approved", "fully-signed", "tests-approved", "bug-fix", "orp-approved", "backport-ok"], "merge_commit_sha": "f3d8a55ee434b48034f80154e926103731dc4853", "merged_at": "1648507116", "merged_by": "cmsbuild", "milestone": "CMSSW_12_3_X", "number": 37372, "release-notes": [], "review_comments": 0, "state": "closed", "title": "backport of bugfix in vertex selection for the L2TauTagNNProducer", "updated_at": "1648507116", "user": "valeriadamante"}