{"additions": 153, "auther_ref": "from-CMSSW_12_3_0_pre4_KB_v1_OmtfRpcClusters", "auther_sha": "3d6774d69122eaf5d7a2e5e62a8c82ba843f1302", "author": "kbunkow", "body": "#### PR description:\r\nImplementation of the RPC clusterization that should be in agreement with the updated OMTF firmware from November 2021. In the emulator, if the option dropAllClustersIfMoreThanMax is used, then if any cluster is dropped in a given barrel roll or endcap chamber (because it is bigger than RpcMaxClusterSize or there is more than 2 of them) - all clusters are dropped for this roll/chamber. Besides the better data-to-emulator agreement it provides better efficiency for high pt muons. The OMTF emulator should be backward compatible with the run2 data.\r\n\r\n- what changes are expected in the output if any:\r\nbetter data-to-emulator agreement for OMTF muon trigger for the data with the OMTF firmware from Nov 2021 ([https://its.cern.ch/jira/browse/CMSLITOPS-272](https://its.cern.ch/jira/browse/CMSLITOPS-272)) ,\r\nno significant changes in the data-to-emulator agreement for the run2 data.\r\n\r\n- what other PRs or externals it depends upon if any \r\nNone\r\n\r\n#### PR validation:\r\nscram b runtests - OK\r\nrunTheMatrix.py -l limited -i all --ibeos - OK\r\nThe DQM was run locally in order to check the plots for showing the OMTF data-to-emulator agreement. Results:\r\n- November 2021 test run (MWGR) 347053 - RPC noise only, 76661 OMTF muon candidates checked, no mismatches\r\n- collision run 325117 (2018D, ZeroBias sample): mismatch ratio 0.01 - similar as in the previous version of the OMTF emulator,\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\nIt is not a backport", "branch": "master", "changed_files": 8, "closed_at": "1643788071", "comments": 10, "commits": 1, "created_at": "1643381944", "deletions": 62, "labels": ["l1-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "983fc63ebd0ef2c38a69060248d43a400d348661", "merged_at": "1643788071", "merged_by": "cmsbuild", "milestone": "CMSSW_12_3_X", "number": 36827, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Fixes in the RPC clusterization in the L1Trigger/L1TMuonOverlapPhase1", "updated_at": "1643788072", "user": "kbunkow"}