{"additions": 11, "auther_ref": "hcal-tp-fix-saturation", "auther_sha": "6c0b179f86cd2d2ce39808a781bd99766a0f787b", "author": "christopheralanwest", "body": "Two changes to the HCAL trigger LUTs are implemented in this PR:\r\n\r\n- a bug fix for the size of the ngHE linearization LUTs (10 bits in 2017 -> 11 bits in 2018)\r\n- a switch from bare pedestals to effective pedestals\r\n\r\nTo avoid increased quantization errors as a consequence of the increased longitudinal segmentation after the HE upgrade, the energies that enter each trigger tower sum are represented with an additional bit of precision (11 bits) relative to the equivalent quantities in the legacy HE (10 bits). See the bullet \"Linearization LUT\" on page 23 of the [uHTR spec](https://cms-docdb.cern.ch/cgi-bin/DocDB/ShowDocument?docid=12306) for details. For the 2017 run, in view of the very compressed schedule for preparing Plan 1, it was requested that the HEP17 appear technically as similar to the legacy system as possible.\r\n\r\nThe change of the linearization LUT LSB to 1/16 GeV needed in order to implement the originally envisioned scheme has already been integrated (https://github.com/cms-sw/cmssw/pull/21756/commits/d95fcf402f3c0d7f0be723ee7924fcd04500dd66#diff-5e541a4bbf886fa4e796702c32e8fe71R10). But the maximum number of bits representing the (transverse) energy was not changed, effectively truncating the linearized transverse energy entering the trigger tower sum sum at 64 GeV rather than 128 GeV. This gives rise to spurious outliers in the RecHit/TP ratio. The plots below compare the trigger tower sum with the equivalent method 0 RECO quantity before and after the changes, using the RelValQCD_FlatPt_15_3000HS_13 samples [1] to emphasize the behavior at high p<sub>T</sub>. These plots were generated including the recently merged PR #22121, and impose a requirement of p<sub>T</sub> > 30 GeV, with saturated towers excluded.\r\n\r\n\r\nBefore changes | After changes\r\n---------------- | ----------------\r\n![m0_vs_tp_before_fix](https://user-images.githubusercontent.com/6534323/36355326-0e305a94-14a7-11e8-8e1d-1a71168bc192.png) | ![m0_vs_tp_after_sat_fix](https://user-images.githubusercontent.com/6534323/36355329-1820e0e6-14a7-11e8-84ee-041ef03b05fb.png)\r\n\r\nThe treatment of 2017 era is unchanged, aside from a change in the numbering of the bits used for generating ngHE depth feature bits; this functionality was not used in 2017.\r\n\r\nThe second change, a switch from bare to effective pedestals in LUT generation to take into account the effect of radiation damage on SiPMs, is negligible except for a modest effect in trigger tower 28. Though this change is logically unrelated to the first, since it modifies some of the same files as the first change, the effects are negligible, and has already been presented to L1 experts at a recent [L1 trigger primitives meeting](https://indico.cern.ch/event/704862/contributions/2891729/attachments/1599264/2534797/13FEB2018_cawest_trigger.pdf), it has been included here for simplicity.\r\n\r\nThis PR should only change quantities involving ngHE TP, and all changes should be small.\r\n\r\n[1] \r\n/RelValQCD_FlatPt_15_3000HS_13/CMSSW_10_0_0-100X_upgrade2018_realistic_v6_mahiOFF-v1/GEN-SIM-DIGI-RAW\r\n/RelValQCD_FlatPt_15_3000HS_13/CMSSW_10_0_0-100X_upgrade2018_realistic_v6_mahiOFF-v1/GEN-SIM-RECO", "branch": "master", "changed_files": 4, "closed_at": "1519199274", "comments": 13, "commits": 2, "created_at": "1518975515", "deletions": 7, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "db-approved", "fully-signed", "l1-approved", "orp-approved", "tests-approved"], "merge_commit_sha": "7941f5ff0c7a9f4e62a99d11c80b324d29414fa6", "merged_at": "1519199274", "merged_by": "cmsbuild", "milestone": "CMSSW_10_1_X", "number": 22262, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Hcal TP fix ngHE saturation + switch from bare to effective pedestals", "updated_at": "1519199274", "user": "christopheralanwest"}