{"additions": 224, "auther_ref": "NewPMInterface922", "auther_sha": "a3fffda5053a32e9abae460ff4838d70850543c5", "author": "Sam-Harper", "body": "Dear All,\r\n \r\nThis PR expands the interface of the E/gamma ElectronNHitSeedProducer which is our 2017 pixel match producer, which so far is only applied at HLT. In fact this PR only affects classes which currently are exclusively used in HLT although ultimately ElectronNHitSeedProducer will be used in RECO.\r\n \r\nThe interface expansion is fully backwards compatible and existing HLT configs will continue to give the exact same results. See this plot for the PM efficiency before and after the changes:\r\nhttps://sharper.web.cern.ch/sharper/cms/heep/2017/Jun14th/wp5OldIntVsNewInt.png\r\n\r\nThe interface changes also do not require confdb reparses.\r\n\r\nThe goal is to be able to put new pixel match cuts in and to allow those cuts to be arbitrary so we can adapt to the data (and also I would like a small fix for the V2 menu) without having to do another PR (hopefully).  \r\n\r\nImplementation:\r\nclass TrajectorySeed::MatchingCuts is now a pure virtual base which allows us in the config to specify a different type of matching cut for a given pixel hit. This is controlled by a new parameter \"version\" which tells us what MatchingCut object to use.  I introduced two new MatchingCut objects, V2 and V3 (V1 is the original). \r\n \r\nV2 is extremely flexible and have cuts as a function of eta,et, charge, nr of clusters with arbitrary functions. \r\nV3 corresponds to a simplified version of how we thing we should currently cut (linearly decreasing cut till some eta threshold at which point the cut becomes constant). \r\n \r\nThis gives us sufficient flexibility to adapt to whatever the cuts are needed to be in the future without having to have c++ code changes. \r\n \r\nThe V2 class reuses the setup the EgammaHLTPixelMatchVarProducer uses. Some minor clean up was needed of this mechanism which is in EgammaPixelMatchParamObjects.h (it was moved from the EgammaHLTProducers to the EgammaElectronAlgos as a result).\r\n \r\nFinally an internal class of TrajSeedMatcher, HitInfo was updated to be able to better interface with the V2 method. Now it has all the information needed to apply the matching cuts, which is done after construction. Due to this extra information pos_ was renamed hitPos_ to distinguish it from the supercluster eta/phi it now contains. Additionally the class itself was renamed to SCHitMatch better reflect what it was (really didnt like hit.eta() appearing in functions with it being the SC eta).  Finally because this object now had the sc et / eta inside it, it is no longer necessary to also pass that with the object to the matching functions so this was cleaned  up.\r\n\r\n", "branch": "master", "changed_files": 2, "closed_at": "1498800268", "comments": 41, "commits": 1, "created_at": "1497555873", "deletions": 93, "labels": ["comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "bc980bc037cfec68579b6b035fa60a4f27032e3b", "merged_at": "1498800268", "merged_by": "cmsbuild", "milestone": "CMSSW_9_3_X", "number": 19263, "release-notes": [], "review_comments": 9, "state": "closed", "title": "New Interface for E/gamma 2017 Pixel Matching", "updated_at": "1498800268", "user": "Sam-Harper"}