{"additions": 1468, "auther_ref": "noTTRHMerged2", "auther_sha": "ec3079436138f84ec59eaf5f1cc42075c50bc9c9", "author": "VinInn", "body": "see https://its.cern.ch/jira/browse/CMSTRACK-93 for a historical perspective\n\nTTRHs have been removed from Tracker code for good.\nThe migration has required three major interventions:\n1) Percolating the new hit cloner down to the fits\n2) use std::shared_ptr instead of the custom intrusive reference-counting base class\n3) change the way InvalidHits are handled: this causes a minor regression (see below)\n\nPending issues\nmore short cuts in the configuration of the hit builder in\nsrc/RecoParticleFlow/PFTracking/plugins/GoodSeedProducer.cc: /// FIXME FIXME CLONE\nsrc/RecoMuon/GlobalTrackingTools/plugins/GlobalTrackQualityProducer.cc: // FIXME FIXME CLONE!!!\nnot cloning with the trajectory direction in\nsrc/Alignment/ReferenceTrajectories/plugins/TwoBodyDecayTrajectoryFactory.cc: // FIXME FIXME CLONE\nsrc/Alignment/ReferenceTrajectories/src/ReferenceTrajectory.cc: // FIXME FIXME CLONE\nsrc/RecoMuon/CosmicMuonProducer/src/CosmicMuonSmoother.cc: // FIXME FIXME CLONE !!!\nsrc/RecoMuon/CosmicMuonProducer/src/CosmicMuonSmoother.cc: // FIXME FIXME CLONE !!!\nAlignment will be fixed in a separate PR (would have been already done if ReferenceTrajectory (against all CMS rule for DataObjects) was not \"fitting\" itself in the constructor.\n\nPerformances:\nIt is neither slower not more memory hungry than the current version\n\nRegression:\nCurrent InvalidTransientTrackingRecHIt allows for hits w/o \"Det\" created on layers. They refer directly to the layer's surface.\nThis information is lost when transformed in InvalidTrackingRecHit at the time the Trajectory is converted in TrackCandidate.\nSuch hits are then removed during the first fit of the TrackCandidate in the TrackProducer.\nIn the new code these hits are now captured by a new class InvalidTrackingRecHItNoDet which in principle can survive (with its surface pointer fully valid) till output.\nIn order to minimize regressions hits with \"noDet\" are now removed during the Trajectory to TrackCandidate conversion\n(in the class Traj2Cand).\nThis causes anyhow a minor regression whose origin is still unclear (most probably some sort of Candidate cleaning step).\nThis regression can be fully reproduced in current code applying the very same procedure (remove \"noDet\" in Traj2Cand).\nThe general wisdom among tracking experts is that it is the correct thing to do. \nTracking POG plans to investigate later if propagating these hits further will bring any benefit.\nIt should be noted that these hits have to be removed anyhow before output as the surface pointer cannot be restored in input\n(for refit purposed for instance)\n\nNon conformances:\nThe code still includes several debug checkpoints in form of assert and protected cout\n\npassed all tests including extensive reco and HLT at high pileup.\n\nNext iterations will include\n1) fix Alignment code (if really necessary)\n2) cleanup obsolete code: try to merge use cases\n3) try to optimize memory churn still present in particular during Ckf-Pattern\n3) remove or properly protect all debug checkpoints\n4) fix short cuts in configuration (eventually as part of a more general cleanup of configuration and event setup use)\n", "branch": "CMSSW_7_1_X", "changed_files": 150, "closed_at": "1398229483", "comments": 34, "commits": 104, "created_at": "1397559237", "deletions": 2231, "labels": ["alca-approved", "analysis-pending", "comparison-available", "dqm-pending", "pending-signatures", "reconstruction-approved", "simulation-pending", "tests-approved"], "merge_commit_sha": "d02a422a183814f81a34508a67c3aea21190ac8b", "merged_at": "1398229483", "merged_by": "ktf", "milestone": "CMSSW_7_1_0_pre7", "number": 3344, "release-notes": [], "review_comments": 24, "state": "closed", "title": "TTRHs removed from Tracker code for good.", "updated_at": "1468410394", "user": "VinInn"}