{"additions": 4019, "auther_ref": "devNewValidation_90X_Customise", "auther_sha": "30b66fb800f2789d89760b6413144551b03c3eca", "author": "abbiendi", "body": "This PR superseded #16646, which had been automatically ported to 90X from the previous PR #15153  (let's hope this time it will make through swiftly !!)\r\n\r\n-- Summary description\r\n\r\nThis PR contains new code and configuration files, introduced alongside with the current code and cfgs. The new code is not yet used in the standard workflows, i.e. nothing should change anywhere.\r\n\r\nA customization function will allow the new and the default code to run (both) for a given prerelease cycle in few selected muon RelVals. This will allow for a smooth transition between the current and the new validation code. The plan foresees to deploy the new validation at the prerelease following the one with duplicate validations. At that point the old code should be possibly removed.\r\n\r\nThe new code and configuration has been flagged by a prefix \"New\" in filenames, class/module names, when it is a duplicate of the current production code.\r\n\r\nFeatures of the initial PR:\r\n\r\n- much clearer code, easier maintenance and developments, some technical improvements\r\n- new plots for performance vs PU, charge misid ...\r\n- removal of a few unused plots\r\n- improved settings of the histogram binning/ranges for different types of muons. All such settings contained in a cfg file \"histoParameters_cff.py\".\r\n- better choice of names for histograms, corrected labels etc...\r\n- better use of selectors to clean up the cfgs\r\n- slimmed/clearer cfgs as a consequence of the above changes\r\n- kept legacy configurations for use of TrackAssociatorByPosition in separate files, avoiding to clutter the main cfgs as in the current version\r\n- new default setting of the MuonAssociatorByHits to flag as fakes global muons with tracker and muon hits matched to different particles: this will produce sensible fake rates (much higher than what is obtained currently). Side note: the current configuration has always lived for historical reasons.\r\n\r\nAdded features to the current PR:\r\n- removed the pointer to DQMStore (as requested)\r\n- synchronized the New validation code to the current code, after parallel developments in the last few months (for upgrades)\r\n- customization function to activate the New validation for the temporary period of coexistence with the old one (thanks to Carlo Battilana)\r\n\nAutomatically ported from CMSSW_9_0_X #17489 (original by @abbiendi).\nPlease wait for a new IB (12 to 24H) before requesting to test this PR.", "branch": "master", "changed_files": 28, "closed_at": "1489645927", "comments": 30, "commits": 28, "created_at": "1488454480", "deletions": 17, "labels": ["comparison-available", "dqm-approved", "orp-pending", "pending-signatures", "simulation-pending", "tests-approved"], "merge_commit_sha": "47f557bcf4115d0e160a511d35c7465c35bce583", "merged_at": "1489645927", "merged_by": "davidlange6", "milestone": "CMSSW_9_1_X", "number": 17723, "release-notes": [], "review_comments": 16, "state": "closed", "title": "Improved muon track validation (new code + customization)", "updated_at": "1489657772", "user": "cmsbuild"}