{"additions": 0, "auther_ref": "frontier", "auther_sha": "4e27625f5ee8056c93a94987425e32db0bab158d", "author": "ojeda", "body": "There are 2 main commits:\n- The first adds a Python DBAPI module for the frontier_client library (based on a ctypes binding).\n- The second one makes SQLAlchemy aware of Frontier via the Python DBAPI as an Oracle subdialect.\n\nThis is required for the new scripts for the new design of the Conditions DB.\n\nI checked the commits by building/installing with PKGTOOLS/cmsBuild and then in one of the latest 70X IBs I copied the new toolfiles into the available/ folder, then run scram setup and cmsenv and tested that I can use SQLAlchemy and the frontier modules. In any case, these changes should not break frontier_client nor py2-sqlalchemy. The former, because it just adds some Python files. The second, because it is implemented as an independent subdialect (there is no modification of any of the original SQLAlchemy code, apart from the adding of a dialect).\n\nTherefore, updates to frontier_client should be not affected by the new files (unless the frontier_client C library changes the interface) and updates to py2-sqlalchemy would require updating the files to setup the subdialect, if required (e.g. if  SQLALchemy restructures its internals and the like).\n\nIn the future we may have the Frontier Python DBAPI inside the official frontier_client release, so we could remove the patch from here. And later on, we could even ask SQLAlchemy to include our small dialect if we think it is interesting. For the moment, though, this will allow us to test our scripts easily (which depend on this PR) and later on make another PR for CMSSW for the scripts themselves.\n\nSending now to be discussed in tomorrow's DORP.\n", "branch": "IB/CMSSW_7_0_X/stable", "changed_files": 0, "closed_at": "1386581857", "comments": 0, "commits": 0, "created_at": "1385651393", "deletions": 0, "labels": [], "merge_commit_sha": "82a5aae2503fea895c1ca3ca0a59f6a0a7bd5cb0", "merged_at": "1386581857", "merged_by": "davidlt", "number": 283, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Add Frontier support for Python (DBAPI) and SQLAlchemy", "updated_at": "1386581858", "user": "ojeda"}