{"additions": 581, "auther_ref": "disapperingMuonsSkim_13_0_0", "auther_sha": "8ee85127e5c444834d7b2387db1eafb975881dbe", "author": "revering", "body": "#### PR description:\r\nCreated a skim filter used for a search for disappearing muons (https://icms.cern.ch/tools-api/restplus/relay/piggyback/notes/AN/2020/214/files/3/download). The filter uses a tag-and-probe method to select high-quality muons which pair with probe tracks to form an invariant mass near the Z-peak, then extrapolates the probe track to the muon chambers and selects events with missing or low energy standalone muons nearby. Options are included to also select for control regions with same-sign tag/probe pairs or invariant masses away from the Z mass.\r\n\r\nIn the full analysis we need hit level data from the HCAL to fully establish our signal region, so this skim selection is used to choose a subset of interesting RECO events to keep the complete HCAL hit information in. This selection is designed to apply to AOD level files so that in existing runs we can choose events to reconstruct from RAW data without needing to re-reco the entire dataset. With the default options, roughly 0.5% of events in the single muon 2018 UL dataset are selected.\r\n\r\nFor an additional check of the expected event rate and data size, we ran ran the filter on a run 3 relVal RECO MC dataset [/RelValZMM_14/CMSSW_13_0_0_pre3-PU_130X_mcRun3_2022_realistic_v2-v1/GEN-SIM-RECO](https://cmsweb.cern.ch/das/request?input=dataset%3D%2FRelValZMM_14%2FCMSSW_13_0_0_pre3-PU_130X_mcRun3_2022_realistic_v2-v1%2FGEN-SIM-RECO&instance=prod/global). This DY->mumu process should be the most significant source of events passing our filter.\r\nAfter keeping the full hbhe and ho hit collections, the relVal file had 2574 events in 1.7 GB and the post-filter file had 77 events in 60 MB, corresponding to a pass rate of 3% and an expected dataset size of 10 TB at 300 fb^-1. As an additional cross-check, we ran the skim on run 2 AOD data and confirmed a 0.5% pass rate, likely due to the inclusion of non-DY processes in the overall singlemuon dataset with lower acceptance rates than Z->mumu.\r\n#### PR validation:\r\nI ran the skim on a set of DY MC files and plotted each cut to confirm that the selections are correctly applied. I also ran our signal analyzer on the skimmed and non-skimmed MC to verify that there were no events cut by the filter which would have otherwise passed our signal or control region selections.\r\n", "branch": "master", "changed_files": 4, "closed_at": "1679235099", "comments": 35, "commits": 8, "created_at": "1675271311", "deletions": 0, "labels": ["fully-signed", "tests-approved", "pdmv-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "653ed2e65279d0b32c9f7f7af9bcbce9426495c8", "merged_at": "1679235099", "merged_by": "cmsbuild", "milestone": "CMSSW_13_1_X", "number": 40666, "release-notes": [], "review_comments": 20, "state": "closed", "title": "Added skimming filter for disappearing muons", "updated_at": "1679235100", "user": "revering"}