{"additions": 6217, "auther_ref": "taskInitialVersion21", "auther_sha": "dc6030ab877c731f4fce2a5a727ac9bb7af46ed6", "author": "wddgit", "body": "This includes the initial implementation of the Task feature in the Core CMS configuration code. It allows creating Tasks, adding modules to them, and associating them to sequences, paths, end paths, and the schedule. In many ways Tasks behave like Sequences except that the order modules appear on Tasks does not matter. New unit tests were added to test the Core code changes.\r\n\r\nThis PR also includes changes to migrate a lot of configuration code to use Tasks. Large parts of PAT configuration code, all PAT tools, and some parts of RECO code were migrated. In particular, code that was used by runTheMatrix.py tests, IB unit tests, and other test configurations and that was already using unscheduled execution mode was migrated. Although large numbers of configuration files were migrated, an even larger number of configuration files were not migrated yet. There remains much migration work to be done. But the unmigrated configurations are not broken by this PR and should continue to run successfully. At a future date, the other code can be incrementally migrated as resources become available to do the work.\r\n\r\nThis PR modifies the convertToUnscheduled function to work properly with the new Task feature. EDProducers and EDFilters removed from paths and endpaths are automatically placed on a Task.\r\n\r\nThere are also changes to ConfigBuilder.py.\r\n\r\nThis is the third PR submitted for this set of changes. The first 2 were closed to make significant revisions. The first one was PR #16538 and there are many comments from Chris in that PR which have all been addressed in separate commits after the first 3 commits. The second one was PR #16925, which contains Slava's comments and a lot of discussion that followed. (Also PR#17430 which was the auto port to 9_1_X when it opened)\r\n", "branch": "master", "changed_files": 228, "closed_at": "1490121869", "comments": 51, "commits": 32, "created_at": "1488822939", "deletions": 2091, "labels": ["analysis-pending", "comparison-available", "core-approved", "dqm-pending", "hlt-pending", "operations-pending", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-rejected"], "merge_commit_sha": "3f02fc46bb777969fcd88ab7d707241050353762", "merged_at": "1490121869", "merged_by": "davidlange6", "milestone": "CMSSW_9_1_X", "number": 17801, "release-notes": [], "review_comments": 16, "state": "closed", "title": "Initial Implementation of Tasks in CMS Configurations ", "updated_at": "1501678787", "user": "wddgit"}