{"additions": 428, "auther_ref": "StopCauseAndCCCTF", "auther_sha": "265e83bbe1d068479a98f0a083db2778f4c5ae3b", "author": "rovere", "body": "## Stop reason for a track/trajectory\n\nEach TrajectoryFilter has been equipped in such a way to\ninject into the Trajectory or TempTrajectory the reason that\nstopped the propagation of the trajectory during the pattern\nrecognition. This work is in preparation of future work that\nwill propagate this information down the chain directly into\na reco::TrackBase, so that more detailed studies can be made\non the reasons of the stop.\n## CCC as a Trajectory Filter\n\nThe CCC has been implemented as a TrajectoryFilter, in order to give\nmore flexibility to the user in selecting possible bad (from the\nCluster Charge point of view) hits. The final trajectory, if discarded due \nto eccessive number of bad CCC hits, will anyhow contain the\nwould-have-been removed 2 hits, since they passed all the other estimators. \nThe user has the possibility to disentangle lost hits from bad for CCC\nand apply different criteria with different thresholds during Patter\nRecognition and at filtering level.\n\n**NOTE** \nThe CCC as Trajectory filter has been turned off, so that we should expect no changes and have this PR integrated quickly. The usage and tuning of this new features will be done on top of this. Private results are anyway extremely encouraging (w.r.t to the hit collection efficiency).\n", "branch": "CMSSW_8_0_X", "changed_files": 33, "closed_at": "1448968261", "comments": 19, "commits": 16, "created_at": "1448534461", "deletions": 93, "labels": ["comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "50d51d0d7e485160b540939c6499f8eff9f11c88", "merged_at": "1448968261", "merged_by": "cmsbuild", "milestone": "CMSSW_8_0_X", "number": 12576, "release-notes": [], "review_comments": 4, "state": "closed", "title": "Stop cause and ccctf", "updated_at": "1448968261", "user": "rovere"}