{"additions": 18158, "auther_ref": "CMSSW_8_1_X", "auther_sha": "e92461a98ccf8492b7033eefa7eafb8ee9e48ad5", "author": "lathomas", "body": "Update of the beam halo filter. \n\nA. Methods using halo triggers (L1 or HLT) information are not used anymore. \n\nB. The filter is now based on the presence of a calo deposit compatible with a halo hypothesis. \nB.1 First, halo cluster candidates are built using e.g CSCHaloAlgo::GetHaloClusterCandidateEB for EB clusters.\n(e.g. RecoMET/METAlgorithms/interface/HaloClusterCandidateEB.h). \nSome local isolation criteria are required. A loose H/E or E/H cut is also applied in most of the cases. \nThe criteria were tuned to reach a cluster efficiency of more than 99% for interacting beam halos. \n\nB.2 To be flagged as a beam halo deposit, the cluster candidates must either: \na) Have a pattern compatible with a halo hypothesis (timing conditions, large size in eta in the barrel,...). This pattern finding is done e.g. by the method:\nCSCHaloAlgo::EBClusterShapeandTimeStudy.\nor \nb) be matched with a CSC segment (dphi, dR, dt conditions). The matching is performed by the method:  CSCHaloAlgo::ApplyMatchingCuts. \n\nC. Two new versions of the filter have been added to the BeamHaloSummary (in DataFormats/METReco): \n-CSCTightHalo2016: If any cluster is flagged as a halo deposit by either a) OR b), in any region, the event is declared as halo. \n=> The fake rate was estimated on data to be 0.4% (JetHT)/0.2% (MuonEG), for an efficiency of around 96% for true beam halos. \n=> The fake rate and efficiency of the 2015 version of the filter were estimated to be 0.8%/85%. \n\n-CSCSuperTightHaloId2016:  If any cluster is flagged as a halo deposit by a) AND b), in any region, the event is declared as halo\n=> The fake rate is less than 0.01% for an efficiency of 85%. \n\nD. Variables based on CSC information only such as the size of the longest chain of flat segments and the presence of an opposite endcap pair of flat segments are still stored in CSCHaloData. \nThese variables are not used in the standard filter, since passive (i.e. non interacting) halo tracks are believed not to affect the event reconstruction and that the probability to  observe such a track on top of a good collision event is not negligible and could go up to several percents in 2016. \nThey could however still be of interest for specific analyses such as heavy stable particles searches, where non interacting halos are an important background. \n\nE. Rechit cleaning: \nThe CSCHaloData also stores a RefVector with all the Ecal and HBHE Rechits associated to a halo cluster.\nA new producer CaloRecHitsBeamHaloCleaned (RecoMET/METProducers) was added, that simply produces a list of rechits after beam halo cleaning. \nFor now, this cleaning is not performed for the offline reconstruction but will be used by some MET trigers. \n\nF. HLT version of the filter. \nIt was noticed in 2015 that a sizeable fraction of the rate of HLT_PFMET170 was due to beam halos. The situation is expected to get worse this year. \nIt is therefore planned to use a cleaning module to get rid of beam halos events. \nThe same code as for the offline filter is used but with higher et thresholds in some cases. Conditions based on the rechit time are not considered, as the rechit time at HLT doesn't appear to be reliable.\nThe performances of the cleaning were measured on three datasets: \n-MET, where half of the events passing the HLT_PFMET170_HBHECleaned trigger are not passing the trigger after cleaning \n-JetHT, where a halo-like cluster is found in only 0.3% of the events, out of which 2/3 are real beam halos. \n-MuonEG, where a halo-like cluster is found in less than 0.1% of the cases. \nThe proper trigger sequence will be communicated soon to the TSG group. \n\nReferences: \nPresentation at the TSG meeting (March 16th): https://indico.cern.ch/event/504435/contribution/2/attachments/1244481/1832023/beamhalo.pdf\nPresentation at the CSC meeting (Jan 13th): https://indico.cern.ch/event/482724/contribution/29/attachments/1211233/1766683/bhreport.pdf\n", "branch": "CMSSW_8_1_X", "changed_files": 803, "closed_at": "1459790886", "comments": 9, "commits": 344, "created_at": "1459189883", "deletions": 1147643, "labels": ["alca-pending", "analysis-pending", "comparison-pending", "core-pending", "db-pending", "fastsim-pending", "geometry-pending", "l1-pending", "orp-pending", "pdmv-pending", "pending-signatures", "reconstruction-rejected", "simulation-pending", "tests-pending", "visualization-pending"], "milestone": "Next CMSSW_8_1_X", "number": 13849, "release-notes": [], "review_comments": 32, "state": "closed", "title": "CSC Halo Filter update: HLT and offline", "updated_at": "1459790935", "user": "lathomas"}