{"additions": 112, "auther_ref": "Phase1-HECollapse", "auther_sha": "3935d98de0180002ced7cc1475f478c973dc7d7b", "author": "kpedro88", "body": "Despite the existence of an operational workflow for the full HE upgrade for more than a year now, certain parties remain unready to handle the increased depth segmentation.\r\n\r\nTo allow validation of the \"collapsed\" depths (after #21784 updated the reco geometry), a separate modifier `run2_HECollapse_2018` is introduced. This modifier reproduces many of the changes from `run2_HEPlan1_2017`. It is *not* included in the `Run2_2018` Era by default, but can be chained with it in a cmsDriver command. Example 2018 workflows with this chaining are added: 10824.6,11024.6,11224.6.\r\n\r\n~~It is necessary to use PreRecHits for CaloTowers with this modifier, because the creation of CaloTowers relies on several HcalTopology functions that only work with the real topology, not the fake collapsed topology.~~\r\n\r\nThe CaloTower algorithm is updated with a boolean parameter `HcalCollapsed` to indicate that the tower 28/29 splitting should use the hardcoded condition `depth()==3` instead of the topology function (which doesn't work for the collapsed hits). The `HcalPhase` is set back to 0 to restore the old inner/outer energy splitting condition. These changes are propagated to HLT along with changes for thresholds (originally from #21855).\r\n\r\nThis PR cannot be fully tested until the above updated geometry is included in a GT. It was tested locally using `--geometry Extended2018` and the expected results were seen, i.e. only 3 depths in the final RecHit collection.", "branch": "master", "changed_files": 15, "comments": 54, "commits": 7, "created_at": "1515768976", "deletions": 26, "labels": ["code-checks-approved", "comparison-pending", "hlt-pending", "operations-pending", "orp-pending", "pdmv-pending", "pending-signatures", "reconstruction-pending", "tests-started", "upgrade-pending"], "milestone": "CMSSW_10_0_X", "number": 21842, "release-notes": [], "review_comments": 1, "state": "open", "title": "Modifier & workflow for collapser for HE 2018, CaloTower fixes", "updated_at": "1516197975", "user": "kpedro88"}