{"additions": 56, "auther_ref": "Phase1-DbHardcode4", "auther_sha": "8bb6f5a8ae890aa960895722f16a3f02b8ced10b", "author": "kpedro88", "body": "The major change in this PR is new SiPM parameters (gain, photoelectronsToAnalog, dark current, crosstalk). We were informed about a month ago by the hardware experts that the SiPMs were run with an effective overvoltage of ~4.4V during test beam, but subsequent studies found that an overvoltage of 3V maximized signal to noise. Many SiPM parameters depend on voltage, so they need to be updated from the initial testbeam analysis to get better agreement with expected running conditions.\r\n\r\nWe were sent some pedestal runs from b904, which I analyzed (with the help of numerous experts) to get an average set of parameters. Slides detailing this analysis can be found here: [sipm_condition_analysis.pdf](https://indico.cern.ch/event/586254/contributions/2361862/attachments/1366614/2073007/sipm_condition_analysis.pdf).\r\n\r\nI also fixed a few minor bugs:\r\n1) Way back in #13861, I dumped run2_mc parameters for HCAL and made per-subdetector averages to use as defaults for the hardcode conditions (for development purposes only). At the time, I didn't realize database pedestal values were in ADC, rather than the fC values assumed by the hardcode conditions. This PR adjusts the average values so they're actually in fC (using functionality from #16499). Again, this is for development only, and has no impact on any official workflows or results.\r\n2) Also back in #13861, I didn't account for depths 3 and 4 for HF when assigning gains, leading to a very minor discrepancy (depth 4 has gain=0.14 instead of 0.135). This has been fixed and will be updated in the database.\r\n\r\n@abdoulline, I hope we can update all the database conditions at once...\r\n\r\n@lihux25, it might be necessary to recheck the ZS thresholds with the new parameters. I would suggest not rerunning the whole study, but just check the existing \"best\" threshold you found, and then a slightly higher or lower value (to see how things change). To use the hardcode conditions in your config, merge this PR (in any recent IB) and then:\r\n```\r\nfrom SLHCUpgradeSimulations.Configuration.HCalCustoms import load_HcalHardcode\r\nprocess = load_HcalHardcode(process)\r\nprocess.es_hardcode.useHEUpgrade = cms.bool(True)\r\nprocess.es_hardcode.useHFUpgrade = cms.bool(True)\r\n```\nAutomatically ported from CMSSW_8_1_X #16526 (original by @kpedro88).", "branch": "CMSSW_9_0_X", "changed_files": 6, "closed_at": "1479322133", "comments": 3, "commits": 6, "created_at": "1479285682", "deletions": 45, "labels": ["alca-approved", "comparison-pending", "orp-pending", "pending-signatures", "simulation-pending", "tests-started"], "merge_commit_sha": "5b95302b6cec9c63d8bde456040fa29e6a03d3d4", "merged_at": "1479322133", "merged_by": "davidlange6", "milestone": "CMSSW_9_0_X", "number": 16607, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Update SiPM parameters and fix a few bugs in hardcode conditions", "updated_at": "1479322133", "user": "cmsbuild"}