{"additions": 5413, "auther_ref": "CMSSW_9_4_X_tau-pog_recoMiniAOD", "auther_sha": "8f6cfe6bb9e75ea1f3343046e4e6a5450e4066c4", "author": "cms-tau-pog", "body": "Dear colleagues, \r\n\r\nthis is a PR that implements full tau reconstruction on miniAOD input. This requires the elevation of a few classes to templates to cope with the different input formats with corresponding knock-on on several files. On top of the port it consists of the following minor fixes and improvements:\r\n\r\n   * Fix to avoid some (rare) crashes when running on RECO/AOD input, due to a lack of tracks (showing up in boosted tau reco),\r\n   * Fix and improvement of the filtering of pat::PackedCandidates -> better reproduction of isolation pt-sums based on miniAOD\r\n   * Tau PV and SV producers for MiniAOD with refits -> improved reproduction of tau lifetime related variables,\r\n   * A new plugin recovering charged hadrons from tracks not considered by PFlow using the 'lostTracks' collection  related to reconstruction of new decay modes (overall marginal effect on the performance),\r\n   * A new against-muon discriminant for miniAOD,\r\n   * A new tool to adapt the standard configuration to be run on miniAOD input with an example cfg configuration file, including for instance a tau seeding with raw AK4Jets as in RECO/AOD\r\n \r\nThe changes have been tested to give (nearly) identical results on a set of commonly used test samples, both on AOD and miniAOD input. Observed changes, mostly related to the MVA tauID output are small. Usual matrix tests show no peculiarities. (Note a significant fraction stopped with DAS_ERRORS for me).\r\n\r\nWe are preparing the same PR for 10X but would ask you already to integrate this request asap. The PR for 10X will most probably not come by this year any more. \r\n\r\nI'm explicitly adding @steggema and @mbluj  to this thread, who made the development and will be happy to comment further or to add assessments or clarifications. \r\n\r\nCheers,\r\nRoger", "branch": "CMSSW_9_4_X", "changed_files": 94, "comments": 17, "commits": 35, "created_at": "1513814062", "deletions": 1749, "labels": ["analysis-pending", "comparison-available", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-rejected"], "milestone": "CMSSW_9_4_X", "number": 21757, "release-notes": [], "review_comments": 5, "state": "open", "title": "Tau reconstruction on miniAOD input", "updated_at": "1514500939", "user": "roger-wolf"}