{"additions": 7, "auther_ref": "addFED25Handling", "auther_sha": "b6367d2be675e43b9f05304e61bc8d885edb94c3", "author": "RSalvatico", "body": "#### PR description:\r\n\r\nThis PR contains changes needed for the electron online reconstruction to be able to handle errors such as FED25 to flag malfunctioning Pixel modules. With respect to the current way of handling errors, which is maintained via the `isActive()` method\r\n\r\nhttps://github.com/cms-sw/cmssw/blob/754d4fbc8bf3e05df6de16937fe6f4d30f5d8699/RecoEgamma/EgammaElectronAlgos/src/TrajSeedMatcher.cc#L356\r\n\r\nthe new method allows us to catch cases where the flagging happens on a per-event basis (i.e., no need to mask those modules permanently via SiPixelQualityRcd).\r\n\r\nIn addition, if in the future a 2023 MC will be made where the FED25 error is used to simulate the BPIX issue (e.g., via a probability function), with these changes the online electron reconstruction code should be able to handle it correctly.\r\n\r\n#### PR validation:\r\n\r\nI observed an improvement in efficiency for electron triggers (such as HLT_Ele32_WPTight_Gsf) when running them with the proposed changes. The sample used for the test was a DY simulation where the issue in the faulty BPIX modules in layers 3 and 4 in 2023 was simulated at the level of the digitizer (i.e., the channels corresponding to the faulty modules produce an error FED25). Some plots can be found [here](https://cernbox.cern.ch/s/iB7yjoSbo3ne3Uf). Please note that the efficiencies are calculated using gen-level electrons and basically no selection, so on an absolute scale they can look low.\r\n\r\nThe PR also passed some basic runTeMatrix tests.\r\n", "branch": "master", "changed_files": 2, "closed_at": "1702647167", "comments": 18, "commits": 2, "created_at": "1702398340", "deletions": 5, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "tracking", "egamma"], "merge_commit_sha": "2a5a2808cce92fd1c38f18d9a88c3a5f0e83c90b", "merged_at": "1702647167", "merged_by": "cmsbuild", "milestone": "CMSSW_14_0_X", "number": 43555, "release-notes": [], "review_comments": 1, "state": "closed", "title": "Integrate FED25 handling in electron online reconstruction", "updated_at": "1702656681", "user": "RSalvatico"}