{"additions": 434, "auther_ref": "CMSSW_11_1_X_tau-pog_deadECAL", "auther_sha": "84762b7b9999e9239444467d40cba6cf3d13bca1", "author": "cms-tau-pog", "body": "#### PR description:\r\nThis is backport of #29627 - actually exactly same development branch is used as in the original PR (already merged to master). Need of the backport is caused by the fact that target release series has been changed during review of the original PR.\r\n\r\nRestructured code of againstElectronDeadECAL discriminator to run on either AOD or miniAOD inputs:\r\n- add a version of the discriminant to run on top of pat::Taus to be used with miniAOD data samples;\r\n- use eta and phi of impact position of the leading PFChargedHadron on ECal surface instead of eta and phi of tau at the vertex (taking bending of track in the magnetic field and the zVertex into account); it can be disabled for backwards compatibility; \r\n- restructure the code in the way that AOD and miniAOD versions of the discriminant are just different instances of the same template code;\r\n- move code preforming extrapolation to the ECal surface from the againstElectronMVA algorithm to an auxiliary helper class which avoids code duplication;\r\n- add output of the againstElectronDeadECAL discriminant produced at AOD (already present in RECO/AOD workflow) to `slimmedTaus` in MiniAOD\r\n\r\nExpected some differences:\r\n- small difference in output of PFRecoTauDiscriminationAgainstElectronDeadECAL (AOD) discriminant because of enabled extrapolation to the ECAL (version with the extrapolation disabled gives identical results as one before the changes in this PR);\r\n- new tauID embedded into slimmedTaus in miniAOD.\r\n\r\n#### PR validation:\r\n\r\nTested several times during review of original PR basing on the same development branch.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nIt is backport of #29627 (actually it uses exactly same development branch as the original/mother PR)", "branch": "CMSSW_11_1_X", "changed_files": 15, "closed_at": "1590756645", "comments": 13, "commits": 10, "created_at": "1590651829", "deletions": 284, "labels": ["analysis-approved", "backport-ok", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "c10dfb68a6f0a9075dc80ca7b4c5faec5f0e93ca", "merged_at": "1590756645", "merged_by": "cmsbuild", "milestone": "CMSSW_11_1_X", "number": 30009, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Restructured code of againstElectronDeadECAL tauID (11_1_X)", "updated_at": "1590756645", "user": "mbluj"}