{"additions": 27, "auther_ref": "from-CMSSW_12_2_X_2022-03-01-2300-unify-matcher-me11", "auther_sha": "b170c61b931eb6bbc9ea8285b1c3223367407d26", "author": "sifuluo", "body": "#### PR description:\r\n\r\nThis PR changed the ring index of A/C/LCTs in ME1a from 4 to 1, making the ME1a and ME1b be stored at the same container.\r\nThe function that calculate the GlobalPoint will take care of the ME1a entries based on the half-strip number of the LCT.\r\n\r\n\r\nPreviously the the CSCStubMatcher will process the A/C/LCTs and sort them by the CSCDetID of the SimHits they are matched to.\r\nBecause the DIGI-tier sample does not distinguish ME1a and ME1b for A/C/LCTs, detector information of SimHits has to be used to tell A/C/LCTs from ME1a and ME1b.\r\nBut there are cases when both ME1a and ME1b contain the SimHits but LCT is only reconstructed in either. So the LCT would end up in the wrong sorting index (the DetId).\r\nC/LCTs in ME1a and ME1b have different half-strip range, making them easily distinguishable. There is no need to separate ME1a and ME1b in the containers of CSCStubMatcher.\r\n\r\n#### PR validation:\r\n\r\nTested on 100k events of private produced muon gun sample.\r\nHere is a plot of ME1b chamber 1 LCT global points. There are distributions outside the block.\r\n[before.pdf](https://github.com/cms-sw/cmssw/files/8208416/before.pdf)\r\nIsolating those entries we found they are from SimHits at the edge.\r\n[before_wing.pdf](https://github.com/cms-sw/cmssw/files/8208584/before_wing.pdf)\r\nIf we tell whether a LCT is in ME1a or ME1b by the Half Strip, the problematic entries return consistent GlobalPoint with the SimHits.\r\n[before_correct.pdf](https://github.com/cms-sw/cmssw/files/8208590/before_correct.pdf)\r\nAfter this correction, the GlobalPoint of LCTs in ME1b chamber 1 becomes:\r\n[Correction.pdf](https://github.com/cms-sw/cmssw/files/8208734/RPhi_ME1b1.pdf)\r\nThe ME1a and ME1b LCTs are all in this plot while only the SimHit in ME1b are shown.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nN/A\r\n\r\n\r\n", "branch": "CMSSW_12_2_X", "changed_files": 1, "closed_at": "1647082403", "comments": 11, "commits": 1, "created_at": "1646760526", "deletions": 18, "labels": ["dqm-approved", "fully-signed", "tests-approved", "orp-approved", "backport-ok"], "merge_commit_sha": "214bf00881b344fd0c6913b7027fd4a8de935d86", "merged_at": "1647082403", "merged_by": "cmsbuild", "milestone": "CMSSW_12_2_X", "number": 37179, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Make both ME1a and ME1b LCT (A/CLCT) sorted into ring 1.", "updated_at": "1647082403", "user": "sifuluo"}