{"additions": 18, "auther_ref": "CMSSW_9_3_0_pre3/sign854/stripMultiplicity", "auther_sha": "d2c61cb0c82c722bbfa1fb5938c4aeb687ae2f14", "author": "slava77", "body": "DPGAnalysis/SiStripTools/interface/Multiplicities.h has different class data member content depending on the compilation mode (used for dictionary generation or for execution in algorithms at run time). This PR makes the layout for common data members to be the same.\r\nThis should hopefully resolve https://its.cern.ch/jira/browse/CMSTRACK-151\r\n\r\nThis is meant to solve the following problem\r\nWe frequently have SiStrip DQM plots coming and going altogether in ```AlCaReco/Run summary/SiStrip/MechanicalView``` folder.\r\nThese are produced by SiStripCalZeroBiasMonitorCluster, which is running in pathALCARECOSiStripCalZeroBias right after LargeSiStripClusterEvents.\r\nThe reason for empty plots is that an otherwise the same setup can have this module running when needed or not running at all by simply rerunning cmsRun with the same config.\r\n\r\nThe most direct reason for SiStripCalZeroBiasMonitorCluster to be on/off is that LargeSiStripClusterEvents filter can be on or off (while other modules preceding in the path appear to give consistently reproducible results).\r\n\r\nI was not able to get a setup that leads to a reproducible bad behavior to be able to confirm from first principles where the problem is.\r\nThe only meaningful reason that I could see for this behavior was in this duality of the data layout in SingleMultiplicity class.\r\nNote that the problem did not show up at noticeable level until December 9 2016,\r\neven though the relevant change in the member data layout happened in 2014 in #3094.\r\nMost likely the appearance of the issue is related to #16821 merged Dec 5.\r\n\r\nThe evidence of a fix to the problem is based on rerunning [extended] short matrix several times and on different machines to have better sampling using CMSSW_9_3_0_pre3 as the baseline. \r\n- the baseline setup has workflows with differences corresponding to SiStripCalZeroBiasMonitorCluster going off\r\n- the baseline+this PR has no workflows with differences corresponding to SiStripCalZeroBiasMonitorCluster going off\r\n- comparisons of baseline with \"baseline+thisPR\" show workflows where the baseline histograms are empty (SiStripCalZeroBiasMonitorCluster is off) while they are filled in \"baseline+thisPR\", which is the expected behavior of the fix.\r\n\r\n\r\nA better solution is to properly decouple classes defined in DPGAnalysis/SiStripTools/interface/Multiplicities.h to be data formats and update the logic of ByMultiplicityEventFilter.\r\nThis will also remove the self-aware data product violation  mentioned already in https://github.com/cms-sw/cmssw/pull/16821#issuecomment-263988601\r\n", "branch": "master", "changed_files": 2, "closed_at": "1501821890", "comments": 13, "commits": 1, "created_at": "1501779351", "deletions": 29, "labels": ["analysis-pending", "comparison-available", "orp-pending", "pending-signatures", "tests-approved"], "merge_commit_sha": "4b4fc06074276001fdb8ef38cf2ef8d8d6a04000", "merged_at": "1501821890", "merged_by": "cmsbuild", "milestone": "CMSSW_9_3_X", "number": 20050, "release-notes": [], "review_comments": 0, "state": "closed", "title": "attempt to fix SiStrip DQM reproducibility issue: allign members common to root and full c++", "updated_at": "1501821890", "user": "slava77"}