{"additions": 113, "auther_ref": "feature_ElectronReco_TowerHoE_1040pre1", "auther_sha": "c1c267cccd84483932309c3ff841d64b9d0f8a63", "author": "brentstone", "body": "We are proposing to reconstruct new ecalDriven electrons with H/E (cone) > 0.15 and H/E (tower behind SC) < 0.15. \r\n\r\nWe spoke on 11/30 to the RECO group regarding these changes: https://indico.cern.ch/event/776884/contributions/3232028/attachments/1763017/2861031/EgammaReco_11_30_18.pdf.\r\n\r\nThe issues mentioned in the talk have been resolved with a nice simple solution. No original electrons are lost; only new ones are gained.\r\n\r\nAs mentioned in the talk linked above, this change was tested on three samples: a JetHT data sample, Egamma data, and ttbar RelVal MC. The file size increases are marginal. JetHT increases by 0.6% in MINIAOD and 0.03% in AOD. Egamma increases by 0.07% in MINIAOD and 0.02% in AOD, while sometimes fluctuating to - 0.03%. Ttbar fluctuates as well, experiencing 0.2% increases to -0.005% decreases in both MINIAOD and AOD.\r\n\r\nIn 1000 events, we gain 99 electrons in JetHT, 18 electrons in Egamma, and 46 electrons in ttbar.\r\n\r\nThe timeReports show that the timing increase by including these changes is marginal. The text files of these reports are provided as attached files.\r\n[timeReport_TTBAR.txt](https://github.com/cms-sw/cmssw/files/2655948/timeReport_TTBAR.txt)\r\n[timeReport_JETHT.txt](https://github.com/cms-sw/cmssw/files/2655949/timeReport_JETHT.txt)\r\n[timeReport_EGAMMA.txt](https://github.com/cms-sw/cmssw/files/2655950/timeReport_EGAMMA.txt)\r\n\r\nThe changes have also been tested on a 1000 event sample of single-electron Radion->HH->bbWW->e nu qq. At 1 TeV, the electron reconstruction efficiency increases from 65% to 91%. At 3 TeV, the increase is from 33% to 73%. This change has the potential to improve boosted analyses with leptons and jets by quite a bit.", "branch": "master", "changed_files": 11, "comments": 14, "commits": 4, "created_at": "1544159496", "deletions": 41, "labels": ["code-checks-pending", "comparison-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-pending"], "milestone": "CMSSW_10_4_X", "number": 25440, "release-notes": [], "review_comments": 5, "state": "open", "title": "Reconstruct new electrons with H/E (cone) > 0.15 and H/E (tower) < 0.15", "updated_at": "1544640405", "user": "brentstone"}