{"additions": 1091, "auther_ref": "missingDictionaryFixes11", "auther_sha": "2ea2906dbf71393450eff3eb87761a3ce95a3325", "author": "wddgit", "body": "The changes here started when fixing the bug reported\nin issue 14242 where \"std::type_info*\" was incorrectly\nbeing reported as the type for missing dictionaries.\nWhile working on this, found several other problems in\nthis part of the code and made significant revisions to\nit.\n\nOne feature that is new is now dictionaries are checked\nfor all consumed types. In addition, the pre-existing\nchecking for dictionaries of produced types, present types,\nand types selected for output is done in a more consistent\nway with better and more consistent error messages.\n\nThese changes rely on the ROOT function TClass::GetMissingDictionaries\nmore than the previous version. A design choice was to\nuse this instead of developing and maintaining CMS specific\ncode to look for dictionaries for all the constituents\nof a class. This ROOT function currently does not work as we\nexpect and as part of this effort we submitted bug report\nJIRA-8208 to the ROOT bug tracking system. When this bug\nis fixed in ROOT the missing dictionary checking will find\nmore dictionaries to be missing.\n\nThis also includes addition of dictionaries necessary for\nrunTheMatrix to run successfully with the more thorough\ndictionary checking.\n", "branch": "CMSSW_8_1_X", "changed_files": 40, "closed_at": "1469594345", "comments": 33, "commits": 2, "created_at": "1468441056", "deletions": 376, "labels": ["alca-pending", "analysis-pending", "comparison-available", "core-approved", "db-pending", "l1-approved", "orp-pending", "pending-signatures", "reconstruction-approved", "simulation-approved", "tests-rejected"], "merge_commit_sha": "4937e4aba7fb3b0f5ff99dd0bbeea5e70b63989e", "merged_at": "1469594345", "merged_by": "davidlange6", "milestone": "Next CMSSW_8_1_X", "number": 15198, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Fix bugs in code that detects missing ROOT dictionaries", "updated_at": "1482170658", "user": "wddgit"}