{"additions": 1179, "auther_ref": "prop-fail-and-nans", "auther_sha": "eef793e4f2f261610ac0888ee2286d2f9137253e", "author": "trackreco", "body": "#### PR description:\r\n\r\nChanges introduced in this PR are mostly technical but they do include some bugfixes and improvements of corner cases that were potentially leading to failed propagations, Kalman updates and consequently to trashed/nan-ed output track parameters.\r\n\r\nFurther, there are some changes in standalone/ parts of the code, mostly introduction of interactive shell to be used for debugging.\r\n\r\n##### 1. Nan filtering\r\n\r\nIn MkBuilder::filter_comb_cands() add a flag allowing other TrackCands to be tested, not just the best one. If a later one passes, copy it over the first one as that will be the one used for backward fit/search or for export.\r\n\r\nProperly handle not-best TrackCands in filtering after backward search.\r\n\r\n- After backward search representation of TrackCand hits is branching at the bottom and they need to be re-connected for scoring / filtering algorithms to process them correctly.\r\n\r\n- Call nan filters and other config specified filters at the same time through definition of a lambda when both of them need to be run.\r\n\r\n##### 2. Propagation fail flag\r\n\r\n*** At this stage physics changing changes are not active, they are marked with PROP-FAIL-ENABLE comments. ***\r\n\r\nAdded  MPlexQI MkBase::m_FailFlag (parent class of MkFinder). One has to manually clear it when desired (before propagation).\r\n  Now only 0 and 1 are used ... could have different error codes, eg., failed to reach, step too large, etc.\r\n\r\nThe fail-flag mplex is passed into all propagation and propaget+kalman_op functions (barrel and endcap - there was limited handling with forced restore for barrel propagation before, state was not visible outside).\r\n\r\nAdded WSR_Failed as member of enum WithinSensitiveRegion_e\r\n  Handled in selectHitIndices() and findTracksCloneEngine() -> stop the candidate.\r\n\r\nWith this we can now stop also endcap tracks when they are about to reach apex. Until now endcap tracks went on looping. Another check done is how large the helix angle along the step was attempted (pi/2 forces error).\r\n  Other propToR/Z checks can be added / tried. fail codes, kamlnaOp fail\r\n\r\nIn backward fit the endcap fails are somewhat accidental -- trying to fix them does not really help as hits are already chosen. So we only do rollback in barrel.\r\n\r\nWe can probably remove \"can-reach-radius\" check in MkBuilder::fund_track_unroll_candidates()\r\n\r\nNote that Config::useTrigApprox = true -- reconsider.\r\n\r\nRetry backward-search with non-swapped first/second layers in the plan?\r\n  b-tagging efficiency / resolution / number of hits\r\n\r\n##### 3. In propagateToR reduce the dot-product correction for in-going tracks to prevent them from overshooting.\r\n\r\n##### 4. Consolidate debug printouts, introduce mkfit::g_debug for additional, top-level debug output control.\r\n\r\n##### 5. Changes in standalone/\r\n\r\nClarify --help and --all-seeds in usage, exit on --help.\r\n\r\nImplement mkFit::Shell to allow targeted, interactive debugging through ROOT prompt. Includes:\r\n- event navigation, iteration selection, processing flag setting;\r\n- options for processing of a single seed (or a sequence of seeds for seed indices) based on label or seed position before/after cleaning;\r\n- some track comparison functions.\r\n\r\n\r\n\r\n#### PR validation:\r\n\r\nMTV plots, compare blue (baseline) vs. black:\r\nhttp://uaf-10.t2.ucsd.edu/~mmasciov/MIC/updatedPR111/MTV_ttbarPU_mkFit_5iter_updatedPR111_update_fixPropagation/\r\n", "branch": "master", "changed_files": 32, "comments": 3, "commits": 1, "created_at": "1675401708", "deletions": 329, "labels": ["reconstruction-pending", "pending-signatures", "orp-pending", "tests-started", "code-checks-approved", "tracking"], "milestone": "CMSSW_13_0_X", "number": 40681, "release-notes": [], "review_comments": 0, "state": "open", "title": "[MkFit] Consolidate nan checks and filtering, expose propagation fail flag to steering code", "updated_at": "1675402118", "user": "osschar"}