{"additions": 37, "auther_ref": "fc-fixrecttopo", "auther_sha": "233cf0d3f32e79a45530775526f8e9376922b0ba", "author": "fabiocos", "body": "#### PR description:\r\n\r\nThe ```locaPosition```, ```localX``` and ```localY``` methods of ```RectangularMTDTopology``` do not provide, as naively expected, the center of a pixel as its reference position, but its left-bottom corner. This is counterintuitive and forces to some odd coding in the clustering algorithm. It is compensated by a shift by 0.5 pixel in the calculation of the cluster x and y coordinates in the corresponding DataFormat. In order to have a clean situation, the shift is moved from the cluster position calculation to the basic topology code itself.\r\n\r\nThis should have no net impact, given the limited use of these methods, and the fact that its use inside the BTL clustering is effectively dummy so far. In preparation of a further PR which updates the clustering code, I propose initially this update.\r\n\r\nWith the occasion, I update the local reconstruction validation code to properly use the cluster parameter estimator code to extract the position, without replicating its methods (which are going to change in next developments).\r\n\r\n#### PR validation:\r\n\r\nThe code was tested with single muon workflow 20903 (scenario D88), showing that the cluster resolution and pull remains consistent with the existing result. The shift in tracking hits position printed from debug statements looks consistent with the  proposed update of reference position.", "branch": "master", "changed_files": 5, "comments": 15, "commits": 2, "created_at": "1668176259", "deletions": 20, "labels": ["dqm-approved", "geometry-approved", "reconstruction-approved", "fully-signed", "tests-approved", "orp-pending", "upgrade-approved", "code-checks-approved"], "milestone": "CMSSW_12_6_X", "number": 40049, "release-notes": [], "review_comments": 0, "state": "open", "title": "MTD geometry and reconstruction: update locaPosition in RectangularMTDTopology and adapt cluster accordingly", "updated_at": "1668679852", "user": "fabiocos"}