{"additions": 30, "auther_ref": "mm_dev_hgcal_linking", "auther_sha": "d61292f50c501e3832b976efa67db15d0889dfc0", "author": "cms-ngt-hlt", "body": "#### PR description:\r\n\r\nWhile developing HLT reconstruction for the NGT scouting stream which employs (extended) pixel tracks in lieu of full tracks  (this is technically implemented in cmssw by the joint usage of the `ngtScouting`+`phase2CAExtension` modifiers)  we observed a problem in the jet scale in the region covered by HGCal.\r\nThis was traced back by the lack of linking of tracksters to tracks. In ticl v4 this is implemented in `RecoHGCal/TICL/plugins/LinkingAlgoByDirectionGeometric.cc`.\r\nMore specifically the issue is that pixel tracks extras currently do not implement inner and outer state, which lead to failed track propagation. \r\nIndeed when checking the efficiency of charged hadrons in the HGCal validation in this configuration, the MonitorElement was found empty.\r\nWe propose a simple patch (0f75e1db3702925d194aa57fae60a7d3df2d0649) to use instead the state of the track at the PCA (which instead is currently available for the pixel tracks) when the outer state is not defined.\r\nAdditionally in ticlv5 we need an additional patch to handle the computation of the track length for the timing computation. This is dealt with by commit  273763a1ead7f11ff73a51976ea60ea7088384b1 by simply bailing out the track length computation when the inner / outer states are invalid.\r\nIn the long term we foresee to change the Pixel track format to support track states at different surfaces.\r\n\r\n#### PR validation:\r\n\r\nWe re-run with the fix and we do observe non-null charged hadron efficiency in HGcal:\r\n\r\n| Before this PR | After this PR |\r\n| ------------- | ------------- |\r\n| <img width=\"778\" height=\"1007\" alt=\"Screenshot from 2026-02-04 14-00-41\" src=\"https://github.com/user-attachments/assets/8cafddf0-df1d-45f8-ae74-50f37f04978b\" /> | <img width=\"778\" height=\"1007\" alt=\"image\" src=\"https://github.com/user-attachments/assets/6f62c0c8-0b91-4be9-9bf3-386de7a29053\" /> |\r\n\r\nIn addition we checked that the scale using pixel tracks for linking in the endcaps returns to \"regular\" values:\r\n\r\n<img width=\"1920\" height=\"1513\" alt=\"image\" src=\"https://github.com/user-attachments/assets/048fecca-7a96-402b-a413-e089cb905aee\" />\r\n\r\nFinally we technically tested that the `runTheMatrix.py -l ph2_hlt` runs without problems\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nN/A\r\n\r\nCc: @elenavernazza @rovere\r\nFYI: @felicepantaleo @waredjeb @AuroraPerego ", "branch": "master", "changed_files": 3, "comments": 33, "commits": 2, "created_at": "1770207570", "deletions": 2, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending", "hgcal-dpg-pending", "hgcal", "ngt"], "milestone": "CMSSW_16_1_X", "number": 50031, "release-notes": [], "review_comments": 0, "state": "open", "title": "Adjust TICL track linking to work with (extended) pixel tracks", "updated_at": "1771434806", "user": "mmusich"}