{"additions": 4142, "auther_ref": "phase1pixeldqm-framework-first", "auther_sha": "958c5500d6612fff0d6bc900d5dd08809886f23b", "author": "schneiml", "body": "This is a test/discussion PR. I am not sure whether it can/should/will be merged. @fioriNTU FYI.\n\nThis introduces the shared code for the new, geometry-independent Pixel DQM (atm called Phase1, though it should be very capable of also handling the old detector. It might even handle Strips, but this is all out of scope for now). This is still very rough and not fully implemented, but the supplied sample analyzer already produces some plots on digis.\n\nThis code relies on Max Stark's ( @DirtyDan88 ) work in the Alignment package. The commits are included in this PR, but they should probably be in a separate one. However, I could not find any. @mmusich @tlampen are there any plans on merging this stuff?\n\nTo make matters worse, I had to apply some changes to the Alignment package in commit https://github.com/cms-sw/cmssw/commit/30542c0547901805832fa3ae0de56adce105765e . These are untested, and might break things.\n\nOn more general things:\n-  I don't know yet how the new could could and should be integrated in tests. Atm there are no automated tests.\n- The code liberally uses `assert` to ensure it is used correctly. These should all be situations that only appear due to coding errors, but I still wonder whether exceptions are preferred in this case (backtraces might be useful).\n- The shared code does not introduce a namespace. I think it could be a good idea, but I could not deduce the typical rules for when to use one (and how to call it).\n", "branch": "CMSSW_8_1_X", "changed_files": 55, "closed_at": "1461675673", "comments": 16, "commits": 49, "created_at": "1458642170", "deletions": 592, "labels": ["alca-pending", "comparison-pending", "new-package-pending", "orp-pending", "pending-signatures", "simulation-pending", "tests-pending"], "milestone": "Next CMSSW_8_1_X", "number": 13798, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Phase 1 Pixel DQM", "updated_at": "1461675673", "user": "schneiml"}