{"additions": 262, "auther_ref": "PixelClusterRepairByMorphing", "auther_sha": "efa179cd93dc19445309578d44edf46eab15a7d7", "author": "veszpv", "body": "In later years of Run 3, the pixel detector, especially Layer 1, will suffer a significant radiation damage. Studies show that due to the resulting lower charge collection efficiency, pixel hits in the bulk of clusters may be systematically lost. This leads to the multiplication of fragmented clusters, to loss of resolution when the shoulders of the original clusters are not properly identified (and paired as required by generic CPE) as well as to position biases. \r\n\r\nA digi-to-digi producer module is proposed to be placed between the raw2digi and the clusterizer modules that performs a somewhat modified \"closing\" image morphing operation in each pixel module separately. Closing is the result of the subsequent application of a dilation, with 3x3 kernel [(1, 1, 1) (1, 1, 1) (1, 1, 1)], and an erosion, with 3x3 kernel [(0, 1, 0) (1, 1, 1) (0, 1, 0)]. The operation injects extra pixels in the digi collection with configurable charge (provided in units of 10 electrons). These extra pixels are used in guiding the search for contiguous clusters in the clusterizer, and also potentially to initiate seeding if the adc is configured to pass the seeding threshold. Extra pixels are deleted from the final clusters.\r\n\r\nSome reminders:\r\n- Extra pixels are flagged during morphing using the extra bit made available by https://github.com/cms-sw/cmssw/pull/34509.\r\n- Clusters may no longer be contiguous, consumers need to make sure this is not an issue. Specifically, a subsequent PR is expected for template reconstruction addressing this before this feature can be turned on.\r\n- No improvement in intrinsic resolution is expected; the goal is to restore the remains of the original cluster in order to be able to fully exploit generic and template CPE-s\r\n- In 2021 we start with a pristine Layer 1. Assuming the CPE and tracking are optimized for that, any changes in clustering may lead to minor losses in performance. Therefore, both would need to be readjusted. Enhancement in performance is expected around 2024 or so.\r\n- More details are here: [[1]](https://indico.cern.ch/event/1057477/contributions/4444321/attachments/2279255/3872437/RECO_9July2021.pdf), [[2]](https://indico.cern.ch/event/934813/contributions/4095767/attachments/2140006/3605600/splitClusterRepair_20201110.pdf)\r\n- Only CPU implementation is provided. As stated in [1], this module is merely ~2 times slower than raw2digi itself. Timing of a GPU implementation should be negligible.\r\n\r\nThis feature is turned off by default.\r\n\r\n\r\n#### PR validation:\r\n\r\nThe method and choice of kernels were tested in two sets of clusters: exclusively broken ones with one or more discontinuities, and fully healthy ones. One can observe that the method has no effect on healthy clusters and perfectly restores x and y lengths of broken ones (this is required so that shoulders are identified and remain intact). Cluster size and charge are not restored, since missing pixels remain missing:\r\n\r\n![DigiMorphinValidation1](https://user-images.githubusercontent.com/5760033/126788543-8d3db04e-2fb0-4b2b-a455-666dffbc5ed1.png)\r\n\r\nThe cmssw implementation was tested earlier (in CMSSW 11_2_0) on real events with realistic mix of healthy and broken clusters in Layer 1 (called original), regular cluster size, and possibilities of cluster merging.\r\n\r\n![DigiMorphinValidation2](https://user-images.githubusercontent.com/5760033/126788552-f7074b8b-2e44-410b-9489-05e07227d356.png)\r\n\r\nValidation on CPE and tracking are inconclusive, see results in [[1]](https://indico.cern.ch/event/1057477/contributions/4444321/attachments/2279255/3872437/RECO_9July2021.pdf).\r\n\r\nThis PR passes tests with runTheMatrix (thanks to Tanja Susa).\r\n\r\nFurther final validations will also be provided by Tanja Susa (by turning on this feature) to ensure the desired changes take place during digi morphing. The PR is requested to be merged to ease further studies.\r\n", "branch": "master", "changed_files": 9, "closed_at": "1628554431", "comments": 45, "commits": 21, "created_at": "1627042059", "deletions": 4, "labels": ["operations-approved", "reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved"], "merge_commit_sha": "44ad0e8353a1962cbe32b6562f4fdc876fac35af", "merged_at": "1628554431", "merged_by": "cmsbuild", "milestone": "CMSSW_12_1_X", "number": 34606, "release-notes": [], "review_comments": 39, "state": "closed", "title": "Pixel cluster repair by morphing", "updated_at": "1628554431", "user": "veszpv"}