{"additions": 803, "auther_ref": "geom-extract", "auther_sha": "86aba7bfa5811c2998966b92f910124971149e79", "author": "trackreco", "body": "This PR addresses the first long-term item in cms-sw#36966 - removal of hardcoded phasI geometry from mkFit and implementation of proper geometry extraction from RECO geometry loaded in current cmsRun process.\r\n\r\n* Extract mkFit layer r-z bounding regions and TEC r-coverage gaps from individual modules.\r\n* Introduce ModuleInfo with module position, normal and principal direction. Each layer holds a std::vector and a mapping from detId to short in-layer module index that was constructed on the fly beforehand.\r\n* LayerInfo: remove/cleanup is_pixb/pixe/tib/tob/tid/tec data members and functions. They were not really used. Put in 'int subdet' that can be used to the same effect in scoring / cleaning functions.\r\n* Remove geometry creation files with hardcoded geometry information: MkFit/plugins/createPhase1TrackerGeometry.h/cc/acc\r\n\r\nCorresponding changes for standalone extras are on https://github.com/trackreco/mkFit-external/tree/geom-extract\r\n\r\n### PR validation:\r\n* TTbar + < PU >=50: http://uaf-10.t2.ucsd.edu/~mmasciov/MIC/rescaleError100/MTV_TTbarPU50_extractedGeometry_mkFitOnly/\r\n* 10, pT=0.6 GeV, 1.5<||<2.5: http://uaf-10.t2.ucsd.edu/~mmasciov/MIC/rescaleError100/MTV_10muPt0p6Eta1p5to2p5_extractedGeometry_mkFitOnly/\r\n\r\nThere are minimal changes in efficiency and fake rates, below 1% level. These are expected as the hardcoded mkFit geometry was not identical to one obtained by proper extraction. There are differences in extent of endcap r-gaps (O(1cm)) and z-extent of endcap mkFit layers (O(5cm)).\r\n\r\nTiming is not expected to change significantly (if at all) as this PR only affects extents of mkFit layers.\r\n", "branch": "master", "changed_files": 23, "comments": 3, "commits": 13, "created_at": "1648674414", "deletions": 825, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_12_4_X", "number": 37418, "release-notes": [], "review_comments": 0, "state": "open", "title": "[MkFit] Tracker geometry extraction from Reco geom modules", "updated_at": "1648675362", "user": "osschar"}