{"additions": 287, "auther_ref": "L1Nano_130X", "auther_sha": "e1c084ef5f5f1b9a9371f23844ea73ff1ad4d076", "author": "Sam-Harper", "body": "#### PR description:\r\n\r\nSo I was helping some folks with some Eg HLT studies and they mentioned yesterday having the L1 objects  in Nano would be useful and I agreed and noticed it didnt seem to exist already\r\n\r\nSo I quickly made an implementation to see if folks like it and want to put it in to the release. We can discuss here if we think this is useful. The L1 DPG obviously should be on board here (@lathomas FYI)\r\n\r\nFor the Nano the trick is the BXVectors, I made a new class for this which you can restrict the bx. Also it will write the bx into the table as well.  I didnt add singleton and external variable support but that could be easily added if we want to. \r\n\r\nI wasnt thinking of having this as part of the standard nano, simply as an option for those wanted to use it for studies. \r\n\r\nI'm happy to take suggestions.  Also of note, I simply put all the L1 variables in, of course these are not always filled (I think to fill them you need to re-run the emulator not simply unpack), however they are zero as a result. Also probably could adjust the sizes used to store the values.   \r\n\r\nWe could have two modes for this, one which has all L1 objects and info and one which just has a subset if folks are interested. \r\n\r\nThe only L1 object I'm aware missing is the MuonShowers and that is simply as I didnt have the format to test. \r\n\r\n#### PR validation:\r\n\r\nI successfully ran this on 12_4_10 making some nice L1 nano which looked as expected (ie basically the L1 objects in nano).  Without activating the nanoL1TrigObjCustomize, no changes are expected. \r\n\r\n", "branch": "master", "changed_files": 5, "closed_at": "1680333982", "comments": 47, "commits": 12, "created_at": "1675264179", "deletions": 0, "labels": ["l1-approved", "fully-signed", "tests-approved", "pdmv-approved", "orp-approved", "upgrade-approved", "code-checks-approved", "xpog-approved"], "merge_commit_sha": "0ca803d0342f066bf1aae19ee3544506ef45899e", "merged_at": "1680333982", "merged_by": "cmsbuild", "milestone": "CMSSW_13_1_X", "number": 40663, "release-notes": [], "review_comments": 19, "state": "closed", "title": "L1Nano addition", "updated_at": "1680333983", "user": "Sam-Harper"}