{"additions": 19, "auther_ref": "hltExoDqmBugFix_12_5_X", "auther_sha": "4d4e96dae9d4b4aecc4b7d7fc82c26b56fa43e7a", "author": "jalimena", "body": "#### PR description:\r\n\r\nThis PR is a backport of https://github.com/cms-sw/cmssw/pull/39799\r\n\r\nThis PR:\r\n\r\n1. removes the offline DQM monitoring of two obsolete HLT paths, which are no longer in the 2022 menu: HLT_TrkMu16_DoubleTrkMu6NoFiltersNoVtx_v and HLT_TrkMu17_DoubleTrkMu8NoFiltersNoVtx_v\r\n2. make it not required to have all paths be valid in the numerator and denominator, for the paths monitored in MuonMonitor_cff\r\n\r\nThe reason for the second part is because in the HLT 2022 v1.3 menu, one of the paths in the denominator was removed. As a result, the DQM plots did not get made, although they would have been fine, physics-wise. Changing this flag to false is the easiest way to have similar DQM plots with the earlier and later HLT menus, and it fixes this bug.\r\n\r\nAs a result of this PR, some DQM plots will be removed, and some will reappear.\r\n\r\n#### PR validation:\r\n\r\nUsing the 11634.0 ttbar workflow, I have tested that the correct histograms are produced and filled in the harvested DQM file.\r\n\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nBackport of https://github.com/cms-sw/cmssw/pull/39799 . A backport to 12_4_X is necessary, and this backport is to make the intermediate release cycle 12_5_X consistent. \r\n\r\n", "branch": "CMSSW_12_5_X", "changed_files": 1, "comments": 4, "commits": 1, "created_at": "1666764283", "deletions": 14, "labels": ["dqm-pending", "pending-signatures", "tests-approved", "orp-pending", "backport-ok"], "milestone": "CMSSW_12_5_X", "number": 39856, "release-notes": [], "review_comments": 0, "state": "open", "title": "HLT release validation and offline DQM for EXO Run 3 HLT paths (12_5_X)", "updated_at": "1666778324", "user": "jalimena"}