{"additions": 223, "auther_ref": "modifyOptions", "auther_sha": "8a8e0a870f3366c6ca1e8bf1b3af69d1746c0ea0", "author": "wddgit", "body": "#### PR description:\r\n\r\nEnable concurrent lumis and IOVs by default when number of streams is at least 2.\r\n\r\nWith the changes in this PR, the number of concurrent luminosity blocks will default to 2 if the number of streams is greater than 1. The number of concurrent IOVs will default to the number of concurrent luminosity blocks. These new defaults will apply if these parameters are not specified in the configuration or are specified to be zero. Previously, these parameters would default to 1.\r\n\r\nIf the number of concurrent luminosity blocks is greater than the number of streams, then it will be reset to the number of streams.\r\n\r\nIf the number of concurrent IOVs is greater than the number of concurrent luminosity blocks, then it will be reset to the number of concurrent luminosity blocks.\r\n\r\nMerging this code will cause some existing configurations to start running processes with multiple concurrent luminosity blocks and IOVS.  This is a significant change that will probably break some modules. I've tested this PR works in the Framework code. While testing this PR, I did not test outside the Framework beyond the limited runTheMatrix tests. Concurrent luminosity blocks have been implemented in the Framework since 2018 and concurrent IOVs have been implemented since 2019. There has been an ongoing effort since then to get code outside the Framework to support concurrent luminosity blocks and IOVs. Multiple people have participated in this. runTheMatrix has been running process with more than one concurrent luminosity block for a few months now. Known problems have been fixed. The plan of the Core group is that this PR represents the next step in this migration. It is expected there may be failures uncovered when this is merged. The way forward is approving this PR so we can identify those failures and then be able fix them.\r\n\r\n#### PR validation:\r\n\r\nAdded new unit tests for the above. Fixed existing tests as necessary.\r\n", "branch": "master", "changed_files": 21, "closed_at": "1625270603", "comments": 24, "commits": 7, "created_at": "1624477418", "deletions": 59, "labels": ["code-checks-approved", "core-approved", "fully-signed", "orp-approved", "tests-rejected"], "merge_commit_sha": "3dba7616f4c4548827563a821433dd1290ac0178", "merged_at": "1625270603", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 34231, "release-notes": [], "review_comments": 36, "state": "closed", "title": "Enable concurrent lumis and IOVs by default when number of streams is at least 2", "updated_at": "1625270603", "user": "wddgit"}