{"additions": 4831, "auther_ref": "RecoMaterialPhaseI", "auther_sha": "6f6c428250bd4f5c21797b57fefc73a2a35493f6", "author": "rovere", "body": "This PR will bring in the new recoMaterial tuning on top of the development/changes that have been added in #16338.\r\nI locally merged it and started on top: I'm not sure what is the recommended/best procedure to follow in order to have both PRs integrated with the least possible conflicts.\r\nResults of the tuning are ok, neither dramatic nor stricking, mostly because the material was already tuned in pre9. \r\nYou can find the usual MTV like plots for SingleMuon, Pt 10,5 here [1](https://roverepublic.web.cern.ch/roverepublic/temp_images/PhaseI/Post16338/Tuning/PixFwd/MTV_SingleMuPt10/) and [2](https://roverepublic.web.cern.ch/roverepublic/temp_images/PhaseI/Post16338/Tuning/PixFwd/MTV_SingleMuPt5/), respectively.\r\nIn general we could conclude that the Chi2 is somehow flattish, the number of missing outer hits decreases and the overall duplicate tracks go down (even if it's hard to judge on single muon samples).\r\n\r\nThe PR will also bring in all the mandatory C++ changes to the scripts used to derive the tuning: these are mandatory mostly for PhaseII, but since these code changes **are not part of any workflow**, I judged as ok to have them here. If Offline has problems with this approach, I formatted the history so that a single commit has all the required changes to the reconstruction material description: in case we could cherrypick only that one (in a separate PR).\r\n\r\nFurther testing on other samples is welcome in this case, to see if unforeseen changes will show up.", "branch": "CMSSW_8_1_X", "changed_files": 47, "closed_at": "1478004633", "comments": 23, "commits": 20, "created_at": "1477922200", "deletions": 1109, "labels": ["comparison-available", "dqm-approved", "fully-signed", "geometry-approved", "orp-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "df0fb21b508204f301373866c41792c4e7d92733", "merged_at": "1478004633", "merged_by": "cmsbuild", "milestone": "Next CMSSW_8_1_X", "number": 16401, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Reco material phaseI", "updated_at": "1478004633", "user": "rovere"}