{"additions": 234, "auther_ref": "fixMissingStreamerInfos", "auther_sha": "dcf316fffc882234f61aa91117bd812b6f618ed5", "author": "wddgit", "body": "#### PR description:\r\n\r\nThe version of ROOT associated with CMSSW_13_0_0 had a bug that caused it to fail to write out StreamerInfo objects for some types in the output. This affected some other releases in the 13_0_X and 13_1_X release cycles. It was fixed in both of those release cycles and didn't affect others. See Issue #41246 for more details.\r\n\r\nThe missing StreamerInfos don't actually cause a problem until the data format of the associated class changes and someone tries to read the file. Then the schema evolution feature of ROOT is needed and that requires the StreamerInfo objects. This could occur much later.\r\n\r\nThis PR introduces a workaround fix that allows one to read problem objects in those files. It adds a new service that will read in a file containing only StreamerInfo objects. Then the problem objects become readable and schema evolution succeeds. One sets a parameter in the service to point to a file that contains only the missing StreamerInfo objects and that causes them to be stored in memory.\r\n\r\nThe PR includes a script that can be used to generate the file that contains the StreamerInfo objects.\r\n\r\nOne shortcoming of this PR is that it is hard to identify all problem types. We found all types missing the StreamInfo in one input file and there was one additional type identified in the initial problem reports. One can use the script to generate a new file if more problem types are encountered in the future.\r\n\r\nThere is a second PR associated with this one that will add 2 files to the cms-data repository associated with IOPool/Input. This PR should not be merged before the cms-data PR.\r\n\r\n#### PR validation:\r\n\r\nA new unit test is included to verify that this workaround will succeed.\r\n", "branch": "master", "changed_files": 4, "comments": 7, "commits": 1, "created_at": "1698959474", "deletions": 10, "labels": ["core-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending"], "milestone": "CMSSW_13_3_X", "number": 43175, "release-notes": [], "review_comments": 5, "state": "open", "title": "Initial implementation of the FixMissingStreamerInfos service", "updated_at": "1699285136", "user": "wddgit"}