{"additions": 81, "auther_ref": "CMSSW_8_1_X_tau-pog_miniAOD-extension", "auther_sha": "afa604b5ca695a808f6e510bd77d63ad634e5933", "author": "cms-tau-pog", "body": "This is a pull request to provide all necessary extensions of the event content of the miniAOD(=PAT)Tau to be able to run the tau mva isolation discriminator not only on AOD input but also on miniAOD input. The tau mva isolation discriminator is the main discrimination handle for taus against jet->tau fakes. The required variables are: \n-  float ip3d_;\n-  float ip3d_error_;\n-  float ip3d_Sig_;\n-  float ecalEnergy_;\n-  float hcalEnergy_;\n-  float leadingTrackNormChi2_;\n\nThe applied changes lead to only a minimal increase of the miniAOD event content as can be checked from here (*). The changes include pure additions, no existing data members are changed. They only include changes to the pat::Tau data format. There is no chance of harm to any available data members. As you see from the modified files only a limited set of lines has been added to available code - no major re-implementation works were included here. We have tested that:\n- the code changes pass the usual tests as required here (**), including checks on reflex dictionaries, \n- that the code performs unchanged during runtime,\n- that the existing output of the pat::Tau is unchanged as it should (on a quick validation track).\n\nSince time is running and we want this branch to be integrated in time for the 80X rereco, since changes have only been applied to the pat::Tau data format (not the reco::PFTau), and since the quick validation does not reveal any difficulties we are running our standard validation procedure now in parallel. We anticipate no changes to the existing tau performance since all changes are to the level pf pat::Taus (not reco::PFTaus) and the changes only add event content and do not change any event content. \n\nThis pull request includes all that is needed to rerun the tau mva isolation discriminator on the miniAOD event content. We are currently checking the need to prepare a second pull request that will add more information to rerun the tau mva anti-electron discriminator on miniAOD inputs. \n\nCheers,\nRoger\n\n(*)\nbased upon a standard ttbar Relval sample (100 events), as usually used for PAT workflow validations:\nhttp://ekpwww.physik.uni-karlsruhe.de/~rwolf/TauPOG/patMiniAOD_standard_plain.html\nhttp://ekpwww.physik.uni-karlsruhe.de/~rwolf/TauPOG/patMiniAOD_standard_extended.html\n\n(**)\nhttps://twiki.cern.ch/twiki/bin/viewauth/CMS/RecoIntegration\napart from difficulties that I'm regularly having with CMS-DAS since a longer time span. \n", "branch": "CMSSW_8_1_X", "changed_files": 8, "closed_at": "1473142295", "comments": 23, "commits": 7, "created_at": "1473076341", "deletions": 43, "labels": ["analysis-pending", "comparison-available", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "7ad1bce3f4a3011ac8543c79847d7be92cc2bb80", "merged_at": "1473142295", "merged_by": "davidlange6", "milestone": "Next CMSSW_8_1_X", "number": 15731, "release-notes": [], "review_comments": 11, "state": "closed", "title": "Extension of miniAOD event content to be able to run tau mva isolation discriminator on miniAOD input", "updated_at": "1473321665", "user": "roger-wolf"}