{"additions": 200, "auther_ref": "PackedClusters74X", "auther_sha": "588ea8d46eb193fa2d3e839c8a4f09e4bc7d3cc1", "author": "Sam-Harper", "body": "Dear All, \n\n@lgray  @matteosan1 \n\nI decided the best way to alert folks with via this pull request rather than emailing as it ensures I get the right people. E/gamma is already aware about this. Currently in the AOD, my understanding is that we do not save CaloTowers or HcalRecHits. Nor do we store the PFClusters. Therefore we have no unbiased or minimally biased HCAL collection. There is a need to have this in place for studies. \n\nRight now, I would like the PFClusters accessable at the AOD level. This is useful for isolation development and debugging. Indications are that PF cluster based isolation is promising (https://indico.cern.ch/event/305124/contribution/3/material/slides/1.pdf). It is also what is used for the HLT. To continue to develop isolation and also to understand the HLT isolation, we need PFClusters in the AOD.  It is also useful for H/E studies.  \n\nI understand that these were dropped due to space. For isolation studies and H/E , we can get away with just having the et/eta/phi and detId of the seed cluster. So I have developed a packed format ala the mini-aod (not this is for AOD not miniAOD) for Clusters. I put it in with the pat::PackedCandidate as it reuses the packer they use which is in that package. \n\nI then tested the size on ttbar events (/store/relval/CMSSW_7_4_0_pre2/RelValTTbar_13/GEN-SIM-RECO/PU25ns_MCRUN2_73_V7-v1/00000/12EFC87E-C29A-E411-ABAA-003048FFD79C.root) and found following sizes in bytes from edmEventSize:\npatPackedClusters_packedPFClustersECAL__AODTest. 6896.77 4042.27\npatPackedClusters_packedPFClustersHCAL__AODTest. 3433.81 1911.33\n\nSo we can store all PF clusters in 6Kb per event. If this is a problem, we can filter based on gedGsfElectrons and gedPhotons with DR<0.5. This reduces the event size to \npatPackedClusters_packedPFClustersECAL__AODTest. 1092.29 662.26\npatPackedClusters_packedPFClustersHCAL__AODTest. 398.37 253.17\n\nwhich is less than a 1kb compressed.  Note, I think the ECAL ones might even be already in the AOD but its not quite clear to me if they are. Any clarifications from experts would be useful here. Regardless, I'm almost fully certain HCAL are not. \n\nI would like to have this information in the AOD, what steps should I take to ensure that this happens\n\nThanks,\nSam\n", "branch": "CMSSW_7_4_X", "changed_files": 6, "closed_at": "1422518801", "comments": 14, "commits": 3, "created_at": "1421419119", "deletions": 2, "labels": ["analysis-pending", "comparison-available", "pending-signatures", "tests-approved"], "milestone": "Next CMSSW_7_4_X", "number": 7236, "release-notes": [], "review_comments": 0, "state": "closed", "title": "PackedClusters for 74X to keep PFClusters in AOD", "updated_at": "1423140305", "user": "Sam-Harper"}