{"additions": 263, "auther_ref": "new_bb4lhook", "auther_sha": "166e3b01bf2307e59b384b7df8db325d0250c689", "author": "lauridsj", "body": "#### PR description:\r\n\r\nThis PR replaces the Pythia Hook used for showering events produced with the bb4l generator with a new version provided by the authors.\r\n\r\nThere are two reasons why this is necessary, both related to the new bb4l version that was released last year:\r\n\r\n- The old version that was in CMSSW beforehand had a bug that caused the hook to crash for events that had only an antitop and no top (i.e. tbarW events). This was never noticed because in the old bb4l, tW events were still labeled as ttbar events, while the new bb4l also has events labeled as tW. \r\n- The new bb4l version also includes the semileptonic decay channel of ttbar, which the old hook does not support.\r\n\r\nI have copied the version provided by the authors with as few changes as necessary to adapt it to CMSSW and Pythia 8.2 (the original version was for Pythia 8.3).\r\n\r\nNote that some of the flags present in the old hook are no longer present. These flags were meant as cross-checks by the bb4l authors to test the effects of several assumptions of the matching, and were never used in CMS for official MC production. Thus I did not bother to reimplement them in the new version of the hook. (Also note that the most important such flag for an \"alternate\" matching, `POWHEG:bb4l:ScaleResonance:veto`, is still there.)\r\n\r\nIn addition, I have added a new flag that was not present in the version of the authors: `POWHEG:bb4l:vetoAllRadtypes`. This flag is not meant for bb4l (and should be left at its default value of false when showering bb4l), but instead for the ttb_NLO_dec generator, which we might want to generate in the future as well. This generator also generates up to one real emission per decaying top, thus has the same final state as bb4l and can use the same hook. However, after checking with the authors, we were notified that it is necessary to modify the hook to also veto Powheg remnant events (`radtype` 2), which is not the case for bb4l. This alternate behavior is implemented with this flag.\r\n\r\n#### PR validation:\r\n\r\nI have confirmed that, when run on LHE files produced by the old bb4l, the new and old versions of the hook give exactly the same output.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThe PR will need to be backported to all MC production releases, i.e.\r\n10_6_X (UL)\r\n12_4_X (2022)\r\n13_0_X (2023 I think?)\r\n(Any that I missed?)\r\n\r\n", "branch": "master", "changed_files": 2, "comments": 10, "commits": 5, "created_at": "1708617444", "deletions": 283, "labels": ["generators-pending", "pending-signatures", "orp-pending", "tests-started", "code-checks-approved"], "milestone": "CMSSW_14_1_X", "number": 44061, "release-notes": [], "review_comments": 0, "state": "open", "title": "Update Pythia Hook for BB4L", "updated_at": "1710252236", "user": "lauridsj"}