{"additions": 475, "auther_ref": "HcalUnpackerUpdates", "auther_sha": "9274e5396c8f303da8dd3c3125d3d6feca7dfc89", "author": "jkunkle", "body": "This pull request addresses three issues related to Hcal data unpacking.  (See more detailed explanations below) : \r\n\r\n1) Add a QIE10DigiCollection with tag \"LASERMON\" to keep laser monitoring data in the event\r\n2) Improvements to the HcalUnpacker that are related to 1) \r\n3) Updates to RecoMET/METProducers/HcalNoiseInfoProducer to reflect the changes in 1)\r\n\r\nAdditional information to (1)\r\n-------------------------------------\r\nAs we plan to use the lasermon channels to clean the data of any possible laser contamination, we desire to keep them in the emap so that we have a versioned accounting of them.  This requires changes to : \r\n- CalibFormats/HcalObjects/HcalTextToDetIdConverter, To parse the new emap entries from the .txt file\r\n- DataFormats/HcalDetId/HcalCalibDetId, To add a unique CalibDetType\r\n- EventFilter/HcalRawToDigi/HcalRawToDigi, to make the new collection and put it in the event\r\n- EventFilter/HcalRawToDigi/HcalUnpacer, to unpack into the new collection\r\n\r\nAdditional information to (2)\r\n-------------------------------------------\r\nWe often run into an issue with the HcalUnpacker where it encounters data having a different number of samples than the default collection (the number of samples is determined by the first FED of that type that is unpacked).  Currently the unpacker stops unpacking at this point and any data beyond that is not unpacked.  At this point in the code there are even comments that say \"this is horrible\".  The aim of this update is to avoid this situation and to provide access to this new data for private studies without making by-hand modifications to the unpacker.\r\n\r\nThis update does not change the default behavior of the unpacker except for \r\n1) The unpacker will no longer stop unpacking after encountering non-conforming data\r\n2) the message that is printed in this case is modified to direct the user how to access the data\r\n\r\nTo access the data, the user can provide two lists to HcalRawToDigi, one that specifies the number of samples in the data, and a tag so the data can be stored in a unique collection.  There are two additional maps of integers (number of samples) to QIE10/11DataCollections.  The unpacker looks for these maps to be filled and unpacks accordingly.  Otherwise they follow the same processing as other QIE10/11 collections\r\n\r\nAdditional information to (3)\r\n---------------------------------------\r\nThis just updates the code to read the lasermon channels from a QIE10DigiColleciton.  The algorithm does not change, there is just some structural reordering of the code to use the new collection\r\n\r\nI have run the runTheMatrix tests and will soon provide instructions for testing the new features", "branch": "master", "changed_files": 9, "closed_at": "1520928927", "comments": 69, "commits": 13, "created_at": "1519804422", "deletions": 201, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "reconstruction-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "445faaf9958c181273d6bba01d5c2da1670e9bdb", "merged_at": "1520928927", "merged_by": "cmsbuild", "milestone": "CMSSW_10_1_X", "number": 22385, "release-notes": [], "review_comments": 11, "state": "closed", "title": "Create new collection for Hcal lasermon digis + Hcal unpacker updates", "updated_at": "1520928928", "user": "jkunkle"}