{"additions": 165, "auther_ref": "from1300pre4_pujetid_fix", "auther_sha": "283d569a9919bd9dd664f4d2006b6761b00fa987", "author": "jshin96", "body": "PR description:\r\n\r\nThis PR has three main modifications: \r\n\r\n1) Pileup Jet Id variable bug fix.\r\n\r\nPileupJetIdProducer and PileupJetIdAlgo are used to compute input variables and the final discriminant for \r\nthe Pileup jet Id BDT. There was a bug for one of the variable calculation such that when there is no charged \r\nconstituent inside a jet, it assigns the very last constituent in the list of constituent as leading charged \r\nconstituent. This PR corrects this error and assigns zero pt and large phi and eta when there is no charged \r\nconstituent. \r\n\r\n2) Correct puppi weight access implementation by ValueMap.\r\n\r\nPreviously, the puppi weight for each constituent was accessed from packedCandidate object in the code, but for the \r\ncompatibility with other codes in CMSSW, this weight must be implemented through ValueMap<float>. In this PR, puppi \r\nweight retrieval from ValueMap is implemented, just like PR #40667. As in that PR, the naming of \"puppi weight\" is \r\ngeneralized to \"constituent weight\". Furthermore, there are parts of PileupJetIdAlgo where comparison of constituent's pt \r\n(in order to find, for example, leading charged constituent) was done incorrectly when weighted pt was compared with \r\nunweighted pt. This error is also fixed.\r\n\r\nThe ValueMap implementation does not affect CHS jets. However, the fix in leading charged constituent selection could \r\nhave affected CHS jets. In further detail, CHS jets have more constituents in each jet in general and it is very rare \r\nfor CHS jets to have no charged constituent at all, so the effect of such fix was insignificant.\r\n\r\n3) Add an option in PuppiProducer to apply photon protection for existing weights.\r\n\r\nPreviously the photon protection is applied also on existing puppi weights. This will confuse users who would want \r\nPuppiProducer to provide ValueMap of weights with the same exact weights stored in packedPFCandidates in MiniAODs. \r\nThis PR adds a flag (default set to False) to enable photon protection on existing puppi weights.\r\n\r\nPR validation:\r\n\r\n- Validation plots comparing the input variables for Pileup Jet Id training before and after fix can be found in this JMAR meeting [contribution](https://indico.cern.ch/event/1245910/#5-pu-jetid-training-for-puppi).\r\n- Passes the usual runTheMatrix test: runTheMatrix.py -l limited -i all --ibeos. Test done by @nurfikri89.\r\n- Passes reMiniAOD and reNanoAOD workflows: runTheMatrix.py -i all --ibeos -l 1325.518,2500.312. Test done by @nurfikri89.\r\n- Passes the JMENano workflows: runTheMatrix.py -i all --ibeos -l 10224.15,11024.15,25202.15,11634.15. Test done by @nurfikri89.\r\n\r\n\r\n", "branch": "master", "changed_files": 7, "closed_at": "1676981627", "comments": 16, "commits": 9, "created_at": "1676377736", "deletions": 89, "labels": ["reconstruction-approved", "fully-signed", "tests-approved", "orp-approved", "code-checks-approved", "xpog-approved", "jetmet"], "merge_commit_sha": "918a7fcd99447e01c7ba70f6bf5e04fa9a70b080", "merged_at": "1676981626", "merged_by": "cmsbuild", "milestone": "CMSSW_13_1_X", "number": 40762, "release-notes": [], "review_comments": 0, "state": "closed", "title": "[PileupJetId, Puppi] Pileup ID input variable fix, puppi weight ValueMap access, optional photon protection for existing puppi weights", "updated_at": "1676981627", "user": "jshin96"}