{"additions": 1056, "auther_ref": "CMSSW_11_2_X_tau-pog_deepTauForAODandHLT", "auther_sha": "bc1db4ac4f672caf1c1a3d07b83357d16dd5bae7", "author": "cms-tau-pog", "body": "#### PR description:\r\n\r\n* Input tokens for Candidate and Tau collections now use base classes\r\n* taus and candidates are accessed by dynamic_cast and edm::View on the base class objects\r\n* A boolean \"is_online\" is added to specify whether the input is AOD or RECO\r\n* Electron and muon collections are initialized as empty arrays if is_online is True\r\n* A structure \"tauFunc\" containing a range of functions was added to calculate both tau ID quantities as well as other quantities that needed recalculation for RECO input.\r\n* A namespace \"candFunc\" was introduced containing functions to calculate quantities that need recalculation for RECO input.\r\n* A structure lightLepFunc was added to initialize the electron and muon collections depending on the value of the boolean \"is_online\"\r\n* Functions that use taus or candidates have been turned into template functions where the CandidateType and/or TauType are specified\r\n\r\n#### PR validation:\r\n\r\n* code and format checks passed\r\n* unit tests passed\r\n* limited matrix tests passed\r\n* RecoTauTag/RecoTau/test/runDeepTauIDsOnMiniAOD.py was run with a setup without any changes and the version of the setup in this PR over the same 1000 events of the same dataset. The output of both runs was identical.\r\n* A simple setup was made with hltGetConfiguration for the latest HLT menu where the isolation modules were replaced by the adapted DeepTauId module. This setup ran smoothly and the output looked as expected.\r\n", "branch": "master", "changed_files": 5, "closed_at": "1605654789", "comments": 71, "commits": 19, "created_at": "1602344892", "deletions": 304, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "hlt-approved", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "96acaf4f2af6ad62b1c9efcba0a4a3f785394223", "merged_at": "1605654789", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 31744, "release-notes": [], "review_comments": 49, "state": "closed", "title": "Change DeepTauID modules so they can also process RECO input for HLT purposes", "updated_at": "1605654789", "user": "swozniewski"}