{"additions": 1555, "auther_ref": "l1t-elisa-backport", "auther_sha": "52c387f8b0c4f1fae1b25ab5eed87ea73f7b57d2", "author": "cecilecaillol", "body": "#### PR description:\r\n\r\nThis is a backport of https://github.com/cms-sw/cmssw/pull/33911, needed for CRUZET so urgent! (sorry!)\r\n\r\nDevelopment of a new condition class to deal with a three-body correlation condition (starting from CorrCondition and CorrWithOverlapRemovalCondition as a model): CorrThreeBodyCondition and CorrelationThreeBodyTemplate.\r\nBased on the version of the UTM libraries utm_0.8.1: https://gitlab.cern.ch/cms-l1t-utm/utm/-/tree/utm_0.8.1.\r\nNew parseCorrelation function needed in the TriggerMenuParser. Minor changes needed in the L1TGlobalProducer, GlobalBoard, TruggerMenu, GlobalCondition, GlobalDefinitions.\r\n\r\n#### PR validation:\r\n\r\n\r\n    Tests performed by producing test vectors using a dedicated L1 Menu with four algorithms requiring three muons with different pT cuts and a threshold on the three-muon invariant mass: successful comparison with triggers from the firmware.\r\n    CMSSW release used for tests: CMSSW_12_0_X_2021-05-24-2300.\r\n    Test at the HLT level to verify that the correct information about the objects that caused the decision is correctly saved and used: a generic triple muon HLT path can be seeded by L1 triggers with a three-body invariant mass requirement.\r\n    STEPS:\r\n    - Private production of a small RAW-DIGI ZZTo4Mu sample (100 events) using Run 3 conditions\r\n    - Production of a dedicated HLT menu in ConfDB including FirstPath, FinalPath, and a generic TripleMu seed (HLT_TripleMu_10_5_5_DZ_v10) with modified L1 seeds as Logical Expression:\r\n    /users/elfontan/ThreeMuInvMassTest/TriMuInvarianMass1120/V4\r\n    - HLT configuration and uGT emulator run with a dedicated L1 test menu:\r\n    [... --l1-emulator uGT --mc --l1Xml L1Menu_test_mass_3_body_reduced_v2.xml\"]\r\n    Some final checks:\r\n    - scram build code-format #Ensure that the code conforms to CMSSW standards\r\n    - scram b -j8\r\n    - runTheMatrix.py -l 11634.0\r\n\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nbackport of https://github.com/cms-sw/cmssw/pull/33911\r\n\r\n@elfontan For you to be updated\r\n@qliphy @silviodonato This is the backport we urgently need for CRUZET I was mentioning at the ORP meeting, sorry about the late notice!", "branch": "CMSSW_11_3_X", "changed_files": 17, "closed_at": "1625607843", "comments": 7, "commits": 6, "created_at": "1625577919", "deletions": 64, "labels": ["fully-signed", "l1-approved", "orp-approved", "tests-approved", "urgent"], "merge_commit_sha": "70fe2f28ade8adafc60f31657c6e62cb51db82f3", "merged_at": "1625607843", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 34354, "release-notes": [], "review_comments": 0, "state": "closed", "title": "L1T uGT: Three body invariant mass for muons backport", "updated_at": "1625607843", "user": "cecilecaillol"}