{"additions": 199, "auther_ref": "CMSSW_12_0_X-TrackWordDigitization", "auther_sha": "122ff5c4f5d2054da3c3fa412eebc69bd22ca6ce", "author": "aperloff", "body": "#### PR description:\r\n\r\nThis PR does several things:\r\n1. It fixes an issue with the track parameter digitization for the TTTrack_TrackWord data format. Previously the functions were overly complex and off by 1 bit; a problem which grew every time you went back and forth between digitized and undigitized value.\r\n2. Converts from global to local phi during construction and setting of parameters and allow the TTTrack class to make use of this function from the base class.\r\n3. Adds a new function to test the output of the digitize and undigitize functions. Also making sure that going back and forth doesn't introduce an ever growing offset.\r\n4. Adds some code to unit test the TTTrack_TrackWord; specifically the digitize and undigitize functions.\r\n\r\n#### PR validation:\r\n\r\nAll needed code checks and code format checks have been performed. The code compiles after running `git cms-checkdeps -a`. I also used the newly added unit tests to verify the correctness of the digitize and undigitize functions. Both returned the expected values. Additionally, I produced an L1TrackObject ntuple and the local phi value looks correct.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nThis PR is being forward ported from https://github.com/cms-l1t-offline/cmssw/pull/940. It is fully signed off by all relevant parties in the phase2 upgrade software group. It's just waiting to be merged there. This forward port was requested by the L1 track trigger group so that they can use these changes as well.\r\n\r\n@tomalin ", "branch": "CMSSW_12_0_X", "changed_files": 8, "closed_at": "1630543052", "comments": 9, "commits": 1, "created_at": "1629492895", "deletions": 32, "labels": ["l1-approved", "fully-signed", "tests-approved", "orp-approved", "upgrade-approved"], "merge_commit_sha": "7ad82112aa82a04bdd44f169145a3a4994b35bf3", "merged_at": "1630543052", "merged_by": "cmsbuild", "milestone": "CMSSW_12_0_X", "number": 34970, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Updates to the TTTrack/TTTrack_TrackWord DataFormats", "updated_at": "1630543053", "user": "aperloff"}