{"additions": 255, "auther_ref": "SlimmedSCs_1320pre1", "auther_sha": "59ad9ad4214f3dded6512bb0eb0b0bea9cee3ef4", "author": "Sam-Harper", "body": "### PR description:\r\nThere is a current push for getting rid of AOD and expand miniAOD with the missing features for needed workflows. One such workflow is the EG reco efficiency measurement which measures the supercluster -> electron efficiency\r\n\r\nTo do this we need an unbiased collection of superclusters which is only in the AOD as the mini collection is only for SC which are photons or electrons and have some selection on them. We also need to apply some sort of ID on those objects, currently this is track isolation. The track isolation can be calculated on the fly from candidates in the miniAOD but its easier to have it precomputed.\r\n\r\nFor the EGM efficiency measurement we just need to know the energy/eta/phi of the SC and its track isolation value. It would also be useful to have the rawEnergy and the seed det ids of its clusters (this is absolutely necessary for the seed cluster, useful for the others). Thus we dont need the \"full fat\" supercluster so a reduced format has been created which will singificantly reduce the size stored\r\n\r\nThis is a SlimmedSuperCluster, the name can be changed but this is the general idea. Also I'm debating having a vector of floats for the id variables rather than a hardcoded trkIso (ala pat::UserFloats and similar) which if its affordable would improve flexablity.\r\n\r\nThis is a work in progress and at this stage is here so EGamma experts can comment on it while the rest of the tests are done.\r\n\r\nThis superseeds https://github.com/cms-sw/cmssw/pull/41745 (and in takes much of the inspiration on the track isolation calculator from there)\r\n\r\n### PR validation:\r\nPR is ongoing. For  a RelVal TTBar PU 13_2_0_pre1 sample reminied ,\r\n```\r\nrecoSlimmedSuperClusters_reducedEgamma_slimmedSuperClusters_PAT. 504.762 358.507\r\n```\r\nfurther size tests are on going.", "branch": "master", "changed_files": 9, "comments": 13, "commits": 1, "created_at": "1687171247", "deletions": 69, "labels": ["reconstruction-rejected", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved", "xpog-pending", "egamma", "changes-dataformats"], "milestone": "CMSSW_15_1_X", "number": 42007, "release-notes": [], "review_comments": 0, "state": "open", "title": "Adding in slimmed superclusters for EGM efficiency measurements to Mini", "updated_at": "1757480098", "user": "Sam-Harper"}