{"additions": 1467, "auther_ref": "dqm-new-tests", "auther_sha": "9472f998d3777c164a8fced0e2e9c45d2b431057", "author": "schneiml", "body": "#### PR description:\r\n\r\nThis PR imports the `Demo` package, replacing the old examples, from the the `new DQMStore` branch, as well as some new tests. These changes where part of #28407  before, but make more sense as an independent PR. However, this PR now depends on #28407. [Edit: rebased now that #28407 is merged.]\r\n\r\n- The `DQMServices/Demo` package, which contains some simple modules of each class and configuration to exercise the DQM framework, with no dependence on \"real\" CMSSW configurations. This replaces the old DQM examples code, which used to show types of interaction with DQM that are not supported any more (much of it was deleted in previous PRs). The demo code still relies on unusual features, since it was designed to test behaviors that need to be respected by a EDM Product driven DQM as prototyped in the \"new DQMStore\" branch; since the current DQM is not fully based on products, the behavior is not complete for now. \r\n\r\n- The old `runTheWhiteRabbit` tests are removed and replaced with completely new tests. The new tests don't cover much about the actual *correctness* of the DQM output (it turns out that in the details many things are arguably wrong in the current implementation), but it tests running the DQM framework code in many common and nonstandard situations, to see that at least nothing crashes and basic sanity checks are fulfilled. Highlights include things like ProtoBuf output (only running in HLT normally), concurrent Lumisections (well actually, they are blocked by the modules, but it will use them once possible), and a simple memory consumption check (hoping this does not blow up in IB testing...)\r\n\r\n#### PR validation:\r\n\r\nOnly new code added here, and old tests removed. The old tests, as far as I remember, where running in the IB tests but never caught anything, even as large parts of DQM changed (unlike for example the `FwkIO` tests or the remaining `fastHadd` related tests).\r\n\r\nThe new tests are more generic, but cover many of the sanity checks I usually use during development. We could be more specific about the expected output, but I don't want to set the old, arguably buggy, behavior in stone.", "branch": "master", "changed_files": 287, "closed_at": "1578990095", "comments": 46, "commits": 28, "created_at": "1576146780", "deletions": 39982, "labels": ["code-checks-approved", "comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "faab36ae4c9dcd524e64dd55c587e123d267b8db", "merged_at": "1578990095", "merged_by": "cmsbuild", "milestone": "CMSSW_11_1_X", "number": 28612, "release-notes": [], "review_comments": 3, "state": "closed", "title": "DQM: New tests and Demo", "updated_at": "1578990096", "user": "schneiml"}