{"additions": 5, "auther_ref": "fix-infloop", "auther_sha": "a7c69c61933d5bc8f3ce26ca72b13b52a0b062bb", "author": "cvuosalo", "body": "In the simulation step of ttbar and zmm DD4hep workflows, after a large number of events, the program would get stuck in an infinite loop. This problem was tracked to a loop in `ZdcShowerLibrary.cc`.\r\n\r\nThis code performs parameterizations to obtain the values of average energy and sigma. It does a check to see if the parameterization failed by producing negative energy or sigma values. However, the code had a typo, where, instead of checking whether sigma was negative, it was checking a variable that is always set explicitly to 1 or 3. Because the value of sigma was not being checked, in rare cases where sigma was negative, the program proceeded to a `while` loop that would go on endlessly because sigma had a nonsense value.\r\n\r\nThis PR fixes the typo so bad values of sigma cause the function to return immediately as intended rather than fall into the infinite loop.\r\n\r\nThere is still the open question of why DD4hep exposed this bug. It seems there is some small difference in ZDC geometry between old DD and DD4hep that somehow created these bad sigma values. That will require more investigation.\r\n\r\n#### PR validation:\r\n\r\nThe ttbar DD4hep workflow was run with debugging messages, and that showed the negative sigma values were caught and the infinite loop was avoided.\r\n\r\nNo backport is needed.", "branch": "master", "changed_files": 1, "closed_at": "1606318070", "comments": 11, "commits": 1, "created_at": "1606257567", "deletions": 6, "labels": ["code-checks-approved", "comparison-available", "fully-signed", "orp-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "698e8bc5c936c5f52474e5e05bd08c4a0330f355", "merged_at": "1606318070", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 32273, "release-notes": [], "review_comments": 2, "state": "closed", "title": "[DD4hep] Fix infinite loop discovered in DD4hep workflows", "updated_at": "1606318070", "user": "cvuosalo"}