{"additions": 5326, "auther_ref": "1100pre9_VHIntegration", "auther_sha": "97bb1e339aa02daa2cb2c24bd2e0762143f119d6", "author": "JanFSchulte", "body": "This PR integrates the possibility to reconstruct \"Vector Hits\" from the 2 hits of the 2S modules in the Phase 2 OT. These hits will have directional as well as positional information and are expected to help especially with seeding for displaced tracks in the OT in Phase 2. The concept is documented extensively in @ebrondol 's PhD thesis: http://cds.cern.ch/record/2308020 \r\n\r\nCurrent developments are going to be documented here: https://twiki.cern.ch/twiki/bin/view/CMSPublic/TrackingVectorHits\r\n\r\nThe strategy for integration of the VHs has been discussed during last week's TRK POG meeting: https://indico.cern.ch/event/847559/contributions/3572893/attachments/1914802/3165228/VectorHits_status_sept25.pdf. \r\nThis PR will leave the VH reconstruction deactivated and it not expected to result in any changes in Physics Performance. This has been validated using 1000 ttbar events from a Phase 2 RelVal sample using the D41 detector geometry and workflow 20434.1 in CMSSW_11_0_0_pre9. The output of the full track validation can be found here: https://jschulte.web.cern.ch/jschulte/VH/plots/\r\n\r\nAs can be seen here https://jschulte.web.cern.ch/jschulte/VH/plots/plots_highPurity/effandfakePtEtaPhi.pdf The performance using this branch is compared to 11_0_0_pre9 out of the box (red vs blue). Comparing the number of hits per track (https://jschulte.web.cern.ch/jschulte/VH/plots/plots_ootb/hitsAndPt.pdf) shows a significant reduction when VH are activated (black markers) as two hits in the 2S modules are merged into one VH. Note that out of the box this reduces the tracking performance. \r\n\r\nA follow-up PR will add the necessary tuning of the iterative tracking, including a new pixelLess iteration which will enable displaced track reconstruction for Phase 2. This will include a new era modifier to allow toggling between the current and the proposed configuration. This tuning is in progress but a first version should be available in a couple of weeks. \r\n\r\n ", "branch": "master", "changed_files": 78, "closed_at": "1576507887", "comments": 116, "commits": 22, "created_at": "1569947248", "deletions": 125, "labels": ["code-checks-approved", "comparison-available", "geometry-pending", "new-package-pending", "orp-pending", "pending-signatures", "reconstruction-rejected", "simulation-pending", "tests-rejected", "upgrade-pending"], "milestone": "CMSSW_11_1_X", "number": 28101, "release-notes": [], "review_comments": 225, "state": "closed", "title": "Integrating VectorHits reconstruction for the Phase2 OT ", "updated_at": "1576507888", "user": "JanFSchulte"}