{"additions": 1148, "auther_ref": "portCaloParams", "auther_sha": "078d8e09011882398841c0e8c53d8f84129ecfad", "author": "aloeliger", "body": "#### PR description:\r\n\r\nIn the ongoing L1T Offline Software effort to move away from maintaining a parallel fork of CMSSW for Phase 1 development we have been requested to migrate caloParams files used for testing of the L1T system to a central location for their broader usage by L1T developers. This should represent all 2022 and 2023 _Heavy Ion_ caloParams.\r\n\r\nThis is a potential requirement/solution to the ongoing https://github.com/cms-sw/cmssw/pull/42245\r\n\r\n@bundocka Could you double check that this contains all necessary 2022 and 2023 params files, and that this should make #42245 _in theory_ mergeable with no dangling references? \r\n\r\n@mitaylor If there is anything else that you know that the HI configurations would need ported, please let me know. \r\n\r\n@perrotta If this is not going to be suitable long term solution for the storage of L1T configuration files, perhaps now is the time to discuss what happens to these instead, but I would very much like to not have to manage a central L1T fork that I try to keep running parallel to the main CMSSW repository, because de-synchronization is all but guaranteed. \r\n\r\nMy apologies for slow response, I am still technically on holiday until the 23rd/24th when I arrive back in Geneva.\r\n\r\n#### PR validation:\r\n\r\nThese files represent L1 configuration to be stored centrally, and is not involved in any central workflows\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport\r\n", "branch": "master", "changed_files": 7, "comments": 0, "commits": 1, "created_at": "1692723487", "deletions": 0, "labels": ["l1-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending"], "milestone": "CMSSW_13_3_X", "number": 42632, "release-notes": [], "review_comments": 0, "state": "open", "title": "Port of 2022 and 2023 HI L1T CaloParams testing files", "updated_at": "1692723508", "user": "aloeliger"}