{"additions": 169, "auther_ref": "unpackerInspection", "auther_sha": "5ae4a7b0ee6b6afa782495cc3664f6625942108f", "author": "aloeliger", "body": "### PR description:\r\n\r\n[Following the discovery of corrupted data out of the GT unpacker](https://github.com/cms-sw/cmssw/issues/41645#issuecomment-1547724193), [the discussed intermediate solution is a filter that checks for corruption](https://github.com/cms-sw/cmssw/issues/41645#issuecomment-1559217926) . This PR contains a prototype that checks a GT object output collection for having the correct number of BX's, and will fire the filter if this not found, and produce an empty vector for anything that might be caught by the filter (and pass through for anything else). I am calling this module/filter the GT Unpacker Inspector. \r\n\r\nIt is my understanding that the desired longer term solution may be a change in the way CMSSW handles skippable errors?\r\n\r\nIn theory, this is at least a partial solution to https://github.com/cms-sw/cmssw/issues/41645\r\n\r\nAs of the writing of this, this is still a draft/prototype, and has not been hooked up to any of the original unpacker's clients. @mmusich @makortel Apologies for the long delay, but you were on the original thread where this solution was discussed, I wanted to tag you to understand if this is something that would meet the needs discussed there. If you have any review, I would appreciate this before I begin to start trying to insert this into the unpacking paths.\r\n\r\n### PR validation:\r\n\r\n[PR validation has not been possible due to the original file disappearing to tape](https://github.com/cms-sw/cmssw/issues/41645#issuecomment-1576871301), with the relvant block being 2.5 Tb (a little much to recall from tape for a single file). I would like to solicit suggestions for the testing of this module/technique.\r\n\r\n### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nThis PR is not a backport, but could be backported to reconstruction releases as necessary.", "branch": "master", "changed_files": 7, "comments": 17, "commits": 2, "created_at": "1687167402", "deletions": 0, "labels": ["l1-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_16_0_X", "number": 42005, "release-notes": [], "review_comments": 0, "state": "open", "title": "Initial GT Unpacker Inspector Prototype.", "updated_at": "1757484219", "user": "aloeliger"}