{"additions": 6, "auther_ref": "PatchHGCalTypes_161X", "auther_sha": "24fc6c4f7fe8c2656a99db3dbbe8046363fb8cdd", "author": "kpedro88", "body": "#### PR description:\r\n\r\nChanges in #49763 led to disruption in Phase 2 workflows, as reported in #49795. It was eventually found that the error could occur even in brand-new MC (consuming no old input files), meaning that it must be the result of an actual inconsistency, not just an incompatibility between releases.\r\n\r\nI found one bug in #49763 (inadvertent change in the order of the list of constants), which is fixed here. However, this bug did not turn out to be the cause of the workflow errors.\r\n\r\nOnly reverting the changes in the values of the constants from #49763 fixes the workflows. I still do not know why this is the case. Every usage of these values that I can find compares them to the actual named constants, not raw/hardcoded versions of the values. But there must be some comparison somewhere that does use raw values and therefore becomes inconsistent with the change. For now, all we can do is revert the change. If the new values were in fact correct, they can be restored at a later time once all usage is understood and corrected.\r\n\r\n#### PR validation:\r\n\r\nRan on the example failing workflow from https://github.com/cms-sw/cmssw/issues/49795#issuecomment-3837618786. Also ran on a privately produced sample of MC from the same generator fragment that showed the same error. The workflows run successfully with the changes in this PR.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nNot a backport, should not need to be backported because this change was only introduced in 16_1_X.", "branch": "master", "changed_files": 1, "comments": 11, "commits": 3, "created_at": "1770241377", "deletions": 6, "labels": ["geometry-pending", "pending-signatures", "orp-pending", "hold", "tests-started", "code-checks-pending"], "milestone": "CMSSW_16_1_X", "number": 50039, "release-notes": [], "review_comments": 0, "state": "open", "title": "Patch to fix workflow errors from HGCalTypes changes", "updated_at": "1770262455", "user": "kpedro88"}