{"additions": 27, "auther_ref": "PFClusterSeedFinderUpdate", "auther_sha": "78186ffde5cc57fe1d76d128f0b97c767471c223", "author": "hatakeyamak", "body": "Add additional checks for seed candidate masking to deal with HCAL geometry complications (phi segmentation and depth segmentation change versus eta).\r\n\r\n#### PR description:\r\n\r\nThis PR will fix some logical flaw in channel masking used for PF clustering seed finder. When we look for a clustering seed, for HCAL, we usually look at 4 neighbors along swiss-cross, and if the seed-candidate has higher energy than the 4 neighbors, the seed-candidate becomes seed, and neighbors get masked from becoming seed candidates. However, in HCAL, this logic causes complications (1) when the depth segmentation changes from one ieta to another ieta, (2) when the phi segmentation changes from one ieta to another ieta. In such boundary area, even if a channel A is one of four neighbors of channel B, the channel B may not be one of four neighbors of channel A.\r\n\r\nNow, this channel masking will be done, in the case of HB/HE/HF, only when the neighbors are strictly on the same depth layer and has the same eta or phi. Then, the seed finder channel masking will happen only when two channels are neighbors for each other.\r\n\r\nThis change will make the seed finder of this CPU code and the seed finder of the GPU code (under development) consistent and address issues reported on page-15 of:\r\nhttps://indico.cern.ch/event/986788/contributions/4155121/attachments/2165561/3654817/PFClusterGPUV4.pdf\r\n\r\n#### PR validation:\r\n\r\nThe usual PF validation plots from **Mark Saunders**: @zeratul87 without and with this PR.\r\nhttp://hep.baylor.edu/msaunder/PFval/HCAL_validation_plots\r\nThere are some differences in the endcap, but don't look significant.\r\n\r\nIn addition, \r\n![deltaSumSeed](https://user-images.githubusercontent.com/5814980/107591258-d58b2380-6bcf-11eb-8320-01bdffd7765c.png)\r\nshows that, with this PR, we can get a perfect agreement between CPU and GPU seed finders (thx M. Saunders)\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nThis is not backport.\r\n\r\n@bendavid @jsalfeld @zeratul87\r\n", "branch": "master", "changed_files": 2, "closed_at": "1613063812", "comments": 9, "commits": 2, "created_at": "1612991197", "deletions": 1, "labels": ["code-checks-approved", "fully-signed", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "d81422ea0d5022d71ba676bbe0b4d32fee127c4c", "merged_at": "1613063812", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 32873, "release-notes": [], "review_comments": 2, "state": "closed", "title": "Add additional checks for seed candidate masking to deal with HCAL geometry complications", "updated_at": "1613063812", "user": "hatakeyamak"}