{"additions": 186, "auther_ref": "subEventGenJetHIminiAOD", "auther_sha": "fdbde17a165a0920340428a2b1d9ddf24aeedcdf", "author": "mandrenguyen", "body": "#### PR description:\r\n\r\nFor PbPb generators such as Hydjet we cluster the genJets for each nucleon-nucleon interaction separately.   This is done by SubEventGenJetProducer.cc, which gives collections like ak4HiGenJets, already in use in heavy-ion workflows.\r\nIn order to do a sensible genJet-recoJet association in PAT, one needs additional procedures that depends on what type of MC is run (ditto for parton association).   \r\nFor \"minimum-bias\" generation (a single PbPb event), one needs a cleaning procedure to avoid matching energetic recoJets to incidental overlapping low pT genJets.\r\nFor \"embedded mode\" where we overlay a pp generator (e.g., pythia) onto a PbPb event, we need to use the gen info from the signal event only, despite the fact that we store both the signal and background event in genParticles. \r\n   \r\nThe code modifications consist of: \r\n- The genJetSubEvent modifier was added, and activated for all MB Hydjet RelVal worklows that use the pp reconstruction (the older --scenario HeavyIons workflows are not able to run miniAOD).  \r\n- Producers were added to filter out the signal gen information from genParticles.  These are active if the above modifier is not called.  In a pp event without event overlay, the code will return the usual gen info.  \r\n- A counter was added to PATGenJetSlimmer.cc such that it no longer assumes pT-ordered genJets, which is not the case for the sub-event genJet producer \r\n- SubEventGenJetProducer no longer produces a collection of BasicJets, which were not used for anything, and were causing trouble for modules that don't get by type. \r\n- slimmedGenJets now takes as input the heavy-ion style genJets\r\n- slimmedGenJetsFlavourInfos was disactivated, since it doesn't work for sub-event genJets.  It's not consumed by any downstream module in heavy-ion wfs. \r\n\r\n#### PR validation:\r\n\r\nTested with 158, 159,  158.01 and 301.   \r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\n<!-- Please replace this text with any link to  -->\r\n\r\nBefore submitting your pull requests, make sure you followed this checklist:\r\n- verify that the PR is really intended for the chosen branch\r\n- verify that changes follow [CMS Naming, Coding, And Style Rules](http://cms-sw.github.io/cms_coding_rules.html)\r\n- verify that the PR passes the basic test procedure suggested in the [CMSSW PR instructions](https://cms-sw.github.io/PRWorkflow.html)\r\n", "branch": "master", "changed_files": 12, "closed_at": "1603174122", "comments": 55, "commits": 10, "created_at": "1602077204", "deletions": 31, "labels": ["analysis-approved", "code-checks-approved", "comparison-available", "fully-signed", "operations-approved", "orp-approved", "pdmv-approved", "reconstruction-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "1a7004c4def093c1d06acec3039492d44db39db5", "merged_at": "1603174122", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 31698, "release-notes": [], "review_comments": 30, "state": "closed", "title": "Sub-event aware genJet and parton matching for HI miniAOD", "updated_at": "1603889532", "user": "mandrenguyen"}