{"additions": 141, "auther_ref": "noiseCleanedLocalCov_113X", "auther_sha": "c7bd7c1840f829b5f0daba9f47f815e246d13bb6", "author": "swagata87", "body": "#### PR description:\r\nThis PR introduces ECAL noise-cleaned full5x5 local covariances(shower shape variables) to be used in Run3. We make use of per-crystal PF recHit thresholds as an absolute energy cut on crystals' energy for noise cleaning. \r\nIf,  `E_i < (thres_i * mult)` , then the i-th crystal do not enter the definition of local covariances;\r\nhere `E_i = energy in i-th crystal`, `thres_i = PF recHit threshold of i-th crystal` and `mult is a multiplicative factor `obtained from dedicated studies. For run3 scenarios, mult=1.0 and 1.25 worked best for barrel and endcap respectively. In the plot below, one can see why 1.25 was chosen for endcap, instead of 1.\r\n[SigmaIEtaIEta_Endcap_Run3.pdf](https://github.com/cms-sw/cmssw/files/6123196/SigmaIEtaIEta_Endcap_Run3.pdf)\r\n\r\nMore details and some performance plots of noise cleaned full5x5_sigmaIEtaIEta can be found in this public DP note:  https://twiki.cern.ch/twiki/bin/view/CMSPublic/CMSEgammaRun3IDvariable\r\n\r\nThe noise-cleaned variables will be used for e/gamma ID in run3, as they show better performance in several scenarios. The noise cleaning is also expected to lead to better data & MC agreement, which is to be checked when Run3 data arrives. This is because noise is difficult to model in MC.\r\n\r\nIn this PR, changes have been made such that the getter functions for full5x5 local covariances like GsfElectron::full5x5_sigmaIetaIeta(), Photon::full5x5_sigmaIetaIeta() etc will return the noise-cleaned versions of these variables. If for some reason the old variables are needed, they can be computed at analysis-level ntuplizer code, by running on miniAOD. An example to access old version of full5x5 sigmaIEtaIEta for electron is shown here:  https://github.com/swagata87/OldLocalCovMiniAOD/blob/main/plugins/OldLocalCovMiniAOD.cc\r\n\r\nMost of the studies were made in the context of Run3 offline reco. But in e/gamma HLT, one of the most important variable to reject QCD background is full5x5_sigmaIEtaIEta, and this will benefit from the noise-cleaning, as evident from the plots shown in DPS note. So changes were also made in the e/gamma HLT producer code.\r\n\r\n[with thanks to @Sam-Harper and @jainshilpi]\r\n\r\n#### PR validation:\r\nrunTheMatrix limited test ", "branch": "master", "changed_files": 10, "closed_at": "1616540791", "comments": 17, "commits": 10, "created_at": "1615466960", "deletions": 21, "labels": ["code-checks-approved", "fully-signed", "hlt-approved", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "936cf5281aeaabd6f5b6ffa59675c46cdb17b683", "merged_at": "1616540791", "merged_by": "cmsbuild", "milestone": "CMSSW_11_3_X", "number": 33148, "release-notes": [], "review_comments": 7, "state": "closed", "title": "Noise cleaning of e/gamma shower-shape variables using PF RecHit thresholds (11_3_X)", "updated_at": "1616540791", "user": "swagata87"}