{"additions": 356, "auther_ref": "DQMLongLivedModule", "auther_sha": "aa11f15fabfb4ec23b8d2b06acaa30ab0dfef418", "author": "aescalante", "body": "Since CMSSW_7_5_0_pre5 there is a RelValDisplacedSUSY_stopToBottom_M_300_1000mm_13 RelVal sample and the goal of this PR is to include 7 efficiency plots dedicated to validate that sample in montecarlo.\n\n1)      dispElec_elec_effi_lxy: efficiency to reconstruct the electron from the long-lived stop using the gsfElectron collection vs. transverse decay length of long-lived stop.\n2)      dispElec_track_effi_lxy: efficiency to reconstruct the electron from the long-lived stop using the generalTrack collection vs. transverse decay length of long-lived stop.\n3)      dispJet_track_effi_lxy: efficiency to reconstruct the other tracks from the long-lived stop, besides the directly produced lepton, using  the generalTrack collection vs. transverse decay length of long-lived stop.\n4)      dispMuon_muonDispSA_effi_lxy: efficiency to reconstruct the muon from the long-lived stop using Juliette's displacedStandAloneMuonscollection vs. transverse decay length of long-lived stop. This gives good efficiency for Lxy < 330 cm.\n5)      dispMuon_muonDisp_effi_lxy: efficiency to reconstruct the muon from the long-lived stop using Bing's displacedGlobalMuons vs. transverse decay length of long-lived stop. This gives OK efficiency for Lxy < 80 cm.\n6)      dispMuon_muon_effi_lxy: efficiency to reconstruct the muon from the long-lived stop using the standard Muon collection vs. transverse decay length of long-lived stop.\n7)      dispMuon_track_effi_lxy: efficiency to reconstruct the muon from the long-lived stop using the generalTrack collection vs. transverse decay length of long-lived stop.\n\nAdditionally a new file has been added to  DQM/Physics/test/exoticaDQM_cfg.py to test the full module. \nAlberto in behalf of Ian Tomalin (author of the module).\n", "branch": "CMSSW_7_6_X", "changed_files": 4, "closed_at": "1443594916", "comments": 1, "commits": 4, "created_at": "1443540738", "deletions": 14, "labels": ["comparison-pending", "dqm-pending", "orp-pending", "pending-signatures", "tests-pending"], "milestone": "CMSSW_7_6_X", "number": 11561, "release-notes": [], "review_comments": 0, "state": "closed", "title": "New Long lived module for ExoDQM", "updated_at": "1443594916", "user": "aescalante"}