{"additions": 724, "auther_ref": "new_branch_PR", "auther_sha": "ca3846f8315bcef99fcd6ac2f7e57b5b60ef1060", "author": "kk428", "body": "My goal was to examine the efficiency of LST close to the center of jets. To do this, I generated a trackingNtuple.root file and clustered it into jets. The trackingNtuple.root file is too large to upload here, but the code I used to create the jets is in reformat_jets.py and myjets.py. Currently, these files are configured to read in the usual ttbar sample.\r\n\r\nThose two files add six branches to the original trackingNtuple.root file. These branches are sim_deltaEta, sim_deltaPhi, sim_deltaR, (formerly sim_etadiffs, sim_rjetdiffs, sim_rjet), sim_jet_eta, sim_jet_phi, and sim_jet_pt). The sim_deltaR branch is the most relevant here R is the eta-phi distance between a track and the center of the closest jet.\r\n\r\nIn order to create efficiency plots for this, I modified the existing LST files to include my branches. This mostly involved copying lines of code and changing the relevant branch names. In a few places, I have included cuts or edits to how the efficiency plots are produced. (Everywhere I have made a change I also added a comment to the effect of \"Added by Kasia\", but this was only so that I could find my own changes quickly when I need them.) The only change to the original LST output under this configuration is that if a track is not part of a jet, it is not included. However, if the input root file does not contain my six custom branches, LST will not compile. This pull request is mainly to demonstrate what I have done.\r\n\r\nHere is the indico link to the presentation I gave to the LST group on 3/18/25:\r\nhttps://indico.cern.ch/event/1496305/contributions/6303105/attachments/3034297/5358002/Jet%20Efficiencies.pdf\r\n\r\nEDIT 6/16/25:\r\nTo enable/disable the code responsible for reading in the branches I added, I added a flag -J. This flag needs to be included both with the lst_BACKEND command and with createPerfNumDenHists. For example:\r\n\r\nlst_make_tracklooper -mcC;\r\nlst_cpu -J -s 32 -i \"new_tree.root\" -l -o LSTNtuple.root;\r\ncreatePerfNumDenHists -J -i LSTNtuple.root -o LSTNumDen.root;\r\nWithout this -J flag, LST is unaffected by my changes. With the -J flag, all that changes is that new efficiency plots are produced that group existing sim tracks together based on their position within a jet.\r\n", "branch": "master", "changed_files": 10, "comments": 1, "commits": 2, "created_at": "1754406219", "deletions": 60, "labels": ["reconstruction-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-pending", "tracking"], "milestone": "CMSSW_15_1_X", "number": 48674, "release-notes": [], "review_comments": 0, "state": "open", "title": "LST: Modifying LST to create efficiency plots for jets", "updated_at": "1754406243", "user": "kk428"}