{"additions": 29, "auther_ref": "xrdAdaptorRetryInactive", "auther_sha": "688b9dc7fc2a116f58ee15ba3e67e426344162c1", "author": "makortel", "body": "#### PR description:\r\n\r\nIn the context of https://github.com/cms-sw/cmssw/issues/43162 and https://github.com/cms-sw/cmssw/issues/46086#issuecomment-2683002208, this PR changes the XrdAdaptor behavior for request failures. Previously, after disabling the source that resulted the request failure, it passed on the request to another active source, and if there were no active sources, it tried to open a new source. This PR changes to logic to\r\n* Pass request to another active source\r\n* If there are no active sources, pass the request to the best inactive source\r\n* If there are no active or inactive sources, try to open a new source\r\n\r\nThe first commit generalizes the code where the failed source is removed from the active sources container. I found it confusing that the code checked only the first 2 active sources (even if there would only ever be at most 2 active sources). Admittedly, if there would be more than 2 active sources, the commit would change the behavior, but I would argue for the better.\r\n\r\nResolves https://github.com/cms-sw/framework-team/issues/1306\r\n\r\n#### PR validation:\r\n\r\nCode compiles.\r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\n\r\nPossibly to be backported to 15_0_X.", "branch": "master", "changed_files": 1, "comments": 11, "commits": 2, "created_at": "1741885295", "deletions": 9, "labels": ["core-pending", "pending-signatures", "tests-approved", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_15_1_X", "number": 47593, "release-notes": [], "review_comments": 3, "state": "open", "title": "[RFC] XrdAdaptor: Use inactive sources first before trying to open a new source when handling a failed request", "updated_at": "1741973044", "user": "makortel"}