{"additions": 97, "auther_ref": "hcalTPGCoderULUTConcurrentIOVs", "auther_sha": "8379dbfbfa7cc5bf3f89d4d5ae0d080c738ae453", "author": "wddgit", "body": "Currently the Framework only allows one EventSetup IOV (Interval of Validity) to be processed at a time, but we are preparing to change this in the future and allow multiple concurrent IOVs. This PR modifies the ESProducer of type HcalTPGCoderULUT in preparation for this change.\r\n\r\nPrior to this, the ESProducer held a pointer to a single HcaluLUTTPGCoder object. After this PR it will use the ReusableObjectHolder class to manage multiple objects of this type, one for each concurrent IOV. The objects needs to hold different content for different IOVs and the ESProducer needs to modify them during its produce call in a thread safe manner.\r\n\r\nThe dependsOn feature of the EventSetup has difficulty communicating with these different objects in the callbacks and produce function calls. The usage of the dependsOn feature is replaced by usage of the new ESProductHost class. It has a similar purpose, but works better when there are multiple IOVs because its interface allows direct communication via arguments between the produce methods and the lambda function that gets called when the dependent record changes.\r\n\r\nNote that the one very minor change in DataFormats/HcalRecHit is a bug fix. It was failing to compile with debug flags because a static member variable which needed to be defined was not defined.", "branch": "master", "changed_files": 6, "closed_at": "1539194671", "comments": 15, "commits": 2, "created_at": "1536595759", "deletions": 39, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "fully-signed", "l1-approved", "orp-approved", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "55a4c1c57c15eab2b7f0b71f7a00e0f31756ed69", "merged_at": "1539194671", "merged_by": "cmsbuild", "milestone": "CMSSW_10_4_X", "number": 24496, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Prepare HcalTPGCoderULUT for concurrent IOVs", "updated_at": "1539194671", "user": "wddgit"}