{"additions": 4980, "auther_ref": "trackergeo_readyforupgrade-74x", "auther_sha": "24ff1b32f227f224b2e10fb22ae5899e065929d6", "author": "venturia", "body": "New GeomDetEnumerators and GeometricDet enumerators have been added to host the tracker upgrade subdetectors. \nThe building of the TrackerGeometry object is less hardcoded and depends on the enumerator values\nNew methods added to the TrackerGeometry object to provide, for each DetId subdetector index, the subdetector type (through the GeomDetEnumerators) and the number of layers in the subdetector. In addition the method \"isThere\" has been added to allow to check if a specific subdetector is in the geometry. This should allow to get rid of the several ad hoc configuration parameters to deal with the upgrade geometries.\nThe rules to code and decode the DetId schema are now completely configurable. Different detid schemas have been introduced for phase 1 and phase 2 geometries (in preparation for the integration of the upgrade geometries). \nAdded new CmsTrackerBuilder's to ease the modularity with respect to the upgrade geometries. Now all the branching is based on the value of the GeometricDet enumerators.\nThe same approach has been followed for the construction of the TkDetLayers tree.\nReplacement in many places of the checks on the DetId subset with checks on the GeomDetEnumerators (but the work is not finished). Migration from the static DetId classes to the TrackerTopology class (but the work is FAR from being finished). Added useful static methods to discriminate on the GeomDetEnumerators: isTrackerPixel, isTrackerStrip,  and modified the implementation of the corresponding methods in GeomDetType to profit of them (the GeomDetType is not always available). \nThe present tag is expect not to change ANYTHING in the workflow output as the corresponding (still) unpublished changes for CMSSW_6_2_X_SLHC are expected not to change anything in the upgrade workflow (unless the version with the new phase 2 detid is used).\n", "branch": "CMSSW_7_4_X", "changed_files": 143, "closed_at": "1420451560", "comments": 28, "commits": 50, "created_at": "1418740509", "deletions": 1912, "labels": ["alca-pending", "analysis-pending", "comparison-available", "dqm-approved", "geometry-approved", "pending-signatures", "reconstruction-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "ba11a88152e2e6452f55a37961cec0ec5aef1d00", "merged_at": "1420451560", "merged_by": "davidlange6", "milestone": "Next CMSSW_7_4_X", "number": 6947, "release-notes": [], "review_comments": 24, "state": "closed", "title": "Changes to prepare the integration of the Tracker upgrade geometries", "updated_at": "1473398337", "user": "venturia"}