{"additions": 544, "auther_ref": "RemoveUnnecessaryTypeInfoCalls", "auther_sha": "aba1bb9722195b50c4424f7d281f78f301b19b16", "author": "wmtan", "body": "This pull request has two purposes:\n\n1) In ROOT6, ROOT does not provide type_info information for non-class types, such as enums, pointers, and C-Style arrays.  This currently can cause TypeWithDict::typeInfo() to return incorrect information in the ROOT6 IB.  The first step to fixing this problem is to remove unnecessary calls to TypeWithDict::typeInfo().  This pull request does this in the framework and in\nCommonTools/Utils/src/AnyMethodArgument.h. Since the changed code works equally well in ROOT5, this is being requested in the main 7_4_X branch (ROOT5) for code commonality.\n\n2) I happened to notice that I had extensively edited several other source files in ComonTools/Utils in the ROOT6 branch to make them more readable (non-substantive formatting changes).  These changes should have been made in the main branch as well for code commonality.  This pull request makes the same changes in the main 7_4_X branch for code commonality with the ROOT6 IB.  All the changes in CommonTools/Utils, except for those in AnyMethodArgument.h, are essentially no-ops.\n\nAll unit tests in the affected packages pass and the short relval matrix tests still pass with these changes.\n\nI request that this pull request not be merged into the 7_4_X_ROOT6 branch, because these changes will be made there independently.  This is not critical, because I can clean things up if merging this causes any problems in the 7_4_X_ROOT6 branch.\n", "branch": "CMSSW_7_4_X", "changed_files": 18, "closed_at": "1419679818", "comments": 8, "commits": 2, "created_at": "1418413044", "deletions": 330, "labels": ["analysis-pending", "comparison-available", "core-approved", "pending-signatures", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "b49e3c42337d2f49bf5a3f7aaa5e15b66a4a8fcf", "merged_at": "1419679818", "merged_by": "ktf", "milestone": "Next CMSSW_7_4_X", "number": 6896, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Remove unnecessary type info calls", "updated_at": "1419694677", "user": "wmtan"}