{"additions": 43, "auther_ref": "checkEgammaCutforScouting", "auther_sha": "484f7353393525c539c922e10440b78d09693566", "author": "arsahasransu", "body": "Co-authored-by: Marino Missiroli <m.missiroli@cern.ch>\r\n\r\n#### PR description:\r\n\r\nAdd the sigmaietaieta calo id variable cut to the Run 3 scouting electron collection\r\n  - Use the same cut strategy as in the standard electron path.\r\n  - Default value is kept so that all the electrons pass without the cut.\r\n  - Default implementation is \"less than\" a certain cut value because the standard use of this variable is var < cut.\r\n  - Validated in presentation in the scouting group at https://indico.cern.ch/event/1174315/#1-update-on-scouting-electrons\r\n  - The EGamma sigmaietaieta variable will be updated with sigmaietaieta(noisecleaned) variable which can be done as a different collection input to the same variable to that has been left unchanged but will be part of the changes to the scouting path.\r\n \r\n#### PR validation:\r\n\r\nTo validate the changes in this PR\r\n  - We re-emulated the scouting path with MC and 2018 data files. \r\n  - Timing and Rate studies were done as well to see if the effect of the PR is as expected. \r\n  - All observations were found to be normal.\r\n  - In addition all the regular set of check such code-check and code-formatting has also been applied.\r\n\r\nBased on comments from Marino Missiroli <m.missiroli@cern.ch> in a previous version of the PR some changes have already been included. The old PR, which is now closed can be found at https://github.com/cms-sw/cmssw/pull/38597.", "branch": "master", "changed_files": 2, "comments": 9, "commits": 1, "created_at": "1657039722", "deletions": 3, "labels": ["hlt-pending", "pending-signatures", "tests-pending", "orp-pending", "code-checks-approved"], "milestone": "CMSSW_12_5_X", "number": 38602, "release-notes": [], "review_comments": 8, "state": "open", "title": "Add EGamma calo ID variable cut to Run 3 Scouting Electrons", "updated_at": "1657177855", "user": "arsahasransu"}