{"additions": 51, "auther_ref": "TPBXBinning_112X", "auther_sha": "aded2793397b7274aebb9419fbf67489026f7843", "author": "alejands", "body": "#### PR description:\r\n\r\nThis PR is fulfilling a request from ECAL DAQ to change the binning in the TP occupancy vs BX plot to have finer BX bins. The new binning is by BX rather than by groups of BXs, similar to the Timing vs BX finely binned plot used in Offline DQM. This leads to the new plot to be quite busy with many bins, but the expectation is that DAQ experts will zoom in on the x-axis using the Customize button on the DQM GUI to study their region of interest.\r\n\r\nSlight modifications were made to the TrigPrimTask module so the way the BX binning is done more closely matches what is done in the TimingTask module, which also contain some vs BX plots. Some plot descriptions were also updated to mention relevant information for these plots, such as the BX ids starting at 1, as well as a minor relabelling of the x-axis. \r\n\r\n#### PR validation:\r\n\r\nAn Online DQM-like workflow was run and the plots were uploaded to a private DQM GUI. We verified with ECAL DAQ that the new binning was to their liking. We also verified that the new BX binning changes did not affect any other plot binned by BX.\r\n\r\nValidations were rerun on the backport with no differences from the original PR.\r\n\r\n#### if this PR is a backport please specify the original PR and why you need to backport that PR:\r\n\r\nThis is a backport of the following PR: https://github.com/cms-sw/cmssw/pull/33264\r\n\r\nThe changes are wanted in CMSSW_11_2_X, to be used by DQM in the upcoming MWGR in April 2021.", "branch": "CMSSW_11_2_X", "changed_files": 4, "closed_at": "1617346733", "comments": 8, "commits": 1, "created_at": "1616709126", "deletions": 34, "labels": ["dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "5ee4931e892f1e0520121a4335bd2ebb561d6a02", "merged_at": "1617346732", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 33275, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Change binning of TP occupnacy vs BX plot and edit BX plot descriptions", "updated_at": "1617346733", "user": "alejands"}