{"additions": 1386, "auther_ref": "add_T32_cmssw_13_0_X", "auther_sha": "0fe7ea268445351f0e7cfa855f3143ea91bdb611", "author": "emiglior", "body": "This the work of @emiglior @adewit \r\n#### PR description:\r\nThis PR introduces \r\n\r\n-  introducing a baseline geometry with TBPX layer1 featuring 3D sensors instead of planar sensors\r\n-  new version of Pixel3DDigitizerAlgorithm with an improved description of the response of the 3D sensors before and after irradiation\r\n\r\nThe Tracker geometry used in the baseline CMS geometry for phase-2 is T24. On the other hand, T25 represents a more correct description of the actual layout of the detector chosen for phase-2, as it features 3D sensors in TBPX layer1. Unfortunately, T25 cannot be matched as it is with the latest developments of the MTD geometry (I16) as PR #39592  modified the boundary between OT and MTD. Note that Tracker T31 geometry is the same as T24 geometry, but with this new boundary.\r\nSimilarly, we propose to introduce a T32 geometry which is the same as T25 but with the new OT/MTD boundary and to adopt it as the new baseline phase-2 geometry so that it can be regularly exercised with RelVals and extended physics studies so that effects related to the change in the geometry can be decoupled wrt effects due to the change in the digitizer.\r\n**NOTE**: T32 is not yet the ultimate geometry, as the actual geometry features two separate 3D sensors for each TBPX layer1 modules. The implementation of this geometry is less trivial as it requires a change of the detID scheme and will be available only later this year.\r\n\r\nLink to the talk in simulation meeting :- https://indico.cern.ch/event/1247289/#48-phase-2-tracker-geometry-up\r\n\r\n#### PR validation:\r\nNew wf introduced ```24834.0``` runs without errors \r\n\r\n#### If this PR is a backport please specify the original PR and why you need to backport that PR. If this PR will be backported please specify to which release cycle the backport is meant for:\r\nNA\r\n", "branch": "master", "changed_files": 18, "closed_at": "1675430698", "comments": 48, "commits": 1, "created_at": "1675176520", "deletions": 5, "labels": ["geometry-approved", "operations-approved", "simulation-approved", "fully-signed", "tests-approved", "pdmv-approved", "orp-approved", "upgrade-approved", "code-checks-approved", "trk"], "merge_commit_sha": "30ae0259eaa86ef20982e45d62a5d322b75aa618", "merged_at": "1675430698", "merged_by": "cmsbuild", "milestone": "CMSSW_13_0_X", "number": 40647, "release-notes": [], "review_comments": 9, "state": "closed", "title": "Introducing a Tracker phase-2 geometry based on T25 but compatible with new OT/BTL boundary", "updated_at": "1675432774", "user": "sroychow"}