{"additions": 105, "auther_ref": "L1MenuConsistancyCheck_1120pre6", "auther_sha": "e58937d7b7d7bd97bd803c4e4ab2bdfcd5174509", "author": "Sam-Harper", "body": "\r\n#### PR description:\r\n\r\nThe L1 result is packed into the RAW data as 512 bits which each bit corresponding to a given L1 seed.  Which seed corresponds to a given bit is determined by the L1 menu which is sent as conditions data. It is possible for the wrong L1 menu to be read if the corresponding entry in the global tag is incorrect. In this case the bits will not correspond to the L1 seeds the HLT thinks they do and thus when it thinks its requiring EG40 to pass, its really requiring Mu16 (as a hypothetical example). \r\n\r\nThis PR adds the function which can convert the the firmware uuid to the hash of the firmware uuid send in the RAW data along with the L1 results. This can be then checked by the L1 GT emulator (L1TGlobalProducer) to ensure that the correct menu is being re-emulated and throw an exception if not. \r\n\r\nNote L1TGlobalProducer has two distinct use cases\r\n1) to emulate the L1 Global trigger when emulating the L1 in the MC or emulating a different L1 menu on the data\r\n2) to create the map of L1 objects to seeds which is needed for the HLT to properly use the seeds in its filters\r\n\r\nIt is use case 2) where we need to check that the menu we are emulating to create the l1 object map is the same as the menu used to create the L1 result in the RAW data. This is why this is an optional check (which will always be enabled in the HLT) as it doesnt make sense for use case 1)\r\n\r\nZero physics changes are expected. \r\n\r\n#### PR validation:\r\n\r\nrunTheMatrix tests succeeded.\r\n\r\ntesting with the incorrect menu resulted in the exception being thrown\r\n", "branch": "master", "changed_files": 5, "closed_at": "1601485781", "comments": 27, "commits": 1, "created_at": "1600104012", "deletions": 3, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "db-approved", "fully-signed", "l1-approved", "orp-approved", "tests-approved", "urgent"], "merge_commit_sha": "d0c137b1a96cc7656fdc5012f8fac7f0ecf65eda", "merged_at": "1601485781", "merged_by": "cmsbuild", "milestone": "CMSSW_11_2_X", "number": 31461, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Adding check to ensure L1Menu consistency in the HLT  : 112X", "updated_at": "1601529827", "user": "Sam-Harper"}