{"additions": 2426, "auther_ref": "SiPixelQualityPCL_For_CMSSW_10_1_X", "auther_sha": "3722e7df5698a58b32735f787e3eef62b0182d00", "author": "tocheng", "body": "Hello, \r\n  this PR is meant to embed the SiPixel quality offline analysis into PCL workflow.\r\n  The idea is to monitor the Pixel ROC quality based on its DIGI occupancy, and tag the ROC bad if its DIGI occupancy is extremely small compared with average per ROC DIGI occupancy.\r\n  Furthermore, the sources of Pixel bad components can be categorised as:\r\n  permanent bad components which is the one in current DB;\r\n  stuck TBM, can be tracked down using \"FED error 25\" packed in RAW data (permanent bad components also gives \"FED error 25\". One may want to subtract the permanent bad components from \"FED error 25\" list to monitor on the stuck TBM);\r\n  other sources, could be a ROC SEU, or some other reasons.\r\n\r\n   The current PCL workflow in the PR will analyse the ZeroBias triggered events in Express,\r\n   produce payload for each source of bad components, and produce one payload for prompt reconstruction which includes permanent bad components and other sources; stuck TBM is handled by PixelFEDCollection consumed by tracking event-by-event, hence not included in the tag (for prompt reco).\r\n\r\n  The information related to the SiPixel offline analysis can be found at https://indico.cern.ch/event/688098/contributions/2841553/attachments/1580192/2496819/20180109_PixelOffline_BadComponentAutomatization.pdf. (There was something wrong with the validation plots in the slides because some of the scripts used in the validation are not updated to Phase-I detector geometry.)\r\n\r\n  The PCL implementation was presented at Pixel Offline DPG meeting at\r\nhttps://indico.cern.ch/event/688859/contributions/2913583/attachments/1607768/2551726/PixelQualityPCL_Feb27th_2018_PixelOffline.pdf.\r\n\r\n   The workflow is validated as the following:\r\n    a tag is produced using a single run in 2017.\r\n    MC samples is generated using ideal condition and unpacked/reconstructed using the SiPixelQuality produced using single run in 2017 (useSiPixelQuality=true for RAW-to-DIGI). Cluster occupancy plots are produced (using SiPixel offline tool) and compared with the same plots in the same run on DQM offline GUI.\r\n    More details about the PCL implementation and validation plots will be presented at the Pixel Offline group meeting on March 6th.\r\nhttps://indico.cern.ch/event/688839/#25-bad-component-detection-at\r\n\r\nOn the relval workflow, the new ALCARECO and ALCAPROMPT are added into 1001 and a new workflow 1001.2 as Run-II version of 1001 is included. Workflow 1040.0 and 1040.1 are the workflow for Tier-0 production of the payload for SiPixelQuality alone. The validation using the tag produced I by workflow 1040.1 at https://www.dropbox.com/s/lxut72xnvb2nbb7/PixelQualityPCL_Mar16th_2018_Validation.pptx?dl=0.\r\n\r\nThe destination tags for the tags produced in the outputDB can be found at slide 8\r\nhttps://indico.cern.ch/event/688839/contributions/2923209/attachments/1612420/2560916/20180307_TrackerDPG_PixelBadComponentMonitoring.pdf.\r\n", "branch": "master", "changed_files": 34, "closed_at": "1522177150", "comments": 86, "commits": 24, "created_at": "1520245341", "deletions": 15, "labels": ["alca-approved", "code-checks-approved", "comparison-available", "fully-signed", "operations-approved", "orp-approved", "pdmv-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "234348ccf617d26c26258078c3bda04a21f988dd", "merged_at": "1522177150", "merged_by": "cmsbuild", "milestone": "CMSSW_10_1_X", "number": 22455, "release-notes": [], "review_comments": 2, "state": "closed", "title": "SiPixel Quality PCL for cmssw 10_1_X", "updated_at": "1522177163", "user": "tocheng"}