{"additions": 848, "auther_ref": "trackingValidationSelectionUpdate", "auther_sha": "428b85d404d9dbb7b63fb4f3703a1c36261e8754", "author": "makortel", "body": "This PR makes several updates to tracking validation\n- Add monitoring for BTV-like track selection\n- Add monitoring for tracks used in AK4 PFJets whose corrected pT > 10 GeV\n  - Add JetTracksAssociationToTrackRefs EDProducer to pick the Refs to tracks\n- Add histograms for pileup track rate (fraction of tracks matched to TrackingParticles) from pileup)\n- Add histograms for number of tracker layers, pixel layers, and 3D layers (=pixel+strip mono&stereo)\n  - Add TrackingParticleNumberOfLayers class to calculate them from TrackingParticles\n    - TP does not have a count of pixel nor strip mono&stereo layers\n    - The number of tracker layers is in TP, but the calculation in TrackingTruthAccumulator is slightly misleading\n      - It calculates the number of layer transitions when moving along the SimTrack inside out\n      - This is incorrect at least for loopers, and for TPs with multiple SimTracks having SimHits in same layers\n    - Eventually we should probably move to use HitPattern (either as a member of TP or as a ValueMap), but that is left for future development\n- Add fake rate vs. track chi2\n- Add summary plots for efficiency and fake rate per input track collection\n- Add \"standalone\" sequences so that MTV-only validation configuration can be generated with cmsDriver\n- Add configuration flags controlling which sets of histograms are booked and filled\n  - Not employed in this PR, but will be used in subsequent development\n- Remove the obsolete standalone-mode of MultiTrackValidator\n  - This mode allowed to produce efficiencies etc. in the same job as histograms were filled, but this can not work anymore due to MT DQM, and our recommendation has been already a while to run a separate harvesting step. Getting rid of obsolete code now to ease maintenance.\n\nTested in CMSSW_7_5_X_2015-05-12-2300. No changes expected in existing histograms.\n\n@rovere @VinInn \n", "branch": "CMSSW_7_5_X", "changed_files": 41, "closed_at": "1433512682", "comments": 43, "commits": 17, "created_at": "1432196259", "deletions": 498, "labels": ["analysis-approved", "comparison-available", "dqm-approved", "fastsim-approved", "fully-signed", "geometry-approved", "reconstruction-approved", "simulation-approved", "tests-approved"], "merge_commit_sha": "1d276f54afd8521a905f373835f25364bc80f2dc", "merged_at": "1433512682", "merged_by": "cmsbuild", "milestone": "CMSSW_7_5_X", "number": 9201, "release-notes": [], "review_comments": 0, "state": "closed", "title": "Add more histograms and track selections to MultiTrackValidator, remove standalone mode", "updated_at": "1476956301", "user": "makortel"}