{"additions": 1995, "auther_ref": "PixelClusterShapeExtractor", "auther_sha": "2004b4b252de2bb158e3c7348930436c0703f1f4", "author": "VinInn", "body": "This PR is composed of several components\r\n1) A new version of the PixelClusterShapeExtractor that tries to deal with spit/merged clusters at best\r\n3) A modified version of the ClusterShapeHitFilter that makes provision to use a different file for the first layer of the Barrel as it is the only one affected by long clusters and in 2017 data affected by inefficiency\r\n4) A new version of the calibration files for Phase1 and Phase2\r\n5) a rearrangement of DQM to monitor the ClusterShape\r\n6) a python notebook to analyze and compare calibration files\r\n7) new configuration files to perform the \"extraction\" \r\n8) updated documentation\r\n\r\nThe main reason of a new calibration is the changes in geometry (in particular for the forward pixel)\r\nthat happened in 910_pre3.\r\nThe new calibrations are based on 90K MinBias events from recent RelVal\r\n\r\nMVA\r\nfor phase1\r\nhttp://innocent.home.cern.ch/innocent/RelVal/pu35_candpcsf/\r\nfor phase2\r\nhttp://innocent.home.cern.ch/innocent/RelVal/newPCSF2/\r\n\r\nfor phase1 there is also a comparison of using \r\n1. the calibration obtained considering all layers\r\n2. the calibration obtained considering all layers but BPIX1\r\n3. and using the file \" obtained considering all layers but BPIX1\" for all layers but BPIX1 (for BPIX1 the file obtained considering all layers is used)\r\nhttp://innocent.home.cern.ch/innocent/RelVal/pu35_newpcsf/plots_highPurity/effandfake1.pdf\r\n\r\nfor Phase2 there is no difference.\r\nfor Phase1 there is no obvious improvements but more seeds in the forward region\r\n(this is observable also in DQM for both data and mc) i.e. higher efficiency for quadruplets at eta~2\r\nthere is also an increase in fake rate in the barrel (the effect on late iterations are more difficult to establish as they are affected by the changes in the previous one)\r\nStill this is the best calibration we can produce and the previous one was wrong as not covering properly the phasespace in the forward region (this calibration is the solution of an inverse problem, so it depends on the sample on which is trained)\r\n\r\nIt shall be noted that MVA (in particular for low-pt) is under retraining and shall be retrained once this PR is merged.\r\n\r\n", "branch": "master", "changed_files": 37, "closed_at": "1501223198", "comments": 73, "commits": 28, "created_at": "1500467241", "deletions": 1450, "labels": ["comparison-available", "dqm-pending", "hlt-approved", "orp-pending", "pending-signatures", "reconstruction-approved", "tests-approved", "upgrade-approved"], "merge_commit_sha": "ee43b2f4b1572e93b063248c3d2fe511f899ecfd", "merged_at": "1501223198", "merged_by": "cmsbuild", "milestone": "CMSSW_9_3_X", "number": 19824, "release-notes": [], "review_comments": 8, "state": "closed", "title": "Pixel cluster shape: new calibration for Phase1 and Phase2", "updated_at": "1501241232", "user": "VinInn"}