{"additions": 180, "auther_ref": "NewEGModifiers_8010", "auther_sha": "8ce00497bc096ea41f132952223ef1f569f2b2b6", "author": "Sam-Harper", "body": "I wish to embed VID & HEEP V7.0 information into pat::Electrons (and by extension pat::Photons). \r\n\r\nThis information is stored as a set of ValueMaps. Currently there is \r\nEGExtraInfoModifierFromFloatValueMaps \r\nEGExtraInfoModifierFromIntValueMaps \r\n\r\nin RecoEgamma/EgammaTools which do exactly what I need for floats and ints, however I need it for other data types. I diffed EGExtraInfoModifierFromIntValueMaps and EGExtraInfoModifierFromFloatValueMaps to ensure that the only differences were due to types. \r\n\r\nAs such I propose replacing EGExtraInfoModifierFromIntValueMaps and EGExtraInfoModifierFromFloatValueMaps with a templated class EGExtraInfoModifierFromValueMaps which can read an arbitrary type of ValueMap and write that value as another arbitrary type to the pat::Electron,pat::Photon. The option to write it as an arbitrary type is necessary to for the bool and uints as pat::PATObject has no way to store these values. I could have forced them to always store as an int but I dislike that as it violates the principle of least surprise and also if in the future pat::PATObject gains the ability to store bools and uints, this makes it easy to adapt to that case while retaining backwards compatibility. \r\n\r\nNote, EGExtraInfoModifierFromIntValueMaps and EGExtraInfoModifierFromIntValueMaps are part  of the miniAOD sequence however I see no changes when the new class. As it simply stores the value in pat::PATObject::userFloat and pat::PATObject::userInt, it should either clearly work or not. \r\n\r\nNow I hope I have named the files correctly and they are both in the correct location, I wasnt sure exactly what CMS filenaming policy is here for templates classes. \r\n\r\nSo far E/gamma has been informed about my request but as its the start of the year, I havent heard back from them yet. ", "branch": "CMSSW_9_0_X", "changed_files": 3, "closed_at": "1484299542", "comments": 10, "commits": 4, "created_at": "1484047430", "deletions": 273, "labels": ["comparison-available", "fully-signed", "orp-pending", "reconstruction-approved", "tests-approved"], "merge_commit_sha": "47f689a7426009fd474e1601a71f5e7dbf52f72a", "merged_at": "1484299542", "merged_by": "davidlange6", "milestone": "CMSSW_9_0_X", "number": 17138, "release-notes": [], "review_comments": 0, "state": "closed", "title": "New E/gamma pat::Electron and pat::Photon modifiers", "updated_at": "1484299543", "user": "Sam-Harper"}