{"additions": 1029, "auther_ref": "MergingGeometryFromSLHCDEV_fixed", "auther_sha": "87d08f7091aff81b08487b6f1a256c8a509fd7fc", "author": "ebrondol", "body": "This PR contains the main steps in order to have the flat stacked geometries of phaseII.\nIt summarizes the two main PR done in SLHCDEV: #12093 and #12321.\n- OTPhase2Stack has been introduced in order to recognize Phase2OTBarrelStack or Phase2OTEndcapStack in the trackerStructureTopology.xml.\n- The CmsDetConstruction class has been modified in such a way that it can recognize when the module is a stack and configured to search for lower and upper modules\n- Geometric Tracker Search has been fixed \n- StackGeomDet has been introduced in the build of the TrackerGeometry\n- the MeasurementTracker has now the possibility to build TkStackMeasurementDets\n\nI have added methods in the TrackerTopology in order to have access of the stack info (isStereo, isRPhi, isLower, isUpper, Glued and Stack).\nThe documentation has been updated (README, TkDetLayersTree).\n\nStill to do:\n1) removing DetBrothers from Geometric Tracker Search\n2) TkStackMeasurementDets is just a is a fake class in this moment - it is not used in the reconstruction\n3) in the TrackerGeomBuilderFromGeometricDet, the name of the GeomDet is used  in order to understand if it is a stack or a glued. This process can be time consuming, but this is going to be fixed soon with another PR.\n\n@boudoul @delaere @venturia @rovere @VinInn please check this PR.\n", "branch": "CMSSW_8_0_X", "changed_files": 53, "closed_at": "1454056935", "comments": 46, "commits": 17, "created_at": "1453217893", "deletions": 402, "labels": ["alca-pending", "comparison-available", "geometry-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "tests-approved"], "merge_commit_sha": "c5db4650838d131fe9f0657c0c511f04a60225d3", "merged_at": "1454056935", "merged_by": "davidlange6", "milestone": "CMSSW_8_0_X", "number": 12995, "release-notes": [], "review_comments": 17, "state": "closed", "title": "Fixing geometry in 80X release", "updated_at": "1454056935", "user": "ebrondol"}