{"additions": 89, "auther_ref": "ChangesFor2018_master", "auther_sha": "ec449da1af62f5d08e64e6491199086f6bd80a5e", "author": "tanmaymudholkar", "body": "This PR reintroduces a few changes that were merged with the production CMSSW version last year but were not integrated with CMSSW master. In addition, there are a couple of new commits implementing some changes requested by ECAL experts. Here is a summary of the changes:\r\n\r\n---> From 2017:\r\n\r\n(1) Fixed bug in binning that led to incorrect bin numbers while filling many 2D histograms by supercrystal based on the electronics ID.\r\n\r\n(2) Using beam status information from TCDS Digis, implemented a mask on the usual false alarms on TP occupancy during cosmics for ECAL.\r\n\r\n---> New commits:\r\n\r\n(3) Improved patch to ignore events causing ECAL DQM Calibration application crashes. This was what caused the delay in merging my commits into CMSSW master last year -- at the time, the code used a try-catch block which was not good from the efficiency point of view. This try-catch block has now been replaced with a much simpler if condition.\r\n\r\n(4) Modified noise tolerance in presample plots to range (175, 240) ADC counts instead of the current (175, 225) ADC counts, because the pedestal value in some towers has been drifting higher especially in the endcaps causing the presample plots to be liberally peppered with RED channels.\r\n\r\nLink to the corresponding PR to CMSSW P5 production version: https://github.com/cms-sw/cmssw/pull/22688", "branch": "master", "changed_files": 14, "closed_at": "1522767797", "comments": 21, "commits": 8, "created_at": "1521594358", "deletions": 14, "labels": ["code-checks-approved", "comparison-available", "dqm-approved", "fully-signed", "orp-approved", "tests-approved"], "merge_commit_sha": "bba2b7f20f57e197dcd737bc06b8cc0fc40b7c26", "merged_at": "1522767797", "merged_by": "cmsbuild", "milestone": "CMSSW_10_2_X", "number": 22689, "release-notes": [], "review_comments": 1, "state": "closed", "title": "Binning fixes, calibration patch, cosmics false alarm fix, noise tolerance (for CMSSW master)", "updated_at": "1522767797", "user": "tanmaymudholkar"}